[
    {
        "quote": "Less is more and more is more. It’s the middle that’s not a good place.",
        "author": "Paula Scher"
    },
    {
        "quote": "That’s why pro bono work is great. You choose to do it, and if you’re choosing to do it to grow your own work, your deal is essentially that you’re not going to collaborate. You’re going to do the job the way you think the job is gonna be done.",
        "author": "Paula Scher"
    },
    {
        "quote": "Better to be tentative than to be recklessly sure—to be an apprentice at sixty, than to present oneself as a doctor at ten.",
        "author": "Michel Eyquem de Montaigne"
    },
    {
        "quote": "Don’t you miss doing creative stuff, as an engineer? Don’t you miss the creativity of the art world? You can say: I’m working on an infinite canvas capable of any size and shape, that’s already glowing every color possible into the eyes of just about everyone on the planet. And I get to decide the kind of experience, feeling, and emotion they are going to have. How is that not creative?",
        "author": "Natalya Shelburne"
    },
    {
        "quote": "Delete, delete, delete and at the end find the ‘core aspect of the design’.",
        "author": "Achille Castiglioni"
    },
    {
        "quote": "The great thing about personal work is that it can shape your commercial work. Clients see what you create for yourself and that can be the starting point for a new project, which closes the cap between the work you love making and the work you get paid for.",
        "author": "Gemma O’Brien"
    },
    {
        "quote": "Work hard and be nice to people. No one is born with the ability, and no one owes you anything. If you want to do something, start small and build it up. Then keep doing it!",
        "author": "Jon Hicks"
    },
    {
        "quote": "All the Photoshop filters in the world won’t save a weak design.",
        "author": "William Childs"
    },
    {
        "quote": "The time it takes to make a decision increases as the number of alternatives increases.",
        "author": "William Edmund Hick"
    },
    {
        "quote": "Design is a solution to a problem. Art is a question to a problem.",
        "author": "John Maeda"
    },
    {
        "quote": "You don’t think your way to creative work. You work your way to creative thinking.",
        "author": "George Nelson"
    },
    {
        "quote": "If you think good design is expensive, you should look at the cost of bad design.",
        "author": "Ralf Speth"
    },
    {
        "quote": "Those who don’t build must burn.",
        "author": "Ray Bradbury"
    },
    {
        "quote": "Styles come and go. Good design is a language, not a style.",
        "author": "Massimo Vignelli"
    },
    {
        "quote": "The goal of a designer is to listen, observe, understand, sympathize, empathize, synthesize, and glean insights that enable him or her to make the invisible visible.",
        "author": "Hillman Curtis"
    },
    {
        "quote": "Where do new ideas come from? The answer is simple: differences. Creativity comes from unlikely juxtapositions.",
        "author": "Nicholas Negroponte"
    },
    {
        "quote": "How well we communicate is determined not by how well we say things, but how well we are understood.",
        "author": "Andrew Grove"
    },
    {
        "quote": "Recognizing the need is the primary condition for design.",
        "author": "Charles Eames"
    },
    {
        "quote": "Letterspacing creates speedbumps for the reader.",
        "author": "Michael Stinson"
    },
    {
        "quote": "I don’t think of myself as an artist. I know some designers consider themselves such, but I can’t. This is not to say that I don’t hope that our work has artistic merit. Anyway, I never know how someone could proclaim himself or herself to be an ‘artist’; I think it should be a designation best left for others to bestow, much like ‘genius’ and ‘asshole’.",
        "author": "Alexander Isley"
    },
    {
        "quote": "Her complexity is a glorious fire that consumes, while her simplicity goes unapproachable. But if one takes time to understand her, there is something beautiful to find, something simple to be loved. But she goes unloved, for being misunderstood.",
        "author": "Anthony Liccione"
    },
    {
        "quote": "A good design solves a problem. A bad design creates many.",
        "author": "Samadara Ginige"
    },
    {
        "quote": "If you spend an hour now, you can save five later.",
        "author": "Rami Hassan"
    },
    {
        "quote": "A portfolio as pretty as pictures is nothing but a tip of the iceberg, the real treasure underlies the ocean.",
        "author": "Shawn Lukas"
    },
    {
        "quote": "When typography is on point, words become images.",
        "author": "Shawn Lukas"
    },
    {
        "quote": "Much like music, great art is also found in the spaces between your graphic elements.",
        "author": "William Childs"
    },
    {
        "quote": "Learning Web Design is like playing video games: You start small and build your character as you progress, then you beat the boss, literally.",
        "author": "Ricardo Zea"
    },
    {
        "quote": "Graphic design is building systems.",
        "author": "Michael Stinson"
    },
    {
        "quote": "Graphic design is putting a flower pot in a skyscraper",
        "author": "@C0D4"
    },
    {
        "quote": "Art is I; science is we.",
        "author": "Claude Bernard"
    },
    {
        "quote": "Research not to discover what’s already there, but to discover what’s not.",
        "author": "Samadara Ginige"
    },
    {
        "quote": "When it comes to writing code, the number one most important skill is how to keep a tangle of features from collapsing under the weight of its own complexity.",
        "author": "John D. Cook"
    },
    {
        "quote": "Instead of asking the user to make a choice up front, maybe we can set a smart default and see if there is high demand after launch for more customization.",
        "author": "Rebecca Rolfe"
    },
    {
        "quote": "[Designers’] primary competence lies not in the technicalities of a craft but in the mastery of a process.",
        "author": "Ralph Caplan"
    },
    {
        "quote": "Design is a process for making things right, for shaping what people need.",
        "author": "Ralph Caplan"
    },
    {
        "quote": "Tech without design is the business’s perdition.",
        "author": "Vital Lokossou"
    },
    {
        "quote": "If you’re not prepared to be wrong, you’ll never come up with anything original.",
        "author": "Sir Ken Robinson"
    },
    {
        "quote": "Any product that needs a manual to work is broken.",
        "author": "Elon Musk"
    },
    {
        "quote": "A user interface is like a joke. If you have to explain it, it’s not that good. ",
        "author": "Martin LeBlanc"
    },
    {
        "quote": "Y’all talk about UX like it’s just another feature. For a user, it literally is the product. Full stop. Everything else is inside baseball.",
        "author": "Startup L. Jackson"
    },
    {
        "quote": "Everything we do communicates.",
        "author": "Pete Episcopo"
    },
    {
        "quote": "The only 'intuitive' interface is the nipple. After that it’s all learned.",
        "author": "Bruce Ediger"
    },
    {
        "quote": "Only show work you like, or you’ll end up being hired to do things you don’t like.",
        "author": "Victoria Pater"
    },
    {
        "quote": "If you want to be the designer that stands out of the rest, do something more than just designing. Make an interesting project like for charity, start an agency, hold an exhibition, start a design festival or build a site like Behance. Become interesting.",
        "author": "Jennifer Cirpici"
    },
    {
        "quote": "It takes a lot of effort to make something seem effortless.",
        "author": "Alexander Isley"
    },
    {
        "quote": "The grid is like the lines on a football field. You can play a great game in the grid or a lousy game. But the goal is to play a really fine game.",
        "author": "Wim Crouwel"
    },
    {
        "quote": "Advertising is the one industry where all the experts seem to be the people who don’t work in it.",
        "author": "William Childs"
    },
    {
        "quote": "Just because it’s simple doesn’t mean it makes sense.",
        "author": "Morgan Ashley"
    },
    {
        "quote": "A lot of the things about design that tend to get designers really interested aren’t that important.",
        "author": "Michael Bierut"
    },
    {
        "quote": "We need to shift from designing applications to designing implications.",
        "author": "Anthony Dunne & Fiona Raby"
    },
    {
        "quote": "A good portfolio will get you an interview. A good attitude will get you a job.",
        "author": "Marty Amsler"
    },
    {
        "quote": "Design should never be ridden with GGE’s (gratuitous graphic elements).",
        "author": "Nadine Buckley"
    },
    {
        "quote": "What’s the hardest thing to communicate? The hardest thing is to communicate.",
        "author": "Michael Cina"
    },
    {
        "quote": "Choosing a typeface is an act of subtlety, like casting an actor: the best person to play a gardener is somebody who looks like they might belong outdoors — not somebody who is covered in flowers and shrubbery.",
        "author": "Josh Collinsworth"
    },
    {
        "quote": "You do not need to have a great idea before you can begin working; you need to begin working before you can have a great idea.",
        "author": "Josh Collinsworth"
    },
    {
        "quote": "Any attempt to separate design, to make it a thing-by-itself, works counter to the inherent value of design as the primary, underlying matrix of life.",
        "author": "Victor Papanek"
    },
    {
        "quote": "Design for many instead of designing for money.",
        "author": "Victor Papanek"
    },
    {
        "quote": "You can be misunderstood exactly once. After that, you are not being misunderstood; you are communicating poorly.",
        "author": "Josh Collinsworth"
    },
    {
        "quote": "If you haven’t surprised yourself yet, you haven’t done enough sketching.",
        "author": "Josh Collinsworth"
    },
    {
        "quote": "Just let the type just do what it does.",
        "author": "Michael Stinson"
    },
    {
        "quote": "Just because your ad looks good is no insurance that it will get looked at. How many people do you know who are impeccably groomed… but dull?",
        "author": "Bill Bernbach"
    },
    {
        "quote": "I warn you against believing that advertising is a science.",
        "author": "Bill Bernbach"
    },
    {
        "quote": "Rules are what the artist breaks; the memorage never emerged from a formula.",
        "author": "Bill Bernbach"
    },
    {
        "quote": "We are so busying measuring public opinion that we forget we can mold it. We are so busy listening to statistics we forget we can create them.",
        "author": "Bill Bernbach"
    },
    {
        "quote": "A brand is the promise of an experience.",
        "author": "Alexander Isley"
    },
    {
        "quote": "Not everyone notices the flowers you plant, but everyone will notice the fire you start.",
        "author": "Unknown"
    },
    {
        "quote": "Most of what we see that we call information doesn’t inform, and most questions do not have a quest.",
        "author": "Richard Saul Wurman"
    },
    {
        "quote": "If it sounds good, you’ll hear it. If it looks good, you’ll see it. If it’s marketed right, you’ll buy it. But if it’s real, you’ll feel it.",
        "author": "Kid Rock"
    },
    {
        "quote": "Design is more about the process than it is about the resulting prettiness.",
        "author": "Melissa Sisco"
    },
    {
        "quote": "When designing an interface, imagine that your program is all that stands between the user and hot, sweaty, tangled-bedsheets-fingertips-digging-into-the-back sex.",
        "author": "Randall Munroe"
    },
    {
        "quote": "If I do my job well, the identity program will also clean up the image of the company, position it as being contemporary and keep it from ever looking dated.",
        "author": "Saul Bass"
    },
    {
        "quote": "Innovation leads one to see the new in the old and distinguishes the ingenious from the ingenuous.",
        "author": "Paul Rand"
    },
    {
        "quote": "Design is everywhere. From the dress you’re wearing to the smartphone you’re holding, it’s design.",
        "author": "Samadara Ginige"
    },
    {
        "quote": "Good design is in all the things you notice. Great design is in all the things you don’t.",
        "author": "Wim Hovens"
    },
    {
        "quote": "Objects and their manufacture are inseparable, you understand a product if you understand how it’s made.",
        "author": "Jonathan Ive"
    },
    {
        "quote": "Complexity is the enemy of reliability.",
        "author": "Kyle Matthew Hansen"
    },
    {
        "quote": "Work your ass off. Don’t be an asshole.",
        "author": "Stefan Sagmeister"
    },
    {
        "quote": "If you knew how much work went into it, you would not call it genius.",
        "author": "Michelangelo"
    },
    {
        "quote": "Don’t explain why it works; explain how you use it.",
        "author": "Steven Brust"
    },
    {
        "quote": "To see takes time.",
        "author": "Georgia O’Keeffe"
    },
    {
        "quote": "There is no such thing as simple. Simple is hard.",
        "author": "Martin Scorsese"
    },
    {
        "quote": "Nobody ever get fired for running an A\/B test.",
        "author": "Chad Mazzola"
    },
    {
        "quote": "Eloquence is vehement simplicity.",
        "author": "Richard Cecil"
    },
    {
        "quote": "Theory can blind observation.",
        "author": "Carol Gilligan"
    },
    {
        "quote": "Where I come from, gettin’ visual is habitual.",
        "author": "GZA"
    },
    {
        "quote": "All things are designed, just some things more thoughtfully than others.",
        "author": "Arman Nobari"
    },
    {
        "quote": "If we have trouble using something then it’s probably because that thing is badly designed, rather than us being stupid.",
        "author": "Dmitry Fadeyev"
    },
    {
        "quote": "Man up, admit it isn’t good enough, and fix it now.",
        "author": "Robert Nealan"
    },
    {
        "quote": "Design is the body language of your marketing. Don’t slouch.",
        "author": "Mark King"
    },
    {
        "quote": "In the presence of good rationale, maintainers should be willing to change their mind often.",
        "author": "Havoc Pennington"
    },
    {
        "quote": "Five years ago, the heroes were technologists. Today, the heroes are designers building out a user experience. You can have the most amazing technology in the world, but if it’s not put in a form that’s useful and desirable, you won’t be successful.",
        "author": "Robert Brunner"
    },
    {
        "quote": "You have to finish things — that’s what you learn from, you learn by finishing things.",
        "author": "Neil Gaiman"
    },
    {
        "quote": "The whole essence of good drawing—and of good thinking, perhaps—is to work a subject down to the simplest form possible and still have it believable for what it is meant to be.",
        "author": "Chuck Jones"
    },
    {
        "quote": "To ignore social media would be like early man ignoring fire.",
        "author": "Barry Roos"
    },
    {
        "quote": "A good designer finds an elegant way to put everything you need on a page. A great designer convinces you half that shit is unnecessary.",
        "author": "Mike Monteiro"
    },
    {
        "quote": "Technology makes what was once impossible possible. Design makes it real.",
        "author": "Michael Gagliano"
    },
    {
        "quote": "Design is content with intent. Content without intent is noise. Intent without content is decoration.",
        "author": "Joe Sparano"
    },
    {
        "quote": "Success finally came when we were able to convince some creative men that good appearance was a salable commodity, that it often cut costs, enhanced a product’s prestige, raised corporate profits, benefited the customer and increased employment.",
        "author": "Raymond Loewy"
    },
    {
        "quote": "Write it down. You will lose thoughts, you thought, that you thought.",
        "author": "Vanessa Workoff"
    },
    {
        "quote": "Minimalism is not a lack of something. It’s simply the perfect amount of something.",
        "author": "Nicholas Burroughs"
    },
    {
        "quote": "Some people want their paychecks and to go home, and that’s fine. You and me, though—we’re gonna work harder than they do. We’ll build things that ensure that entire populations just setting foot on the web for the first time can tap into the collected knowledge of the whole of mankind.",
        "author": "Mat Marquis"
    },
    {
        "quote": "You don’t have to be 'a creative' to be creative.",
        "author": "Drory Ben-Menachem"
    },
    {
        "quote": "If you never want to be criticized, for goodness’ sake don’t do anything new.",
        "author": "Jeff Bezos"
    },
    {
        "quote": "Elegance is not the abundance of simplicity. It is the absence of complexity.",
        "author": "Alex White"
    },
    {
        "quote": "We read best what we read most.",
        "author": "Zuzana Licko"
    },
    {
        "quote": "Don’t let your design resist your readers. Don’t let it stand in the way of what they want to do: read.",
        "author": "Steve Krug"
    },
    {
        "quote": "Easy is not to be underestimated. Easy taps the pool of talent and ideas out there that were turned off by hard.",
        "author": "Chris Anderson"
    },
    {
        "quote": "Why expect spec work from a graphic designer when you don’t expect the same from a dentist?",
        "author": "Samadara Ginige"
    },
    {
        "quote": "Wonderfully designed > beautifully designed. Any day.",
        "author": "Daniel Burka"
    },
    {
        "quote": "It’s not uncommon for designers to confuse a beautiful looking product with one that works beautifully.",
        "author": "Braden Kowitz"
    },
    {
        "quote": "Be curious. Read widely. Try new things. I think a lot of what people call intelligence boils down to curiosity. ",
        "author": "Aaron Schwartz"
    },
    {
        "quote": "Stare. It is the way to educate your eye, and more. Stare, pry, listen, eavesdrop. Die knowing something. You are not here long.",
        "author": "Walker Evans"
    },
    {
        "quote": "Design is crucially important. We can’t have advances in technology any longer, unless design is integrated from the very start.",
        "author": "John Underkoffler"
    },
    {
        "quote": "A graphic designer is a machine that turns coffee into beautiful, functional imagery.",
        "author": "Lisa Manson"
    },
    {
        "quote": "Instead of shooting arrows at somebody else’s target… I make my own target around wherever my arrow has happened to have landed.",
        "author": "Brian Eno"
    },
    {
        "quote": "The medium is the message.",
        "author": "Marshall McLuhan"
    },
    {
        "quote": "As long as there are people, there will be user experience, and user interface designers.",
        "author": "Steve McGarry"
    },
    {
        "quote": "Ideas are worthless. Execution is everything.",
        "author": "Scott Adams"
    },
    {
        "quote": "Tell it like it is, in a way they want to hear it.",
        "author": "Wihan Meerholz"
    },
    {
        "quote": "To create anything–whether a short story or a magazine profile or a film or a sitcom–is to believe, if only momentarily, you are capable of magic.",
        "author": "Tom Bissel"
    },
    {
        "quote": "Never let the blood show.",
        "author": "Charles Eames"
    },
    {
        "quote": "Talent is a pursued interest. In other words, anything you are willing to practice, you can do. ",
        "author": "Bob Ross"
    },
    {
        "quote": "If you want a quick logo that has no research, brand definition or storytelling as part of its development, then you are buying ART not DESIGN. Design creates connections.",
        "author": "Lisa Manson"
    },
    {
        "quote": "Give a crap. Don’t give a fuck.",
        "author": "Karen McGrane"
    },
    {
        "quote": "Every new thing you make will be (should be) the nicest thing you’ve made so far, because you’re learning and getting better with each and every new project.",
        "author": "Jessica Hische"
    },
    {
        "quote": "The most valued products will be designed to live beyond the device, context, or technology they were originally intended for.",
        "author": "Stephanie Rieger"
    },
    {
        "quote": "Good design is finding a solution to a problem. Great design is finding the simplest solution to the same problem.",
        "author": "Nicholas Petersen"
    },
    {
        "quote": "When we think of design, we usually imagine things that are chosen because they are designed. Vases or comic books or architecture…",
        "author": "Seth Godin"
    },
    {
        "quote": "I want to risk hitting my head on the ceiling of my talent. I want to really test it out and say: O.K., you’re not that good. You just reached the level here. I don’t ever want to fail, but I want to risk failure every time out of the gate.",
        "author": "Quentin Tarantino"
    },
    {
        "quote": "I go to work every morning with the possibility that I might learn something I don’t already know… You should look at every problem and think, ‘what can I learn by doing this?’ And if you think you can learn nothing, forget about doing it.",
        "author": "Milton Glaser"
    },
    {
        "quote": "When I am down, [I am] not good at any work, including design work.",
        "author": "Stefan Sagmeister"
    },
    {
        "quote": "Design has to work, art does not.",
        "author": "Donald Judd"
    },
    {
        "quote": "Creativity is the greatest rebellion in existence.",
        "author": "Osho"
    },
    {
        "quote": "Simplicity is not about making something without ornament, but rather about making something very complex, then slicing elements away, until you reveal the very essence.",
        "author": "Christoph Niemann"
    },
    {
        "quote": "Buy the best and you only cry once.",
        "author": "Miles Redd"
    },
    {
        "quote": "I think design would be better if designers were much more skeptical about its applications. If you believe in the potency of your craft, where you choose to dole it out is not something to take lightly.",
        "author": "Frank Chimero"
    },
    {
        "quote": "Whoever tells the best story wins.",
        "author": "Annette Simmons"
    },
    {
        "quote": "The next time you’re caught in a room full of smart people doing something dumb (like trying to anticipate what your users will do), tune them out, flip open your laptop, and start prototyping.",
        "author": "Daniel Burka"
    },
    {
        "quote": "I like jumping back and forth between a few different things to let my subconscious chew on one problem while my conscious works on something else.",
        "author": "Loren Brichter"
    },
    {
        "quote": "If everyone likes your design, it’s banal. Mediocrity shirks offense. Art dares it.",
        "author": "Jeffrey Zeldman"
    },
    {
        "quote": "Designers tend to overvalue differentiation and originality. We are taught this in design school. The best solutions are created ex nihilo, break new ground, resemble nothing else in the world. Everyone wants to stand out, or else what’s the point? But this isn’t true. Most people don’t want to stand out. They want to fit in. More precisely, they want to fit in with the people they like, or want to be like.",
        "author": "Michael Bierut"
    },
    {
        "quote": "In design, there is no such thing as 'rules'. There is however, common sense.",
        "author": "Ken Dyment"
    },
    {
        "quote": "If I forget the words, they weren’t very memorable in the first place.",
        "author": "Willie Nelson"
    },
    {
        "quote": "I have no data yet. It is a capital mistake to theorize before one has data. Insensibly one begins to twist facts to suit theories, instead of theories to suit facts.",
        "author": "Sherlock Holmes"
    },
    {
        "quote": "Ideas trump aesthetics. Convenience trumps UI. Content trumps platforms.",
        "author": "Marc-Oliver Gern"
    },
    {
        "quote": "When you do things right, people won’t be sure you’ve done anything at all.",
        "author": "God (from Futurama)"
    },
    {
        "quote": "No one is finally dead until the ripples they cause in the world die away, until the clock wound up winds down, until the wine she made has finished its ferment, until the crop they planted is harvested. The span of someone’s life is only the core of their actual existence.",
        "author": "Terry Pratchett"
    },
    {
        "quote": "It’s OK to do stupid things, except when you notice them.",
        "author": "Kenny Shopsin"
    },
    {
        "quote": "I can never stand still. I must explore and experiment. I am never satisfied with my work. I resent the limitations of my own imagination.",
        "author": "Walt Disney"
    },
    {
        "quote": "Usage is like oxygen for ideas.",
        "author": "Matt Mullenweg"
    },
    {
        "quote": "If you look at any designer you admire, whose work inspires you, and whose approach somehow resonates with you, I promise you’ll find a person who does not think of what they do as just their job.",
        "author": "Alexander Isley"
    },
    {
        "quote": "To create great work, here’s how you must spend your time:",
        "author": "George Lois"
    },
    {
        "quote": "Rejection process is not fun. It’s the red pen on the page, the discarded sketch, sometimes is the only way forward.",
        "author": "Jonah Lehrer"
    },
    {
        "quote": "Design in art, is a recognition of the relation between various things, various elements in the creative flux. You can’t invent a design. You recognize it, in the fourth dimension. That is, with your blood and your bones, as well as with your eyes.",
        "author": "D.H. Lawrence"
    },
    {
        "quote": "We are only three decades into one of the most important revolutions the world has ever seen. In design development terms, that is a mere blink.",
        "author": "Rachel Hinman"
    },
    {
        "quote": "Communication that doesn’t take a chance doesn’t stand a chance.",
        "author": "Carlos Segura"
    },
    {
        "quote": "Web design has a bad reputation for being stylistically trendy and same-looking. Some guy does a parallax scrolling site, and now your boss wants you to add that to your corporate PR website for some reason. Glossy buttons, Gaussian Noise, linen texture, new things that look fake-old, then back to minimalism and flat colors as a reaction to the glossy noisy textured fake-old stuff.",
        "author": "Jonas Downey"
    },
    {
        "quote": "You can be watching TV and see Coca-Cola, and you know that the President drinks Coke, Liz Taylor drinks Coke, and just think, you can drink Coke, too. A Coke is a Coke and no amount of money can get you a better Coke than the one the bum on the corner is drinking. All the Cokes are the same and all the Cokes are good. Liz Taylor knows it, the President knows it, the bum knows it, and you know it.",
        "author": "Andy Warhol"
    },
    {
        "quote": "Sometimes magic is just someone spending more time on something than anyone else might reasonably expect.",
        "author": "Raymond Joseph Teller"
    },
    {
        "quote": "Modern typographic axioms:",
        "author": "Lucian Bernhard"
    },
    {
        "quote": "If you see a snake, just kill it. Don’t appoint a committee on snakes.",
        "author": "H. Ross Perot"
    },
    {
        "quote": "Sure, our competitors will laugh. Let them laugh so hard that they cannot breathe.",
        "author": "Sam Ward"
    },
    {
        "quote": "If all else fails, [working harder than anyone else] is the greatest competitive advantage of any career.",
        "author": "John C Jay"
    },
    {
        "quote": "I hear and I forget. I see and I remember. I do and I understand.",
        "author": "Confucius"
    },
    {
        "quote": "Smart people learn from their mistakes. But the real sharp ones learn from the mistakes of others.",
        "author": "Brandon Mull"
    },
    {
        "quote": "Information is cheap, meaning is expensive.",
        "author": "George Dyson"
    },
    {
        "quote": "Right and wrong do not exist in graphic design. There is only effective and non-effective communication.",
        "author": "Peter Bilak"
    },
    {
        "quote": "Simply making decisions, one after another, can be a form of art.",
        "author": "John Gruber"
    },
    {
        "quote": "There is a very fine line between stupid and clever.",
        "author": "David St. Hubbins"
    },
    {
        "quote": "To clarify, add detail. Imagine that, to clarify, add detail. Clutter and overload are not attributes of information, they are failures of design. If the information is in chaos, don’t start throwing out information, instead fix the design.",
        "author": "Edward Tufte"
    },
    {
        "quote": "Great ideas, like babies, are often conceived after a few glasses of wine.",
        "author": "Sharon Moore"
    },
    {
        "quote": "Design in the key to everything. If you learn how to design you can do anything.",
        "author": "Doug Cranmer"
    },
    {
        "quote": "Having a style is like being in jail.",
        "author": "Anthon Beeke"
    },
    {
        "quote": "The best and most beautiful things in the world cannot be seen or even touched. They must be felt with the heart.",
        "author": "Helen Keller"
    },
    {
        "quote": "No matter how many times your amazing, absolutely brilliant work is rejected by the client, for whatever dopey, arbitrary reason, there is often another amazing, absolutely brilliant solution possible.",
        "author": "Bob Gill"
    },
    {
        "quote": "When we engage in what we are naturally suited to do, our work takes on the quality of play and it is play that stimulates creativity.",
        "author": "Linda Naiman"
    },
    {
        "quote": "The best ideas come as jokes. Make your thinking as funny as possible.",
        "author": "David Ogilvy"
    },
    {
        "quote": "The advice I like to give young artists, or really anybody who’ll listen to me, is not to wait around for inspiration. Inspiration is for amateurs; the rest of us just show up and get to work.",
        "author": "Chuck Close"
    },
    {
        "quote": "Design works best when it gets out of the user’s way.",
        "author": "Neil Gajera"
    },
    {
        "quote": "If there is one word I’d like to remove from any conversation about design, it’s 'pretty.'",
        "author": "Aarron Walter"
    },
    {
        "quote": "People don’t use a product because of the great design; great design helps them use the product.",
        "author": "Viran Anuradha Dayaratne"
    },
    {
        "quote": "Design is about enabling ideas, processes and products: making them approachable, usable, desireable and memorable.",
        "author": "Jay Dutta"
    },
    {
        "quote": "If a design can be refined, without disturbing its image, it seems reasonable to do so. A logo, after all, is an instrument of pride and should be shown at its best.",
        "author": "Paul Rand"
    },
    {
        "quote": " To push the boundaries, you need to know where the edges are.",
        "author": "Mark Boulton"
    },
    {
        "quote": "Good Design:",
        "author": "Eliot Noyes"
    },
    {
        "quote": "Passion, dedication, and silly lists of what designers need are what designers need.",
        "author": "Arman Nobari"
    },
    {
        "quote": "Design is more of a kitchen than a knife, and more of a lab than a beaker.",
        "author": "Arman Nobari"
    },
    {
        "quote": "Thirty spokes meet in the hub,\nbut the empty space between them\nis the essence of the wheel.",
        "author": "Lao Tse"
    },
    {
        "quote": "It’s all one to me: opera, painting, drawing, faxes.",
        "author": "David Hockney"
    },
    {
        "quote": "One paints with one’s head, not one’s hand.",
        "author": "Michalangelo"
    },
    {
        "quote": "I don’t want something special. I want something beautifully plain.",
        "author": "Anne Lamott"
    },
    {
        "quote": "A good design is driven by needs and defined by constraints.",
        "author": "Astik Pant"
    },
    {
        "quote": "I found I could say things with color and shapes that I couldn’t say any other way – things I had no words for.",
        "author": "Georgia O’Keeffe"
    },
    {
        "quote": "Creativity is just connecting things. When you ask creative people how they did something, they feel a little guilty because they didn’t really do it, they just saw something. It seemed obvious to them after a while.",
        "author": "Steve Jobs"
    },
    {
        "quote": "Every great design begins with an even better story.",
        "author": "Lorinda Mamo"
    },
    {
        "quote": "We make the whole widget.",
        "author": "Steve Jobs"
    },
    {
        "quote": "Testing one user early in the project is better than testing fifty near the end.",
        "author": "Steve Krug"
    },
    {
        "quote": "Typography is a beautiful group of letters, not a group of beautiful letters.",
        "author": "Steve Byers"
    },
    {
        "quote": "The difference between a weed and a flower is a judgement.",
        "author": "Wayne Dyer"
    },
    {
        "quote": "Design must be functional and functionality must be translated into visual aesthetics, without any reliance on gimmicks that have to be explained.",
        "author": "Ferdinand A. Porsche"
    },
    {
        "quote": "Web design is responsive design. Responsive web design is web design, done right.",
        "author": "Andy Clarke"
    },
    {
        "quote": "Discontentment and reiteration are vital to good design.",
        "author": "Sammuel Nevarez"
    },
    {
        "quote": "Most companies are looking to 'wow' with their products, when in reality what they should be looking for is an 'of course' reaction from their users.",
        "author": "Christian Lindholm"
    },
    {
        "quote": "A design is a designer’s mind in a suit.",
        "author": "Nasa Munir"
    },
    {
        "quote": "The only way to be creative over time — to not be undone by our expertise — is to experiment with ignorance, to stare at things we don’t fully understand.",
        "author": "Jonah Lehrer"
    },
    {
        "quote": "Half the money I spend on advertising is wasted; the trouble is I don’t know which half.",
        "author": "John Wanamaker"
    },
    {
        "quote": "Like McDonalds proves, popular doesn’t necessarily mean good. I’m not particularly interested in what’s popular; I’m much more interested in what’s good.",
        "author": "Kris Sowersby"
    },
    {
        "quote": "Ability proceeds from a fusion of skills, knowledge, understanding and imagination, consolidated by experience.",
        "author": "Jonathan Rez"
    },
    {
        "quote": "Never half-ass two things. Whole-ass one thing.",
        "author": "Ron Swanson"
    },
    {
        "quote": "It’s extremely difficult to be simultaneously concerned with the end-user experience of whatever it is that you’re building and the architecture of the program that delivers that experience.",
        "author": "James Hague"
    },
    {
        "quote": "All the magic, be it in code or design, starts with a clear mind, pen and a blank paper.",
        "author": "Brian Wangila"
    },
    {
        "quote": "Design is to invent with intent. If you take away the ‘invent’ bit, you have an engineer. If you take away the ‘intent’ bit, you have an artist.",
        "author": "Rebecca Reubens"
    },
    {
        "quote": "The real issue is not talent as an independent element, but talent in relationship to will, desire, and persistence. Talent without these things vanishes and even modest talent with those characteristics grows.",
        "author": "Milton Glaser"
    },
    {
        "quote": "They enjoy giving form to ideas. If designers were made of ideas, they’d be their own clients.",
        "author": "Rudy VanderLans"
    },
    {
        "quote": "If a feature or product were legitimately easy the user would not be writing in to support about how stuck they are. Sure, some percentage of users will find questions to ask about any interface. But do you want to start the conversation by assuming the user falls into that percentage? You venture to learn much more if you assume the software is wrong, not the user.",
        "author": "Andrew Spittle"
    },
    {
        "quote": "Best thing about creating something is that it starts living it’s own life. ",
        "author": "Hristo Panayotov"
    },
    {
        "quote": "The difference between an artist and a graphic designer. One says 'it’s finished when I feel it’s finished' the other says 'I will have this by the 30th.'",
        "author": "Jay Benjamin"
    },
    {
        "quote": "Even large companies need small logos.",
        "author": "Tanner Christensen"
    },
    {
        "quote": "[If] people are made safer, more comfortable, more eager to purchase, more efficient, or just happier, the designer has succeeded.",
        "author": "Henry Dreyfuss"
    },
    {
        "quote": "There is nothing glamorous in what I do. I’m a working man. Perhaps I’m luckier than most in that I receive considerable satisfaction from doing useful work which I, and sometimes others, think is good.",
        "author": "Saul Bass"
    },
    {
        "quote": "Experience has shown that our best customers are ones who have as much respect for our time as we have for theirs.",
        "author": "Alex King"
    },
    {
        "quote": "Some people say design is about solving problems. Obviously designers solve problems but so do dentists. Design is about cultural invention.",
        "author": "Jack Schulze"
    },
    {
        "quote": "I find that when someone’s taking time to do something right in the present, they’re a perfectionist with no ability to prioritize, whereas when someone took time to do something right in the past, they’re a master artisan of great foresight.",
        "author": "Randall Munroe"
    },
    {
        "quote": "You get up early in the morning and you work all day. That’s the only secret.",
        "author": "Philip Glass"
    },
    {
        "quote": "It doesn’t matter one damn bit whether fashion is art or not. You don’t question whether an incredible chef is an artist or not – his cakes are delicious and that’s all that matters.",
        "author": "Sonia Rykiel"
    },
    {
        "quote": "Of course design is about problem solving, but I cannot resist adding something personal.",
        "author": "Wim Crouwel"
    },
    {
        "quote": "Use two typeface families maximum. OK, maybe three.",
        "author": "Timothy Samara"
    },
    {
        "quote": "Make it simple. Make it memorable. Make it inviting to look at. Make it fun to read.",
        "author": "Leo Burnett"
    },
    {
        "quote": "I am.",
        "author": "Robert Brownjohn (when asked What is graphic design?)"
    },
    {
        "quote": "Users will tell you what they think they want.\nUsers will tell you what they think you want to hear.\nUsers will tell you what they think sounds good.\nUsers will not tell you what you need to know.\nYou have to watch them to discover that.",
        "author": "Adam Judge"
    },
    {
        "quote": "Good designers are praised for their technique, great designers for their impact.",
        "author": "Tate Linden"
    },
    {
        "quote": "Having a favourite colour is like having a favourite lung.",
        "author": "Sara Genn"
    },
    {
        "quote": "It’s strange, I’ve seen colours at times that when I’ve gone back to check on them, they’ve vanished…",
        "author": "William Percy Weston"
    },
    {
        "quote": "There’s a difference between making an imitation and selling it.",
        "author": "Jonathan Hoefler"
    },
    {
        "quote": "Creativity is a drug I cannot live without.",
        "author": "Cecil B. DeMille"
    },
    {
        "quote": "Descriptions are like skirts, they should be long enough to cover the subject, but short enough to keep things interesting.",
        "author": "Gidsy.com"
    },
    {
        "quote": "… try to absorb what is useful, discard what is useless, and add what is essentially your own.",
        "author": "Bruce Lee"
    },
    {
        "quote": "If you are on Craigslist to get a sofa, and you see one for free. You think there’s something tragically wrong with it – maybe there are bedbugs. But if you see a sofa on there for $2,500, you think ‘oh man, that sofa must be amazing’. It’s the same thing with art – you set your own value.",
        "author": "Jessica Hische"
    },
    {
        "quote": "Orient your UI around the job to be done — around the problem — and not the person. Then people who have that problem can fall in love with your product because it makes the problem go away, whether they are the first in line or the last person to hear about it.",
        "author": "Ryan Singer"
    },
    {
        "quote": "The best way to find any and all errors is to publish your work.",
        "author": "Dan Vore"
    },
    {
        "quote": "There is an unmistakeable difference between a bag of rabbit parts and a rabbit.",
        "author": "Ryan Nance"
    },
    {
        "quote": "Creativity is magical, but is not magic.",
        "author": "Charles Limb"
    },
    {
        "quote": "IDEA BY SELF IS COLD. JUST SIT THERE. DO NOTHING.",
        "author": "FAKEGRIMLOCK"
    },
    {
        "quote": "I for one absolutely and unequivocally refuse to be bullied about by a thing’s capacity to absorb light. There is nothing less appealing than a color fraught with meaning – the very notion is boisterous, inappropriate, and marked by the dreariest sort of longing.",
        "author": "Fran Lebowitz"
    },
    {
        "quote": "To attempt mastery of everything inevitably makes us mediocre in many areas. ",
        "author": "Simon Collison"
    },
    {
        "quote": "I shall sing that first line twice, and perhaps if I sing it very quickly, I shall find myself singing the third and fourth lines before I have time to think of them, and that will be a Good Song.",
        "author": "Winnie The Pooh"
    },
    {
        "quote": "Designers must be stewards of design rather than dictators.",
        "author": "Cassie McDaniel"
    },
    {
        "quote": "Practicality is the serial killer of dreams.",
        "author": "Rasha Hamdan"
    },
    {
        "quote": "Creative thinking may mean simply the realization that there’s no particular virtue in doing things the way they have always been done.",
        "author": "Davey Coleman"
    },
    {
        "quote": "Almost everything – all external expectations, all pride, all fear of embarrassment or failure – these things just fall away in the face of death, leaving only what is truly important.",
        "author": "Steve Jobs"
    },
    {
        "quote": "As a designer, I find it difficult not to judge a book by its cover.",
        "author": "Jordan Manigo"
    },
    {
        "quote": "Drawing is speaking to the eye; talking is painting to the ear.",
        "author": "Joseph Joubert"
    },
    {
        "quote": "Art is an idea that has found its perfect visual expression. And design is the vehicle by which this expression is made possible. Art is a noun, and design is a noun and also a verb. Art is a product and design is a process. Design is the foundation of all the arts.",
        "author": "Paul Rand"
    },
    {
        "quote": "Here is one of the few effective keys to the design problem — the ability of the designer to recognize as many of the constraints as possible — his willingness and enthusiasm for working within these constraints. Constraints of price, of size, of strength, of balance, of surface, of time and so forth.",
        "author": "Charles Eames"
    },
    {
        "quote": "What problem have you solved, ever, that was worth solving where you knew all the given information in advance? No problem worth solving is like that. In the real world; you have a surplus of information and you have to filter it or; you don’t have sufficient information and you have to go find some.",
        "author": "Dan Meyer"
    },
    {
        "quote": "I recently saw another demonstration of graphic design’s ubiquity. Someone had taken a series of photographs of busy streets and then painstakingly removed all the logos, symbols, signs, colours, street names and road markings. In other words, they had removed all the graphic design from these photographs. The results were staggering. A world without graphic design is an unrecognizable world — more alien than all but the most extreme sci-fi imaginings.",
        "author": "Adrian Shaughnessy"
    },
    {
        "quote": "Designers are crazy and yet sane enough to know where to draw the line.",
        "author": "Benjamin Valbret"
    },
    {
        "quote": "… another misinterpretation that’s always bugged me: Ship early, ship often OR Ship quality product. Quality isn’t something to be sacrificed … Ship early, ship often, sacrificing features, never quality.",
        "author": "Kyle Neath"
    },
    {
        "quote": "When you’re a carpenter making a beautiful chest of drawers, you’re not going to use a piece of plywood on the back, even though it faces the wall and nobody will ever see it. You’ll know it’s there, so you’re going to use a beautiful piece of wood on the back. For you to sleep well at night, the aesthetic, the quality, has to be carried all the way through.",
        "author": "Steve Jobs"
    },
    {
        "quote": "The prerequisite of originality is the art of forgetting, at the proper moment, what we know.",
        "author": "Arthur Koestler"
    },
    {
        "quote": "The sudden hunch, the creative leap of mind that 'sees' in a flash how to solve a problem in a simple way, is something quite different from general intelligence.",
        "author": "Martin Gardner"
    },
    {
        "quote": "It is not so hard to be original, what is hard, is to be original with continuity.",
        "author": "Andrés Segovia"
    },
    {
        "quote": "Interesting things never happen to me. I happen to them.",
        "author": "Bernard Shaw"
    },
    {
        "quote": "I have thought about the nature of this creative process and have reached a somewhat aberrant conclusion. I don’t understand it and I don’t think anyone else does either.",
        "author": "William Beck"
    },
    {
        "quote": "To create a memorable design you need to start with a thought that’s worth remembering.",
        "author": "Thomas Manss"
    },
    {
        "quote": "Good design begins with honesty, asks tough questions, comes from collaboration and from trusting your intuition.",
        "author": "Freeman Thomas"
    },
    {
        "quote": "The best ideas come as jokes. Make your thinking as funny as possible.",
        "author": "David Ogilvy"
    },
    {
        "quote": "Curiosity about life in all of its aspects, I think, is still the secret of great creative people.",
        "author": "Leo Burnett"
    },
    {
        "quote": "If you can’t solve a problem, it’s because you’re playing by the rules.",
        "author": "Paul Arden"
    },
    {
        "quote": "There’s no duo more passionate than the design and me.",
        "author": "Gonxalo Blanco"
    },
    {
        "quote": "Type is a beautiful group of letters, not a group of beautiful letters.",
        "author": "Matthew Carter"
    },
    {
        "quote": "It takes the same amount of effort to make bad art as to make good art, and you won’t know which you’ve made until you release it into the wild. You can continue to refine a work until it doesn’t set off your own quality alarms, but that’s no guarantee that what you’ve made will touch anybody.",
        "author": "Nate Simpson"
    },
    {
        "quote": "Unsolicited redesigns are terrific and fun and useful, and I hope designers never stop doing them. But as they do so, I also hope they remember it helps no one – least of all the author of the redesign – to assume the worst about the original source and the people who work hard to maintain and improve it, even though those efforts may seem imperfect from the outside.",
        "author": "Khoi Vinh"
    },
    {
        "quote": "I love making the stuff, that’s sort of the core of it. I love creating the stuff. It’s so satisfying to get from the beginning to the end, from a shaky nothing idea to something that’s well formed and the audience really likes. It’s like a drug: You keep trying to do it again and again and again. I’ve learned from experience that if you work harder at it, and apply more energy and time to it, and more consistency, you get a better result. It comes from the work.",
        "author": "Louis C.K."
    },
    {
        "quote": "When you are stuck, walk away from the computer and draw. It will teach you how to see.",
        "author": "Gerard Huerta"
    },
    {
        "quote": "Today’s designers and illustrators are synthesizing the best elements from past eras of graphic design to create a new visual language with a reduced and rational approach.",
        "author": "R. Klanten, H. Hellige"
    },
    {
        "quote": "Inspiration could be called inhaling the memory of an act never experienced.",
        "author": "Jonathan Lethem"
    },
    {
        "quote": "Solving any problem is more important than being right.",
        "author": "Milton Glaser"
    },
    {
        "quote": "My eyes hurt, but my hand keeps sketching.",
        "author": "Pablo del Valle"
    },
    {
        "quote": "One of the most significant differences between graphic designers and other visual artists is our unhinged love of typography.",
        "author": "Greg Breeding"
    },
    {
        "quote": "We ourselves feel that what we are doing is just a drop in the ocean. But the ocean would be less because of that missing drop.",
        "author": "Mother Teresa"
    },
    {
        "quote": "A good design can feel like something you have always been waiting for without knowing.",
        "author": "Paul Huizinga"
    },
    {
        "quote": "It takes confidence to throw work away … When people first start drawing, they’re often reluctant to redo parts that aren’t right … they convince themselves that the drawing is not that bad, really — in fact, maybe they meant it to look that way.",
        "author": "Paul Graham"
    },
    {
        "quote": "There’s a subtle reason that programmers always want to throw away the code and start over. The reason is that they think the old code is a mess. […] The reason that they think the old code is a mess is because of a cardinal, fundamental law of programming: It’s harder to read code than to write it.",
        "author": "Joel Spolsky"
    },
    {
        "quote": "The worst logo applied well is better than the best logo applied poorly.",
        "author": "Jacob Cass"
    },
    {
        "quote": "There’s a difference between being obsessed and being motivated.",
        "author": "Mark Zuckerburg"
    },
    {
        "quote": "Creating something out of thin air is easy. It’s finding the air that’s hard.",
        "author": "Asher Trotter"
    },
    {
        "quote": "Simplicity should be found in the execution, not in the meaning.",
        "author": "Nicholas Burroughs"
    },
    {
        "quote": "Minimalism is not a lack of something. It’s simply the perfect amount of something.",
        "author": "Nicholas Burroughs"
    },
    {
        "quote": "As with most social phenomena, social-network success tends to happen more organically and unpredictably than anyone is able to artificially create by throwing money at it.",
        "author": "Marco Arment"
    },
    {
        "quote": "Worry is essentially a misuse of imagination.",
        "author": "Alex Osborn"
    },
    {
        "quote": "If design becomes your life, you can be sure a lot of people will be making their living thanks to your designs.",
        "author": "Andrés Contenti"
    },
    {
        "quote": "Designing with watermarked photos is like baking with fake sugar.",
        "author": "Justin Giovanetti"
    },
    {
        "quote": "As if a device can function if it has no style. As if a device can be called stylish that does not function superbly… yes, beauty matters. Boy, does it matter. It is not surface, it is not an extra, it is the thing itself.",
        "author": "Stephen Fry"
    },
    {
        "quote": "The word design is everything and nothing. The design and the product itself are inseparable.",
        "author": "Jonathan Ive"
    },
    {
        "quote": "What is to be sought in designs for the display of information is the clear portrayal of complexity. Not the complication of the simple; rather the task of the designer is to give visual access to the subtle and the difficult – that is, revelation of the complex.",
        "author": "Edward Tufte"
    },
    {
        "quote": "With type as with philosophy, music and food, it is better to have a little of the best than to be swamped with the derivative, the careless, the routine.",
        "author": "Robert Bringhurst"
    },
    {
        "quote": "Smart people are attracted to stories, not feature lists.",
        "author": "Johnnie Manzari"
    },
    {
        "quote": "A beef filet cooked for 15 hours by 30 cooks doesn’t necessarily taste better than a cheeseburger.",
        "author": "Oliver Reichenstein"
    },
    {
        "quote": "For every new feature we add, we take an old one out. A lot of big sites don’t do that, and it’s a problem. Twitter started as a beautifully simple product, but it’s now going the same route as Facebook. The drive to innovate can overencumber and destroy a product.",
        "author": "David Karp"
    },
    {
        "quote": "The designer is not always right. The researcher is not always wrong. Profit is not always the motive; market research, whatever its outcome, should never be used as a good excuse for bad design – in the same sense that good design should never be used to promote a bad product.",
        "author": "Paul Rand"
    },
    {
        "quote": "Write drunk; edit sober.",
        "author": "Ernest Hemingway"
    },
    {
        "quote": "I can always find love, but eventually I get horny for my creativity.",
        "author": "Gilda Radner"
    },
    {
        "quote": "The control which designers know in the print medium, and often desire in the web medium, is simply a function of the limitation of the printed page. We should embrace the fact that the web doesn’t have the same constraints, and design for this flexibility. But first, we must 'accept the ebb and flow of things.'",
        "author": "John Allsopp"
    },
    {
        "quote": "We adore chaos because we love to produce order.",
        "author": "M.C. Escher"
    },
    {
        "quote": "We tend to forget there’s more to design than designing.",
        "author": "Justin Ahrens"
    },
    {
        "quote": "A mystery is the most stimulating force in unleashing the imagination.",
        "author": "Zuzana Licko and Rudy VanderLans"
    },
    {
        "quote": "A work of art is one of mystery, the one extreme magic; everything else is either arithmetic or biology.",
        "author": "Truman Capote"
    },
    {
        "quote": "1. Good design is innovative\n2. Good design makes a product useful\n3. Good design is aesthetic\n4. Good design makes a product understandable\n5. Good design is unobtrusive\n6. Good design is honest\n7. Good design is long-lasting\n8. Good design is thorough, down to the last detail\n9. Good design is environmentally friendly\n10. Good design is as little design as possible",
        "author": "Dieter Rams"
    },
    {
        "quote": "Design can have many types of soul, the key is to have one.",
        "author": "Justin Ahrens"
    },
    {
        "quote": "The most effective way to make a design usable is to make it interesting enough that people want to use it.",
        "author": "Bryan Grezeszak"
    },
    {
        "quote": "Sometimes the best way to prove your own value is to let a client play the field.",
        "author": "Matthew Haeck"
    },
    {
        "quote": "Nail the basics first, detail the details later.",
        "author": "Chris Anderson"
    },
    {
        "quote": "Never fall in love with an idea. They’re whores. If the one you’re with isn’t doing the job, there’s always, always, always another.",
        "author": "Chip Kidd"
    },
    {
        "quote": "Design is a response to a specific problem. You are given a problem to solve, and then you let the problem itself tell you what your solution is.",
        "author": "Chip Kidd"
    },
    {
        "quote": "Modernism does not mean minimalism, contemporary does not forsake tradition, and technology does not mean abandon people and senses.",
        "author": "Tord Boontje"
    },
    {
        "quote": "Design is more than just a few tricks to the eye. It’s a few tricks to the brain.",
        "author": "Neville Brody"
    },
    {
        "quote": "The majority of iteration should be done in the privacy of your own head.",
        "author": "Steven Walker"
    },
    {
        "quote": "Never attribute to malice that which can be adequately explained by stupidity.",
        "author": "Robert A. Heinlein"
    },
    {
        "quote": "The ability to change on a dime is one thing small teams have by default that big teams can never have. This is where the big guys envy the little guys. What might take a big team in a huge organization weeks to change may only take a day in a small, lean organization. That advantage is priceless.",
        "author": "Andrew Hunt"
    },
    {
        "quote": "Losing 80% of your screen space forces you to focus. You need to make sure that what stays on the screen is the most important set of features for your customers and your business. There simply isn’t room for any interface debris or content of questionable value. You need to know what matters most.",
        "author": "Luke Wroblewski"
    },
    {
        "quote": "One can steal ideas, but no one can steal execution or passion.",
        "author": "Tim Ferriss"
    },
    {
        "quote": "If it were easy to nut out tricky design problems, I might be out of a job. But it’s also true that the cleverness in most lateral design doesn’t come from blindly grinding away at the same concept. When you’re dealing with ideas, it’s rarely a matter of simply putting in more time working. Five minutes can be much more fruitful than five hours.",
        "author": "Rob Morris"
    },
    {
        "quote": "There is only one type of designer — the type that cares about type.",
        "author": "Rohan Nanavati"
    },
    {
        "quote": "The best an idea gets is when it’s in your head.",
        "author": "Woody Allen"
    },
    {
        "quote": "Hackers don’t need idea people when they are the idea people.",
        "author": "Marc Grabanski"
    },
    {
        "quote": "Redesigning somebody else’s product is always a tricky business. You don’t know why they made the decisions they made. You don’t have the data they have.",
        "author": "Lukas Mathis"
    },
    {
        "quote": "An enterprise’s most vital assets lie in its design and other creative capabilities.",
        "author": "Kun-Hee Lee"
    },
    {
        "quote": "Observation and imitation are so often the steps to creative maturation. An insightful person can turn these into innovation.",
        "author": "Pete Episcopo"
    },
    {
        "quote": "If you have an apple and I have an apple and we exchange apples then you and I will still each have one apple. But if you have an idea and I have an idea and we exchange these ideas, then each of us will have two ideas.",
        "author": "George Bernard Shaw"
    },
    {
        "quote": "To envision what will be, you must remove yourself from the constant concern for what already is.",
        "author": "Scott Belsky"
    },
    {
        "quote": "Inspired interiors indubitably involve ingenious imitations of inspired interiors.",
        "author": "Ana Cummings"
    },
    {
        "quote": "If I want to get hired to do something, I should already be doing it.",
        "author": "Trent Walton"
    },
    {
        "quote": "Simplicity will stand out, while complexity will get lost in the crowd.",
        "author": "Kevin Barnett"
    },
    {
        "quote": "Copying one person is stealing. Copying ten is research.",
        "author": "Chet Atkins"
    },
    {
        "quote": "A lot of companies have tried to support designers by giving them 'a seat at the table.' What this usually means in practice, however, is that a designer is sitting at the table well after the important product decisions that influence the design have been made. This is usually where complicated and muddy designs are born. ",
        "author": "Rebekah Cox"
    },
    {
        "quote": "Instead of searching for inspiration, how about you search out someone to inspire.",
        "author": "Tony Kim"
    },
    {
        "quote": "A friend once insisted to me that the plural of 'moron' is 'focus group.'",
        "author": "Ethan Marcotte"
    },
    {
        "quote": "At this point in experience design’s evolution, satisfaction ought to be the norm, and delight out to be the goal.",
        "author": "Stephen Anderson"
    },
    {
        "quote": "I say that flat is the new black; that 2D is the new avant-garde; that a surface doesn’t have to be ashamed of being a surface. Technology users of the world, unite: you have nothing to lose but your bas-relief buttons. Let us march forwards together, spurning chrome, into a cleaner, lighter future.",
        "author": "Steven Poole"
    },
    {
        "quote": "Web design is art wrapped in technology.",
        "author": "James Weaver"
    },
    {
        "quote": "a 5% feature (used by less than 5% of all users) is a distraction for all the other users, and is better removed, unless it’s really critical (a small number of users do need to cancel service, for example).",
        "author": "Neil Hunt"
    },
    {
        "quote": "A great logo isn’t going to make a shitty product any less shitty, any more than a hard worker is going to make a bad boss a compelling leader.",
        "author": "Christopher Simmons"
    },
    {
        "quote": "Wondering is the seed of genius.",
        "author": "William Mocca"
    },
    {
        "quote": "A designer, like an archaeologist or geologist; researches, uncovers and adds context to precious, overlooked treasures by digging deep beneath the surface.",
        "author": "Scott Theisen"
    },
    {
        "quote": "He who cannot draw on three thousand years is living from hand to mouth.",
        "author": "Johann Wolfgang von Goethe"
    },
    {
        "quote": "There are too many elements on most web pages to affix or align each one to the baseline grid. Doing so would require a mathematical rigor that, if it can be achieved, might produce rationally exact measurements and placements but will most likely be something less than elegant. The result would be a design driven by math, rather than a design that uses math to create an elegant product.",
        "author": "Khoi Vinh"
    },
    {
        "quote": "… people in the newspaper industry saw the web as a newspaper. People in TV saw the web as TV, and people in book publishing saw it as a weird kind of potential book. But the web is not just some kind of magic all-absorbing meta-medium. It’s its own thing.",
        "author": "Paul Ford"
    },
    {
        "quote": "Don’t ask what the world needs. Ask what makes you come alive and go do it.",
        "author": "Howard Thurman"
    },
    {
        "quote": "You don’t get harmony if everyone sings the same note.",
        "author": "Steve Honey"
    },
    {
        "quote": "Let the design team be the design experts. Your job is to be the business expert. Ask them how their design solutions meet your business goals. If you trust your design team, and they can explain how their recommendations map to those goals, you’re fine. If you neither trust them, nor can they defend their choices it’s time to get a new design team.",
        "author": "Mike Monteiro"
    },
    {
        "quote": "No matter how cool your interface is, it would be better if there were less of it.",
        "author": "Alan Cooper"
    },
    {
        "quote": "I just worked hard and tried to make my thing better.",
        "author": "Jesse Thorn"
    },
    {
        "quote": "The value, and especially the legitimization of design will be, in the future, measured more in terms of how it can enable us to survive… on this planet.",
        "author": "Dieter Rams"
    },
    {
        "quote": "I’m not thinking about this pen when I’m writing with it. Rather, it’s when you least think about it that the pen can be held most naturally.",
        "author": "Naoto Fukasawa"
    },
    {
        "quote": "Chains of habit are too light to be felt until they are too heavy to be broken.",
        "author": "Warren Buffett"
    },
    {
        "quote": "Be regular and orderly in your life like a bourgeois, so that you may be violent and original in your work.",
        "author": "Gustave Flaubert"
    },
    {
        "quote": "Copywriting is definitely the profession most written about.",
        "author": "Dave Kotler"
    },
    {
        "quote": "I really like looking at design and thinking: that attention to detail must have taken absolutely ages.",
        "author": "Si Scott"
    },
    {
        "quote": "‎Heaven, I believe, is right here, just waiting for us to create it.",
        "author": "Jesse Scaccia"
    },
    {
        "quote": "A good designer may not have all the answers, but he knows which questions to ask.",
        "author": "Rudy Duke"
    },
    {
        "quote": "If you never venture outside the box, you will probably not be creative. But if you never get inside the box, you will certainly be stupid.",
        "author": "Christopher Peterson"
    },
    {
        "quote": "You can’t build a reputation on what you’re going to do.",
        "author": "Henry Ford"
    },
    {
        "quote": "Most of the mediocre design today comes from designers who are faithfully doing as they were taught in school: they worship at the altar of the visual.",
        "author": "Michael Bierut"
    },
    {
        "quote": "All of us who do creative work, we get into it because we have good taste. But there is this gap. For the first couple years you make stuff, it’s just not that good. It’s trying to be good, it has potential, but it’s not. But your taste, the thing that got you into the game, is still killer. And your taste is why your work disappoints you. A lot of people never get past this phase, they quit. Most people I know who do interesting, creative work went through years of this. We know our work doesn’t have this special thing that we want it to have. We all go through this. And if you are just starting out or you are still in this phase, you gotta know it’s normal and the most important thing you can do is do a lot of work … It is only by going through a volume of work that you will close that gap, and your work will be as good as your ambitions … It’s gonna take awhile … You’ve just gotta fight your way through.",
        "author": "Ira Glass"
    },
    {
        "quote": "Well established hierarchies are not easily uprooted",
        "author": "Tao Te Ching"
    },
    {
        "quote": "Well you’re in your little room\nand you’re working on something good\nbut if it’s really good\nyou’re gonna need a bigger room\nand when you’re in the bigger room\nyou might not know what to do\nyou might have to think of\nhow you got started sitting in your little room",
        "author": "Jack White"
    },
    {
        "quote": "I don’t care if you’re a billionaire. If you haven’t started a company, really gambled your resume and your money and maybe even your marriage to just go crazy and try something on your own, you’re no pirate and you aren’t in the club.",
        "author": "Michael Arrington"
    },
    {
        "quote": "When graphic designers got bored with the perfection offered by the newly arrived computers that could render artwork to within a tiny pixel, they rebelled by writing programmes that randomized individual letters and whole pages every time a printer processed them. A designer who didn’t like what a copywriter had delivered even set that text in illegible pictograms and icons.",
        "author": "Erik Spiekermann"
    },
    {
        "quote": "When a company gets to certain size, it’s easy just to let things happen. You have to constantly craft and nurture a brand. You can’t just let it be or it’ll fritter away to mediocrity.",
        "author": "Fiona Morrison"
    },
    {
        "quote": "Designing something is like having a baby. Asking me to try another design once I’ve birthed something amazing is like asking me to put the baby back in the womb and try again. That never works out for anyone.",
        "author": "Chad McMillan"
    },
    {
        "quote": "We explore promising avenues that, days later, become dead ends. Sometimes, we solve a month’s problem in an hour.",
        "author": "Cennydd Bowles"
    },
    {
        "quote": "It rarely takes more than a page to recognize that you’re in the presence of someone who can write, but it only takes a sentence to know you’re dealing with someone who can’t.",
        "author": "Josh Olson"
    },
    {
        "quote": "Offend nobody, design for somebody.",
        "author": "Paul Boag"
    },
    {
        "quote": "Excellence is not a skill, it is an attitude.",
        "author": "Ralph Marston"
    },
    {
        "quote": "I met with a potential client today and part of their opening gambit was how they were looking for revolutionary work delivered within a tight timescale, and if the work could be done a reduced rate then they’d be able to send a load more work our way. … They were saying that they wanted work that was fast, good, and cheap. And if the work was fast, good, and cheap enough, the reward would be the offer of more work that is fast, good, and cheap. … Let me be clear about this, these people are evil, and their work is poison. ",
        "author": "Hoss Gifford"
    },
    {
        "quote": "The modern artist is working with space and time, and expressing his feelings rather than illustrating.",
        "author": "Jackson Pollock"
    },
    {
        "quote": "The easier you make it for people to go, the more likely they are to stay.",
        "author": "Dave Winer"
    },
    {
        "quote": "Perfection is boring. Getting better is where all the fun is.",
        "author": "Dragos Roua"
    },
    {
        "quote": "Simplicity and complexity need each other.",
        "author": "John Maeda"
    },
    {
        "quote": "Good design is a lot like clear thinking made visual.",
        "author": "Edward Tufte"
    },
    {
        "quote": "There is no excellent beauty that hath not some strangeness in the proportion.",
        "author": "Francis Bacon"
    },
    {
        "quote": "Be a part of the innovation that leads the wave. Don’t wait for technology to catch up to you or you’ll end up sliding down the back side of that wave. If you choose to be a part of it happening, you can ride on top.",
        "author": "Jon Landau"
    },
    {
        "quote": "Talent hits a target no one else can hit; Genius hits a target no one else can see.",
        "author": "Arthur Schopenhauer"
    },
    {
        "quote": "If you don’t have time to read, you don’t have the time or the tools to write. ",
        "author": "Stephen King"
    },
    {
        "quote": "Draw lines, young man, many lines; from memory or from nature – it is in this way you will become a good artist. (said to Edgar Degas)",
        "author": "Jean Auguste Dominique Ingres"
    },
    {
        "quote": "Think more, design less.",
        "author": "Ellen Lupton"
    },
    {
        "quote": "When is the last time you saw a Lamborghini sale?",
        "author": "Chris Campbell"
    },
    {
        "quote": "The process is really just Iterate, Iterate, Iterate.",
        "author": "Chris Clark"
    },
    {
        "quote": "A drawing should have no unnecessary lines and a machine no unnecessary parts.",
        "author": "William Strunk Jr."
    },
    {
        "quote": "Designers shooting for usable is like a chef shooting for edible.",
        "author": "Aarron Walter"
    },
    {
        "quote": "A pessimist sees the difficulty in every opportunity; an optimist sees the opportunity in every difficulty.",
        "author": "Winston Churchill"
    },
    {
        "quote": "If advertisers spent the same amount of money on improving their products as they do on advertising then they wouldn’t have to advertise them.",
        "author": "Will Rogers"
    },
    {
        "quote": "Advertising is the art of convincing people to spend money they don’t have for something they don’t need.",
        "author": "Will Rogers"
    },
    {
        "quote": "Here’s to the crazy ones. The misfits. The rebels. The troublemakers. The round pegs in the square holes. The ones who see things differently. They’re not fond of rules. And they have no respect for the status quo. You can praise them, disagree with them, quote them, disbelieve them, glorify or vilify them.  About the only thing you can’t do is ignore them. Because they change things. They invent. They imagine. They heal. They explore. They create. They inspire. They push the human race forward. Maybe they have to be crazy. How else can you stare at an empty canvas and see a work of art? Or sit in silence and hear a song that’s never been written? Or gaze at a red planet and see a laboratory on wheels?  While some see them as the crazy ones, we see genius. Because the people who are crazy enough to think they can change the world, are the ones who do.",
        "author": "Apple Commercial"
    },
    {
        "quote": "The sharpness of the sword is not in the edge of the blade, but in the hand of the warrior.",
        "author": "Martin Aquino"
    },
    {
        "quote": "I believe that a good user interface is carefully targeted towards its audience, with the right mixture of simplicity, elegance and innovation.",
        "author": "Robert Peloschek"
    },
    {
        "quote": "I would say my biggest pet peeve related to the industry would be people focusing on technology instead of design, standards instead of users, and validation rather than innovation. Web standards and best practices are noble goals, but all too often in our community people forget they are a means to an end, not the end itself.",
        "author": "Jeff Croft"
    },
    {
        "quote": "I’ve learned that people will forget what you said, people will forget what you did, but people will never forget how you made them feel.",
        "author": "Maya Angelou"
    },
    {
        "quote": "We are all designers, the difference is that only a few of us do it full-time.",
        "author": "Sabo Tercero"
    },
    {
        "quote": "Your opinion won’t matter. It’s important that you prove your point with numbers.",
        "author": "Samantha LeVan"
    },
    {
        "quote": "The ultimate inspiration is the deadline.",
        "author": "Nolan Bushnell"
    },
    {
        "quote": "If you can’t draw as well as someone, or use the software as well, or if you do not have as much money to buy supplies, or if you do not have access to the tools they have, beat them by being more thoughtful. Thoughtfulness is free and burns on time and empathy. ",
        "author": "Frank Chimero"
    },
    {
        "quote": "When we have clients who are thinking about Flash splash pages, we tell them to go to their local supermarket and bring a mime with them. Have the mime stand in front of the supermarket, and, as each customer tries to enter, do a little show that lasts two minutes, welcoming them to the supermarket and trying to explain the bread is on aisle six and milk is on sale today.",
        "author": "Jared Spool"
    },
    {
        "quote": "A perfect implementation of the wrong specification is worthless. By the same principle a beautifully crafted library with no documentation is also damn near worthless. If your software solves the wrong problem or nobody can figure out how to use it, there’s something very bad going on. ",
        "author": "Tom Preston-Werner"
    },
    {
        "quote": "Few people are capable of expressing with equanimity opinions which differ from the prejudices of their social environment. Most people are even incapable of forming such opinions. ",
        "author": "Bradford Sherrill"
    },
    {
        "quote": "There is no such thing as information overload, just bad design. If something is cluttered and\/or confusing, fix your design. ",
        "author": "Edward Tufte"
    },
    {
        "quote": "Designers deal in ideas. They give shape to ideas that shape our world, enrich everyday experiences, and improve our lives. Where there’s confusion, designers fashion clarity; where there’s chaos, designers construct order; where there’s entropy, designers promote vitality; where there’s indifference, designers swell passion; where there’s mediocrity, designers imbue excellence; and where there’s silence, designers lend voice. ",
        "author": "Ken Peters"
    },
    {
        "quote": "Great things are not accomplished by those who yield to trends and fads and popular opinion. ",
        "author": "Jack Kerouac"
    },
    {
        "quote": "This is our job as designers – to continue making decisions until the purpose of the design is perfectly clear. Then you are done. ",
        "author": "Terry Acker"
    },
    {
        "quote": "The major difference between a thing that might go wrong and a thing that cannot possibly go wrong is that when a thing that cannot possibly go wrong goes wrong it usually turns out to be impossible to get at or repair. ",
        "author": "Douglas Adams"
    },
    {
        "quote": "All of the buildings, all of those cars were once just a dream in somebody’s head. ",
        "author": "Peter Gabriel"
    },
    {
        "quote": "Fashion is a form of ugliness so intolerable that we have to alter it every six months. ",
        "author": "Oscar Wilde"
    },
    {
        "quote": "Teaching peers is one of the best ways to develop mastery. ",
        "author": "Jeff Atwood"
    },
    {
        "quote": "Sometimes you can draw more inspiration from the people who don’t believe in you, then from the ones who do. ",
        "author": "William Childs"
    },
    {
        "quote": "At the age of six I wanted to be a cook. At seven I wanted to be Napoleon. And my ambition has been growing steadily ever since. ",
        "author": "Salvador Dali"
    },
    {
        "quote": "Bad design shouts at you. Good design is the silent seller. ",
        "author": "Shane Meendering"
    },
    {
        "quote": "If you want to set off and go develop some grand new thing, you don’t need millions of dollars of capitalization. You need enough pizza and Diet Coke to stick in your refrigerator, a cheap PC to work on and the dedication to go through with it.  ",
        "author": "John Carmack"
    },
    {
        "quote": "Being able to take ideas and transform them into something tangible is life-affirming.  ",
        "author": "Melinda Santillian"
    },
    {
        "quote": "I’m creative because I did an icon navigation while everyone else on the planet sticks to words? No, it just means I didn’t want to stick to convention. If anything you can call it rebellious but certainly not creative.  ",
        "author": "Paul Scrivens"
    },
    {
        "quote": "Influence is borrowed, inspiration is earned. Create opportunities to earn it, and have a plan to capture it.  ",
        "author": "Cameron Moll"
    },
    {
        "quote": "Clients are the difference between design and art.  ",
        "author": "Michael Bierut"
    },
    {
        "quote": "The simplest way to achieve simplicity is through thoughtful reduction.  ",
        "author": "John Maeda"
    },
    {
        "quote": "Do we really need a simple definition of design or should we accept that design is too complex a matter to be summarized in less than a book?  ",
        "author": "Bryan Lawson"
    },
    {
        "quote": "Stop downloading. Start uploading.  ",
        "author": "Jay Bradner"
    },
    {
        "quote": "If you’re presented with a situation – a man is drowning – and you could either choose to save the man or shoot the scene, what kind of film would you use?  ",
        "author": "Photographers’ proverb"
    },
    {
        "quote": "Never stand still. If you stand still, you get lost, because someone else is always moving.  ",
        "author": "Armin Vit"
    },
    {
        "quote": "Here’s the world’s worst idea for a movie: Titanic. It did okay at the box office.  ",
        "author": "Scott Adams"
    },
    {
        "quote": "That’s what all we are: amateurs. We don’t live long enough to be anything else.  ",
        "author": "Charlie Chaplin"
    },
    {
        "quote": "Design is like a mom, nobody notices when she’s around, but everybody misses her when she’s not.  ",
        "author": "Santiago Borray"
    },
    {
        "quote": "It is easier to talk than to listen. Pay attention to your clients, your users, your readers, and your friends. Your design will get better as you listen to other people.  ",
        "author": "Ellen Lupton"
    },
    {
        "quote": "Design is an art of situations. Designers respond to a need, a problem, a circumstance, that arises in the world. The best work is produced in relation to interesting situations – an open-minded client, a good cause, or great content.  ",
        "author": "Ellen Lupton"
    },
    {
        "quote": "Your imagination is the hood ornament on the car of creativity.  ",
        "author": "Gary Busey"
    },
    {
        "quote": "To achieve great things, two things are needed: a plan, and not quite enough time.  ",
        "author": "Leonard Bernstein"
    },
    {
        "quote": "Without deviation from the norm progress is not possible.  ",
        "author": "Frank Zappa"
    },
    {
        "quote": "The time it takes to make a decision increases as the number of alternatives increases.  ",
        "author": "Hick’s Law"
    },
    {
        "quote": "Never re-invent the wheel, unless you’re sure the client needn’t go anywhere.  ",
        "author": "Russell Bishop"
    },
    {
        "quote": "Legibility is not the same thing as readability.  ",
        "author": "Arlen Britton"
    },
    {
        "quote": "Design is not about innovation. Design is about communication. Innovation in design is usually a wonderful byproduct or direct result of a particular need. Design that seeks to foremost be innovative will commonly fall apart under its own stylistic girth.  ",
        "author": "Jason Santa Maria"
    },
    {
        "quote": "It’s all fun and games until someone breaks a link.  ",
        "author": "Derek Vigil"
    },
    {
        "quote": "Life beats down and crushes the soul, and art reminds you that you have one.  ",
        "author": "Stella Adler"
    },
    {
        "quote": "It is far better to adapt the technology to the user than to force the user to adapt to the technology.  ",
        "author": "Larry Marine"
    },
    {
        "quote": "Just because nobody complains doesn’t mean all parachutes are perfect.  ",
        "author": "Benny Hill"
    },
    {
        "quote": "Design to express, not to impress.  ",
        "author": "John Tanedo"
    },
    {
        "quote": "Nobody can tell you if what you’re doing is good, meaningful or worthwhile. The more compelling the path, the more lonely it is.  ",
        "author": "Hugh Macleod"
    },
    {
        "quote": "The secret of joy in work is contained in one word: excellence. To know how to do something well is to enjoy it.  ",
        "author": "Pearl S. Buck"
    },
    {
        "quote": "The space between an idea and a concept is your lips. If you can’t say it out loud you can’t do it.   ",
        "author": "Nick Longo"
    },
    {
        "quote": "Stop being afraid of your own pictures, stop worshiping art, treat it the Polish way, condescendingly, make it obedient, and then your originality will release itself in you, new roads will open in front of you and you will gain what is most valuable, most fertile: your own reality.  ",
        "author": "Gombrowicz"
    },
    {
        "quote": "I was gonna get a candy bar; the button I was supposed to push was 'HH', so I went to the side, I found the 'H' button, I pushed it twice. Fuckin’…potato chips came out, man, because they had an 'HH' button for Christ’s sake! You need to let me know. I’m not familiar with the concept of 'HH'. I did not learn my AA-BB-CC’s. God god, dammit dammit.  ",
        "author": "Mitch Hedberg"
    },
    {
        "quote": "Whoever best describes the problem, is the one most likely to solve it.  ",
        "author": "Dan Roam"
    },
    {
        "quote": "Learn from the mistakes of others. You can’t live long enough to make them all yourself.  ",
        "author": "Eleanor Roosevelt"
    },
    {
        "quote": "Business owners need to realize that their design is a reflection of their business even if it is not intentional. If you don’t care about your design then your design is telling people that you don’t care about your business.  ",
        "author": "Marco Suarez"
    },
    {
        "quote": "Good design is partially creativity and innovation, but primarily knowledge and awareness.  ",
        "author": "Chuck Green"
    },
    {
        "quote": "Artists are natural marketers for everyone but themselves.  ",
        "author": "Oren Sherman"
    },
    {
        "quote": "Good design at the front-end suggests that everything is in order at the back-end, whether or not that is the case.  ",
        "author": "Dmitry Fadeyev"
    },
    {
        "quote": "Leafing through an old magazine, I noticed a small ad about a design course by mail. The headline read, 'Art for pleasure and profit!' I have never found a better definition to describe my profession. Of course, at times it is more the pleasure and less the profit, at times the contrary. But if one of the components were missing, design wouldn’t exist.  ",
        "author": "Carlo Angelini"
    },
    {
        "quote": "Art does not reproduce what we see; rather, it makes us see.  ",
        "author": "Paul Klee"
    },
    {
        "quote": "Design is a mix of craft, science, storytelling, propaganda, and philosophy.  ",
        "author": "Erik Adigard"
    },
    {
        "quote": "Good design is good business.  ",
        "author": "Thomas Watson, Jr."
    },
    {
        "quote": "Decoration is just make-up for the wrinkles of the idea.  ",
        "author": "Thomas Manss"
    },
    {
        "quote": "To create a memorable design you need to start with a thought that’s worth remembering.  ",
        "author": "Thomas Manss"
    },
    {
        "quote": "Owning a camera doesn’t make you a photographer.  ",
        "author": "Gabriel von Satzger"
    },
    {
        "quote": "Language is the amber in which a thousand precious and subtle thoughts have been safely embedded and preserved.  ",
        "author": "Richard C. Trench"
    },
    {
        "quote": "Complaining is silly. Act or forget.  ",
        "author": "Stefan Stagmeister"
    },
    {
        "quote": "An ad should be an appetizer, not a buffet.  ",
        "author": "Lee Clow’s Beard"
    },
    {
        "quote": "I’d rather have a bottle in front of me than a frontal lobotomy.  ",
        "author": "Dorothy Parker"
    },
    {
        "quote": "What garlic is to food, insanity is to art.  ",
        "author": "Unknown"
    },
    {
        "quote": "Opportunity is missed by people because it is dressed in overalls and looks like work.  ",
        "author": "Thomas Edison"
    },
    {
        "quote": "Don’t try to be original try to be good.  ",
        "author": "Paul Rand"
    },
    {
        "quote": "If it doesn’t sell it isn’t creative.  ",
        "author": "David Ogilvy"
    },
    {
        "quote": "Honesty is the best policy, unless you work in advertising.  ",
        "author": "Jenn Loots"
    },
    {
        "quote": "Socrates said, 'Know thyself.'",
        "author": "Joshua Brewer"
    },
    {
        "quote": "I’m a big fan of doing what you are really bad at. A lot.  ",
        "author": "Shaun White"
    },
    {
        "quote": "A healthy creative process should be able to give a coherent rationale to a client as to why you designed what you designed.  ",
        "author": "Von Glitschka"
    },
    {
        "quote": "Be friendly to those who enjoy your work and friendlier to those who attack it.  ",
        "author": "David Leggett"
    },
    {
        "quote": "Features are like having sex.  You make one mistake and you have to support it for life.  ",
        "author": "Dave McClure"
    },
    {
        "quote": "Using a watermark on your work is like peeing on your belongings so no one will steal them.   ",
        "author": "Thomas Amador"
    },
    {
        "quote": "Stop. I’m not going to take any more input until I’ve made something with what I got.  ",
        "author": "Merlin Mann"
    },
    {
        "quote": "In design man becomes what he is.\nAnimals have language and perception as well,\nbut they do not design.  ",
        "author": "Otl Aicher"
    },
    {
        "quote": "Photoshop is a privilege, not a right.  ",
        "author": "Dork Tower"
    },
    {
        "quote": "If you pay peanuts, you get monkeys.  ",
        "author": "James Goldsmith"
    },
    {
        "quote": "The way to 'get your name out there' is to establish a pattern of excellent work and a reputation for integrity over several years.  ",
        "author": "Andy Rutledge"
    },
    {
        "quote": "Babe Ruth was a Home Run king but he was also a strike out king. Always go for the fences, even if it means some designs strike out with clients. That’s the only way to hit a home run.  ",
        "author": "Alex Zevallos"
    },
    {
        "quote": "Innovation is seldom hindered by platform.  ",
        "author": "Blue Saunders"
    },
    {
        "quote": "Creativity isn’t worth a thing if it isn’t served with an equal amount of reliability.  ",
        "author": "Anton Peck"
    },
    {
        "quote": "At the end of the day, pretty colors make people drool.  ",
        "author": "Nathan Rice"
    },
    {
        "quote": "A person tends to critique a design in one of several ways. The most common, and usually least valuable, is by gut reaction.  ",
        "author": "D. Keith Robinson"
    },
    {
        "quote": "We are what we repeatedly do. Excellence, therefore, is not an act, but a habit.  ",
        "author": "Aristotle"
    },
    {
        "quote": "I don’t read inspiring books. I find that such books give me a temporal high, but they don’t give me the power to actually follow through. In fact, I suspect these books often serve as a substitute for actual success, rather than as a way of helping people achieve success. By reading inspiring books, you can experience success vicariously; they free you from having to achieve things yourself.  ",
        "author": "Lukas Mathis"
    },
    {
        "quote": "Preparation gives birth to self-confidence.  ",
        "author": "Denise Harman"
    },
    {
        "quote": "There’s a point when you’re done simplifying. Otherwise, things get really complicated.  ",
        "author": "Frank Chimero"
    },
    {
        "quote": "Great design is eliminating all unnecessary details.  ",
        "author": "Minh D. Tran"
    },
    {
        "quote": "Done is beautiful.  ",
        "author": "Frank Chimero"
    },
    {
        "quote": "The way a team plays as a whole determines its success. You may have the greatest bunch of individual stars in the world, but if they don’t play together, the club won’t be worth a dime.  ",
        "author": "Babe Ruth"
    },
    {
        "quote": "Well done is better than well said.  ",
        "author": "Benjamin Franklin"
    },
    {
        "quote": "The work you do while you procrastinate is probably the work you should be doing for the rest of your life.  ",
        "author": "Jessica Hische"
    },
    {
        "quote": "Good art inspires; Good design motivates.  ",
        "author": "Otl Aicher"
    },
    {
        "quote": "There is no better designer than nature.   ",
        "author": "Alexander McQueen"
    },
    {
        "quote": "Do right.  ",
        "author": "Jeffrey Brown"
    },
    {
        "quote": "Traditional marketing is often seeing is getting people to do things but I think web marketing is about helping people do things.  ",
        "author": "Gerry McGovern"
    },
    {
        "quote": "Inspiration the seed. Design but the flower.  ",
        "author": "Michael Langham"
    },
    {
        "quote": "When you’re passionate about what you do, you become an evangelist for the very thing you do.  ",
        "author": "Jonathan Snook"
    },
    {
        "quote": "Creativity is a habit. It’s not something that happens in the shower.  ",
        "author": "Nick Law"
    },
    {
        "quote": "Translation is not a matter of words only: it is a matter of making intelligible a whole culture.  ",
        "author": "Anthony Burgess"
    },
    {
        "quote": "Graphic design has been likened to a wine glass. When we drink wine we barely notice the glass it’s served in. It wouldn’t be true to say that we don’t care what glass we drink out of – we wouldn’t choose to drink a rare vintage out of a Tupperware mug, for example – but it’s the wine that matters, not the vessel it comes in.   ",
        "author": "Adrian Shaughnessy"
    },
    {
        "quote": "A designer who gives her art away, makes no pay. A designer who keeps her art to herself, makes no friends.   ",
        "author": "Amber Seree Allen"
    },
    {
        "quote": "Be a first rate version of yourself, not a second rate version of someone else.  ",
        "author": "Judy Garland"
    },
    {
        "quote": "Now that we can do anything, what should we do?  ",
        "author": "Bill Buxton"
    },
    {
        "quote": "For those who would argue that it’s impossible to evaluate designs without real content, let me ask this: why then, is it okay to evaluate content out of context of the designs?  ",
        "author": "Karen McGrane"
    },
    {
        "quote": "If you see a few lines of atrocious code, you can make a judgement about the programmer. By judging the programmer, you can judge his boss, and by judging his boss you can judge the company. That’s the nature of fractals.  ",
        "author": "Des Traynor"
    },
    {
        "quote": "Just because something looks good doesn’t mean its useful. And just because something is useful does not make it beautiful.  ",
        "author": "Joshua Brewer"
    },
    {
        "quote": "Cheap design is like a tattoo… once you get it you’re forever branded with it.  ",
        "author": "Ken Peters"
    },
    {
        "quote": "Once you eliminate quality as a requirement, the entire design process becomes a whole lot easier.  ",
        "author": "Jared M. Spool"
    },
    {
        "quote": "It is important not to let the perfect become the enemy of the good, even when you can agree on what perfect is. Doubly so when you can’t. As unpleasant as it is to be trapped by past mistakes, you can’t make any progress by being afraid of your own shadow during design.  ",
        "author": "Greg Hudson"
    },
    {
        "quote": "You mix a bunch of ingredients, and once in a great while, chemistry happens.  ",
        "author": "Bill Watterson"
    },
    {
        "quote": "Every child is an artist. The challenge is to remain an artist after you grow up.  ",
        "author": "Pablo Picasso"
    },
    {
        "quote": "If you do good work for good clients, it will lead to other good work for other good clients. If you do bad work for bad clients, it will lead to other bad work for other bad clients.  ",
        "author": "Michael Bierut"
    },
    {
        "quote": "The Fire Department has traditionally considered architecture a priority only when it’s burning down.  ",
        "author": "Justin Davidson"
    },
    {
        "quote": "A goal is a dream with a deadline.  ",
        "author": "Napoleon Hill"
    },
    {
        "quote": "Good communication is as stimulating as black coffee, and just as hard to sleep after.  ",
        "author": "Anne Morrow Lindbergh"
    },
    {
        "quote": "Everyone gets so much information all day long that they lose their common sense.  ",
        "author": "Gertrude Stein"
    },
    {
        "quote": "The aim of art is to represent not the outward appearance of things, but their inward significance.   ",
        "author": "Aristotle"
    },
    {
        "quote": "Typography has one plain duty before it and that is to convey information in writing. No argument or consideration can absolve typography from this duty.  ",
        "author": "Emil Ruder"
    },
    {
        "quote": "Know thy user, and you are not thy user.  ",
        "author": "Arnie Lund"
    },
    {
        "quote": "Being a graphic designer gets you used to rejection of your brilliance. So it’s good practice for dating.  ",
        "author": "Heather Phillips"
    },
    {
        "quote": "I want everything we do to be beautiful. I don’t give a damn whether the client understands that that’s worth anything, or that the client thinks it’s worth anything, or whether it is worth anything. It’s worth it to me. It’s the way I want to live my life. I want to make beautiful things, even if nobody cares.  ",
        "author": "Saul Bass"
    },
    {
        "quote": "The goal is not to make your user interface as realistic as possible. The goal is to add those details which help users identify what an element is, and how to interact with it, and to add no more than those details.  ",
        "author": "Lukas Mathis"
    },
    {
        "quote": "Some people like what you do, some people hate what you do, but most people simply don’t give a damn.  ",
        "author": "Charles Bukowski"
    },
    {
        "quote": "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the universe trying to build bigger and better idiots. So far, the universe is winning.  ",
        "author": "Rick Cook"
    },
    {
        "quote": "Design is creativity with strategy.  ",
        "author": "Rob Curedale"
    },
    {
        "quote": "Everybody’s a web designer until, you know, they actually try to do it.  ",
        "author": "Gabe Boning"
    },
    {
        "quote": "Those who say 'it’s not personal, it’s just business' are lying. All business is personal, and the best business is very personal.  ",
        "author": "Richard Lenz"
    },
    {
        "quote": "When in doubt, use Caslon.  ",
        "author": "William Caslon"
    },
    {
        "quote": "Luck is the residue of design.  ",
        "author": "Branch Rickey"
    },
    {
        "quote": "Nothing’s impossible.  ",
        "author": "The Doorknob (Alice In Wonderland)"
    },
    {
        "quote": "The secret of success is doing something you love, doing it well and being recognized for it.  ",
        "author": "George Carlin"
    },
    {
        "quote": "The word ‘studio’ is derives from ‘study’. Our object is not to know the answers before we do the work. It’s to know them after we do it.  ",
        "author": "Bruce Mau"
    },
    {
        "quote": "We have a strategic plan. It’s called doing things.  ",
        "author": "Herb Kelleher"
    },
    {
        "quote": "The inventors will invent, for that is what inventors do. The technology will come first, the products second, and then the needs will slowly appear, as new applications become luxuries, then 'needs,' and finally, essential.  ",
        "author": "Don Norman"
    },
    {
        "quote": "I think most programmers spend the first 5 years of their career mastering complexity, and the rest of their lives learning simplicity.  ",
        "author": "Buzz Andersen"
    },
    {
        "quote": "Form follows function – that has been misunderstood. Form and function should be one, joined in a spiritual union.  ",
        "author": "Frank Lloyd Wright"
    },
    {
        "quote": "Always read with a pen in hand. The pen should be used both to mark the text you want to remember and to write from where the text leaves you. Think of the text as the starting point for your own words.  ",
        "author": "Mandy Brown"
    },
    {
        "quote": "…the wisest course of action is to take your best shot with a prototype, immediately get to market, and iterate quickly. If you wait for ideal circumstances in which you have all the information you need (which is impossible) the market will pass you by.  ",
        "author": "Guy Kawasaki"
    },
    {
        "quote": "Education is not the answer to the question. Education is the means to the answer to all questions.  ",
        "author": "William Allin"
    },
    {
        "quote": "If you do what you always did, you will get what you always got.  ",
        "author": "Albert Einstein"
    },
    {
        "quote": "If at first the idea is not absurd, then there is no hope for it.  ",
        "author": "Albert Einstein"
    },
    {
        "quote": "Mistakes are the portals of discovery.  ",
        "author": "James Joyce"
    },
    {
        "quote": "Learning never exhausts the mind.  ",
        "author": "Leonardo da Vinci"
    },
    {
        "quote": "Some people never go crazy. What truly horrible lives they must live.  ",
        "author": "Charles Bukowski"
    },
    {
        "quote": "I try to take my camera everywhere with me so that I’ll be ready when unicorns crapping rainbows come flying in from the heavens.  ",
        "author": "Robert Otani"
    },
    {
        "quote": "I know the price of success: dedication, hard work & an unremitting devotion to the things you want to see happen.  ",
        "author": "Frank Lloyd Wright"
    },
    {
        "quote": "The worst thing you can do to anybody trying to be creative is to demand participation in their vision.  ",
        "author": "Chuck Klosterman"
    },
    {
        "quote": "What makes great design great is not a trendy technique, but the logic and conceptual aspect that were figured out in the designer’s mind – or on more likely, on paper – before a mouse cursor ever opened Photoshop.  ",
        "author": "Kyle Meyer"
    },
    {
        "quote": "Standards are like sex; one mistake, and you’re stuck supporting it forever!   ",
        "author": "Mark Pilgrim"
    },
    {
        "quote": "It’s the little details that are vital. Little things make big things happen.  ",
        "author": "Coach John Wooden"
    },
    {
        "quote": "To make pearls, you’ve got to eat dirt.  ",
        "author": "Frank Chimero"
    },
    {
        "quote": "Money is usually attracted, not pursued.  ",
        "author": "Jim Rohn"
    },
    {
        "quote": "I like nonsense, it wakes up the brain cells. Fantasy is a necessary ingredient in living, It’s a way of looking at life through the wrong end of a telescope. Which is what I do, and that enables you to laugh at life’s realities.  ",
        "author": "Dr. Seuss"
    },
    {
        "quote": "Be stimulated by rejection.  ",
        "author": "Bob Gill"
    },
    {
        "quote": "The grid system is an aid, not a guarantee.  ",
        "author": "Josef Muller-Brockmann"
    },
    {
        "quote": "Style is time’s fool. Form is time’s student  ",
        "author": "Stewart Brand"
    },
    {
        "quote": "There are now about as many different varieties of letters as there are different kinds of fools.  ",
        "author": "Eric Gill"
    },
    {
        "quote": "Never offend people with style when you can offend them with substance.  ",
        "author": "Sam Brown"
    },
    {
        "quote": "Having small touches of colour makes it more colourful than having the whole thing in colour.  ",
        "author": "Dieter Rams"
    },
    {
        "quote": "Wisdom is knowing what to do next, skill is knowing how to do it, and virtue is doing it.  ",
        "author": "David Starr"
    },
    {
        "quote": "The secret to our enduring brand lies in delivering an experience rather than just a collection of products and services.  ",
        "author": "Harley-Davidson Annual Report"
    },
    {
        "quote": "Don’t worry about people stealing an idea. If it’s original, you will have to ram it down their throats.  ",
        "author": "Howard Aiken"
    },
    {
        "quote": "To say a grid is limiting is to say that language is limiting, or typography is limiting.  ",
        "author": "Ellen Lupton"
    },
    {
        "quote": "Remember to always be yourself. Unless you suck.  ",
        "author": "Joss Whedon"
    },
    {
        "quote": "We can’t solve problems by using the same kind of thinking we used when we created them.  ",
        "author": "Albert Einstein"
    },
    {
        "quote": "God, grant me the serenity to accept the things I cannot change, the courage to change the things I can, and the wisdom to know the difference  ",
        "author": "Reinhold Niebuhr"
    },
    {
        "quote": "The hole and the patch should be commensurate.  ",
        "author": "Thomas Jefferson"
    },
    {
        "quote": "There ain’t no rules around here. We’re trying to accomplish something.  ",
        "author": "Thomas Edison"
    },
    {
        "quote": "Watch what people are cynical about, and one can often discover what they lack  ",
        "author": "George Patton"
    },
    {
        "quote": "Great stories happen to people who can tell them.  ",
        "author": "Ira Glass"
    },
    {
        "quote": "As we know,\nThere are known knowns.\nThere are things we know we know.\nWe also know\nThere are known unknowns.\nThat is to say\nWe know there are some things\nWe do not know.\nBut there are also unknown unknowns,\nThe ones we don’t know\nWe don’t know.  ",
        "author": "Donald Rumsfeld"
    },
    {
        "quote": "Decisions on artwork by committee end up being made on the premise of not turning people off rather than turning people on.  ",
        "author": "Paul Attwood"
    },
    {
        "quote": "Says who? Just so you know, the people who talk that way think that monkeys can do this. They take all this monkey crap and just stick it in a briefcase completely unaware that their success depends on something more than their shoeshine. YOU are the product. You- FEELING something. That’s what sells. Not them. Not sex. They can’t do what we do, and they hate us for it.  ",
        "author": "Don Draper"
    },
    {
        "quote": "Good designs come from the heart, not from the brain.  ",
        "author": "Danny Sengers"
    },
    {
        "quote": "Good ideas never go out of style.  ",
        "author": "Dale Harris"
    },
    {
        "quote": "Good ideas rarely come in bunches. The designer who voluntarily presents his client with a batch of layouts does so not out prolificacy, but out of uncertainty or fear.  ",
        "author": "Paul Rand"
    },
    {
        "quote": "Design is a good idea.  ",
        "author": "Emigre"
    },
    {
        "quote": "History has remembered the kings and warriors, because they destroyed; art has remembered the people, because they created.  ",
        "author": "William Morris"
    },
    {
        "quote": "A man who stops advertising to save money is like a man who stops a clock to save time.  ",
        "author": "Henry Ford"
    },
    {
        "quote": "Everything was just a wild guess. And it takes a while to get confident that you’re guessing pretty good.  ",
        "author": "Jerry Seinfeld"
    },
    {
        "quote": "But the web will still be full of arrogant, uninformed, polarizing, self-promoting, controversy-creating content that has ramifications no one wants to own up to. And consequently, the web will still be lacking in common courtesy, humility, and the admittance that most of us don’t know best. Which is sad, mostly because it’s true.  ",
        "author": "Joshua Blankenship"
    },
    {
        "quote": "It’s quicker to hate on a design picking out all the little things that should have done than to just do something great yourself.  ",
        "author": "Tom Watson"
    },
    {
        "quote": "The definition of an expert is someone who knows what not to do.  ",
        "author": "Charles Willson"
    },
    {
        "quote": " If you are demanding registration before checkout, you need to cease this practice immediately. It is costing you a fortune.  ",
        "author": "Bruce Tognazzini"
    },
    {
        "quote": "Every act of creation is first an act of destruction.  ",
        "author": "Pablo Picasso"
    },
    {
        "quote": "To be outstanding – get comfortable with being uncomfortable.  ",
        "author": "Alrik Koudenburg"
    },
    {
        "quote": "Creativity is piercing the mundane to find the marvelous.  ",
        "author": "Bill Moyers"
    },
    {
        "quote": "Verbalizing design is another act of design.  ",
        "author": "Kenya Hara"
    },
    {
        "quote": "Limit your usage to two fonts (three at the absolute most) to help viewers focus on the words, not how many different fonts are saying them.  ",
        "author": "Dan Rubin"
    },
    {
        "quote": "Standards are like toothbrushes, everybody agrees you should have one, but no one wants to use yours.  ",
        "author": "Joe Croser"
    },
    {
        "quote": "Helvetica is like a really good friend. You go off and hang with the other fonts (the artsy, grungy, trendy, thin, fat, tall, scripty types) and even use them a little, but helvetica is always there. A nice stable friend.  ",
        "author": "Andrew Frigo"
    },
    {
        "quote": "I loathe the phrase 'no questions asked.' Great service is about communication, sincerity, and action – not blind automation.  ",
        "author": "Marshall Bonobos"
    },
    {
        "quote": "The web is the ultimate customer-empowering environment. He or she who clicks the mouse gets to decide everything. It is so easy to go elsewhere; all the competitors in the world are but a mouseclick away.  ",
        "author": "Jakob Nielsen"
    },
    {
        "quote": "Clients are full of surprises. Design is what you make of the surprises.  ",
        "author": "Dan Phillips"
    },
    {
        "quote": "No, Watson, this was not done by accident, but by design.  ",
        "author": "Sherlock Holmes"
    },
    {
        "quote": "Don’t make me think.  ",
        "author": "Steve Krug"
    },
    {
        "quote": "If Ernest Hemingway, James Mitchener, Neil Simon, Frank Lloyd Wright, and Pablo Picasso could not get it right the first time, what makes you think that you will?  ",
        "author": "Paul Heckel"
    },
    {
        "quote": "I In fact choose to use a coffeemaker to boil vegetables. Why? Because if I used something else that just makes coffee, my client would ask me 'Can it boil vegetables?'  ",
        "author": "Joel Fisher"
    },
    {
        "quote": "Being good in business is the most fascinating kind of art. Making money is art and working is art and good business is the best art.  ",
        "author": "Andy Warhol"
    },
    {
        "quote": "You can use an eraser on the drafting table or a sledge hammer on the construction site.  ",
        "author": "Frank Lloyd Wright"
    },
    {
        "quote": "The easy, conversational tone of good writing comes only on the eighth rewrite.  ",
        "author": "Paul Graham"
    },
    {
        "quote": "Think like a wise man but communicate in the language of the people.  ",
        "author": "William Butler Yeats"
    },
    {
        "quote": "Supposing is good, but finding out is better.  ",
        "author": "Mark Twain"
    },
    {
        "quote": "Because every person knows what he likes, every person thinks he is an expert on user interfaces.  ",
        "author": "Paul Heckel"
    },
    {
        "quote": "I don’t know the key to success, but the key to failure is trying to please everybody.  ",
        "author": "Bill Cosby"
    },
    {
        "quote": "If we want users to like our software we should design it to behave like a likeable person: respectful, generous and helpful.  ",
        "author": "Alan Cooper"
    },
    {
        "quote": "'What is the most treasured and well-used piece of equipment in your studio?' My head.  ",
        "author": "Alan Fletcher"
    },
    {
        "quote": "We aren’t designing photocopies of web pages, we’re designing web pages.  ",
        "author": "Andy Clarke"
    },
    {
        "quote": "Everybody is a user experience designer.  ",
        "author": "Whitney Hess"
    },
    {
        "quote": "'It looks good' is the worst feedback you can get.  ",
        "author": "Whitney Hess"
    },
    {
        "quote": "One of the tragedies of the design scene is that it always acts too late.  ",
        "author": "Hans-Redolf Lutz"
    },
    {
        "quote": "We are interpreters – not merely translators between sender and receiver. What we say and how we say it makes a difference. If we want to speak to people, we need to know their language. In order to design for understanding, we need to understand design.  ",
        "author": "Erik Spiekermann"
    },
    {
        "quote": "Every picture owes more to other pictures painted before than it owes to nature.  ",
        "author": "E.H. Gombrich"
    },
    {
        "quote": "Design is redesign.  ",
        "author": "Jan Michl"
    },
    {
        "quote": "This is the web. Fix it.  ",
        "author": "Luke Wroblewski"
    },
    {
        "quote": "Design is how you treat your customers. If you treat them well from an environmental, emotional, and aesthetic standpoint, you’re probably doing good design.  ",
        "author": "Yves Behar"
    },
    {
        "quote": "In business we do a great job learning and teaching the tools for optimizing our results (how to build), but not a lot of time exploring the tools that will help us understand the experience we should be creating (what we should build).  ",
        "author": "Kelsey Ruger"
    },
    {
        "quote": "Don’t try and reinvent the wheel – just work on making it better than anyone else.  ",
        "author": "David A. Stuebe"
    },
    {
        "quote": "Form follows function.  ",
        "author": "Louis Sullivan"
    },
    {
        "quote": "If you are going to have less things, they have to be great things.  ",
        "author": "John Maeda"
    },
    {
        "quote": "Functionality is so over-valued in design, and we’ve kept design very small in that way. Functionality is the sheer minimum. If your house burns down, what do you take? The cat in the window that you got from your mother, or the chair you have?  ",
        "author": "Marcel Wanders"
    },
    {
        "quote": "I don’t care if you like it! I want to know if you understand it.  ",
        "author": "JP Arevalo"
    },
    {
        "quote": "Everything is possible, that’s what science is all about. No, that’s what’s being a Magical Elf is all about.  ",
        "author": "The Professor (on Futurama)"
    },
    {
        "quote": "Find something you’re passionate about and keep tremendously interested in it.  ",
        "author": "Julia Child"
    },
    {
        "quote": "Your best work is your expression of yourself. Now, you may not be the greatest at it, but when you do it, you’re the only expert.  ",
        "author": "Frank Gehry"
    },
    {
        "quote": "And so we have an issue. A classic impasse. Management wants process. Developers want to build something that works. Designers want to spend time thinking about use cases. What do we do?  ",
        "author": "Ben Bleikamp"
    },
    {
        "quote": "Do, or do not. There is no 'try'.  ",
        "author": "Yoda"
    },
    {
        "quote": "The creative person basically has two kinds of jobs: One is the sexy, creative kind. Second is the kind that pays the bills. Sometimes the task at hand covers both bases, but not often.  ",
        "author": "Derek Sivers"
    },
    {
        "quote": "Urban public space is a stage for viewing the field of graphic design in its diversity. A mix of voices, from advertising to activism, compete for visibility.  ",
        "author": "Ellen Lupton"
    },
    {
        "quote": "Remember it takes a lot of shit, to create a beautiful flower.  ",
        "author": "Jacob Cass"
    },
    {
        "quote": "[Degenerate type is] a form of canned cynicism which will doom its perpetrators to a special room in hell where lovely little children of all races, creeds, and religions are eternally batched in gentle rosy and amber glows, singing 'It’s a small world after all.' There’s no reason to create an alphabet which looks like it leaked out a diaper.  ",
        "author": "Peter Fraterdeus"
    },
    {
        "quote": "I am always driven by the terror of humiliation.  ",
        "author": "Judd Apatow"
    },
    {
        "quote": "You came here because we do this better than you, and part of that is letting our creatives be unproductive until they are.  ",
        "author": "Don Draper"
    },
    {
        "quote": "Good ideas turn into good designs fairly quickly. If you catch yourself fiddling too much with colors, borders and treatments to bring a design together, chances are the problem lies somewhere deeper.  ",
        "author": "Ryan Singer"
    },
    {
        "quote": "Sometimes I’m amazed that I spend my days creating magic and fantasy and that people buy it. It’s like connecting with the inner child in me; I’m just having a great time, and I’m chuckling to myself that this is really happening, that I can do this with my life.  ",
        "author": "Lita Albuquerque"
    },
    {
        "quote": "Everyone is an artist.  ",
        "author": "Joseph Beuys"
    },
    {
        "quote": "We should pursue and practice moderation.  ",
        "author": "Plato"
    },
    {
        "quote": "After finishing a design you take a step back and a little voice pops in your head and says, 'Wow. You should really just quit while you’re ahead.' Don’t ever listen to that voice. Ever.  ",
        "author": "Brittany Grabowski"
    },
    {
        "quote": "We use the letters of our alphabet every day with the utmost ease and unconcern, taking them for granted as the air we breathe. We do not realize that each of these letters is at our service today only as the result of a long and laboriously slow process of evolution in the age-old art of writing.  ",
        "author": "Douglas C. McMurtle"
    },
    {
        "quote": "Geometry can produce legible letters, but art alone makes the beautiful. Art begins where geometry ends, and imparts to letters a character transcending mere measurement.  ",
        "author": "Paul Standard"
    },
    {
        "quote": "Calvin: You can’t just turn on creativity like a faucet. You have to be in the right mood.",
        "author": "Calvin & Hobbes"
    },
    {
        "quote": "The challenge is for the graphic designer to turn data into information and information into messages of meaning.  ",
        "author": "Katherine McCoy"
    },
    {
        "quote": "The critical distinction between a craftsman and an expert is what happens after a sufficient level of expertise has been achieved. The expert will do everything she can to remain wedded to a single context, narrowing the scope of her learning, her practice, and her projects. The craftsman has the courage and humility to set aside her expertise and pick up an unfamiliar technology or learn a new domain.   ",
        "author": "Dave Hoover"
    },
    {
        "quote": "When the only tool you own is a hammer, every problem begins to resemble a nail.  ",
        "author": "Abraham Maslow"
    },
    {
        "quote": "When I design, I don’t consider the technical or commercial parameters so much as the desire for a dream that humans have attempted to project onto an object.  ",
        "author": "Philippe Starck"
    },
    {
        "quote": "Brand identity is too often limited to personal style.  ",
        "author": "David A. Stuebe"
    },
    {
        "quote": "The works must be conceived with fire in the soul, but executed with clinical coolness.  ",
        "author": "Joan Miro"
    },
    {
        "quote": "Color is a creative element, not a trimming.  ",
        "author": "Piet Zwart"
    },
    {
        "quote": "You never can do what the kids do. What you do is look at yourself and find your own way to address the fact that the times have changed and that you have to pay attention. You can’t be a designer and say, 'Oh, this is timeless.' Nothing is timeless!  ",
        "author": "Paula Scher"
    },
    {
        "quote": "No great thing is created suddenly.  ",
        "author": "Epictetus"
    },
    {
        "quote": "Genius is 1% inspiration and 99% perspiration.  ",
        "author": "Thomas Edison"
    },
    {
        "quote": "Computer design is quite often merely bad design done on a computer.  ",
        "author": "Mike Hicks"
    },
    {
        "quote": "I’ve always considered myself a graphic artists – a draftsman – as opposed to a typist. I do still work on a drawing table. At times drawing on a computer feels like I’m drawing on an Etch-a-Sketch.  ",
        "author": "Michael Schwab"
    },
    {
        "quote": "Everything that can be said, can be said clearly.  ",
        "author": "Ludwig Wittgenstein"
    },
    {
        "quote": "I think what I feel fortunate about is that I am still astonished – that things still amaze me. And I think that that’s a great benefit of being in the arts, where the possibility for learning never disappears; where you basically have to admit you never learn it.  ",
        "author": "Milton Glaser"
    },
    {
        "quote": "I rarely agree with what clients ask me to do.  ",
        "author": "Ross Lovegrove"
    },
    {
        "quote": "I make all my decisions on intuition. But then, I must know why I made that decision. I throw a spear into the darkness. That is intuition. Then I must send an army into the darkness to find the spear. That is intellect.  ",
        "author": "Ingmar Bergman"
    },
    {
        "quote": "A successful design career is possible without forfeiting self-respect as long as you do not undervalue (or overvalue) your work.  ",
        "author": "Peter Landt"
    },
    {
        "quote": "In the design process, my gut instinct is my best critic. I just wish I would always listen to it!  ",
        "author": "Bryan Tamayo"
    },
    {
        "quote": "Graphic design is the design of highly disposable items… It all winds up in the garbage.  ",
        "author": "Karrie Jacobs"
    },
    {
        "quote": "The nature of space reflects what it wants to be.  ",
        "author": "Louis Kahn"
    },
    {
        "quote": "The world always seems brighter when you’ve just made something that wasn’t there before.  ",
        "author": "Neil Gaiman"
    },
    {
        "quote": "Using simpler forms and straightforward, easy-to-use instruments and controls allows you to achieve a very high level of craftsmanship. We then use color and texture to create a personality for each vehicle.  ",
        "author": "Larry Erickson"
    },
    {
        "quote": "You have to roll up your sleeves and be a stonecutter before you can become a sculptor – command of craft always precedes art: apprentice, journeyman, master.  ",
        "author": "Philip Gerard"
    },
    {
        "quote": "You can tear a poem apart to see what makes it tick… You’re back with the mystery of having been moved by words. The best craftsmanship always leaves holes and gaps… so that something that is not in the poem can creep, crawl, flash or thunder in.  ",
        "author": "Dylan Thomas"
    },
    {
        "quote": "Any intelligent fool can make things bigger, more complex, and more violent. It takes a touch of genius – and a lot of courage – to move in the opposite direction.  ",
        "author": "Albert Einstein"
    },
    {
        "quote": "I find going to bed and pulling my imagination over my head often means waking up with a solution to a design problem. That state of limbo, the time between sleeping and waking, seems to allow ideas to somehow outflank the sentinels of common sense. That’s when they can float to the surface. I find ideas often show up in the shower, or while I’m contemplating marmalade and toast and breakfast.  ",
        "author": "Alan Fletcher"
    },
    {
        "quote": "No masterpiece was ever created by a lazy artist.  ",
        "author": "Salvador Dali"
    },
    {
        "quote": "I fill up a place, which may be better… when I have made it empty.  ",
        "author": "William Shakespeare"
    },
    {
        "quote": "Advertising = Hey You + Buy Something  ",
        "author": "Craig Damrauer"
    },
    {
        "quote": "Don’t stare at a blank page for too long, be bold, and make the first incisive stroke. The rest will come naturally.   ",
        "author": "James Kingman"
    },
    {
        "quote": "We don’t get hired to make pretty things or win design awards. We get hired to solve business problems.   ",
        "author": "James Bradley"
    },
    {
        "quote": "Don’t think.  ",
        "author": "William Firebrace"
    },
    {
        "quote": "Let your watchword be order and your beacon beauty.  ",
        "author": "Daniel Hudson Burnham"
    },
    {
        "quote": "Think outside the DIV.  ",
        "author": "Kristof Orts"
    },
    {
        "quote": "The only important thing about design is how it relates to people.  ",
        "author": "Victor Papanek"
    },
    {
        "quote": "I never let my schooling get in the way of my education.  ",
        "author": "Mark Twain"
    },
    {
        "quote": "Moderation in all things, including moderation.  ",
        "author": "Petronius"
    },
    {
        "quote": "Inspiration is perishable.  ",
        "author": "37 Signals"
    },
    {
        "quote": "If you find an element of your interface requires instructions, then you need to redesign it.  ",
        "author": "Dan Rubin"
    },
    {
        "quote": "Being a designer is like being a porn star. You’re hot & popular for a year or two, then everyone goes off and finds something new to screw around too.  ",
        "author": "Jason Demetillo"
    },
    {
        "quote": "Design is the silent ambassador of your brand.  ",
        "author": "Paul Rand"
    },
    {
        "quote": "Start with a sketch, but make it quick. There’s real work to be done.  ",
        "author": "Stefan Hartwig"
    },
    {
        "quote": "To some degree, to be creative you have to be selfish.  ",
        "author": "Meredith Norwood"
    },
    {
        "quote": "As a profession, graphic designers have been shamefully remiss or ineffective about plying their craft for social or political betterment.  ",
        "author": "Steven Heller"
    },
    {
        "quote": "It has taken my entire life to understand what I already knew about creating art in 3rd grade.  ",
        "author": "Philip Carrera"
    },
    {
        "quote": "When the light turns green, you go.\nWhen the light turns red, you stop.\nBut what do you do when the light turns blue with orange and lavender spots?  ",
        "author": "Shel Silverstein"
    },
    {
        "quote": "It isn’t a question of enhancement through design. Whether an editor realizes it or not, design is part of what he does every time he prints the paper.  ",
        "author": "Louis Silverstein"
    },
    {
        "quote": "Be fluid. Treat each project differently. Be water, man. The best style is no style. Because styles can be figured out. And when you have no style they can’t figure you out.  ",
        "author": "Jay-Z"
    },
    {
        "quote": "Good designers copy; great designers steal.  ",
        "author": "Pablo Picasso"
    },
    {
        "quote": "I don’t think that all people read in the same way. Today, entire generations are growing up watching MTV and playing video games and it is safe to assume that these people have a high degree of visual sophistication. and are not easily discouraged by a lens straightforward or ambiguous typography. On the contrary, they are attracted and enticed to read something because of visual richness.  ",
        "author": "Ruby Vanderlans"
    },
    {
        "quote": "Get in over your head as often and as joyfully as possible.  ",
        "author": "Alexander Isley"
    },
    {
        "quote": "Check your bookshelf. If it’s full of titles on HTML, CSS, and the like, instead of typography, color, and layout, you may be missing a key ingredient in the designer’s knowledge diet.  ",
        "author": "Jeff Croft"
    },
    {
        "quote": "I can think of nothing worse than becoming really popular, being all the rage.  ",
        "author": "Rem Koolhaas"
    },
    {
        "quote": "Always give a little more than you promise.  ",
        "author": "The Studebaker Brothers"
    },
    {
        "quote": "Give me six hours to chop down a tree and I will spend the first four sharpening the axe.  ",
        "author": "Abraham Lincoln"
    },
    {
        "quote": "The big problem is most contemporary design practiced today is not really graphic design, but graphic decoration.  ",
        "author": "Art Chantry"
    },
    {
        "quote": "What we got here is… failure to communicate.  ",
        "author": "Cool Hand Luke"
    },
    {
        "quote": "Deal with the difficult while it is yet easy;\nDeal with the great while it is yet small.  ",
        "author": "Tao Te Ching"
    },
    {
        "quote": "For me, discomfort is a signal of an exceptional concept. When I’m totally comfortable with a concept, I’ve probably used it fore or seen it somewhere else. Discomfort is almost a prerequisite for a great idea.  ",
        "author": "Craig Frazier"
    },
    {
        "quote": "I mean there’s a fun in being hated, it puts a fire in your ass and it gets fucking boring to be loved by everyone.  ",
        "author": "James Hetfield"
    },
    {
        "quote": "I think there are two types of people in this world – people who can start things and people who can finish things. And while I place great value on the finishers, it’s the starters who are rare because they can envision what isn’t there.  ",
        "author": "Ed Frank"
    },
    {
        "quote": "If you’re not failing every now and again, it’s a sign you aren’t doing anything very innovative.  ",
        "author": "Woody Allen"
    },
    {
        "quote": "Clients don’t understand their success is reliant on standing out, not fitting in.  ",
        "author": "Don Draper"
    },
    {
        "quote": "The grid system is an aid, not a guarantee. It permits a number of possible uses and each designer can look for a solution appropriate to his personal style. But one must learn how to use the grid; it is an art that requires practice.  ",
        "author": "Josef Muller-Brockmann"
    },
    {
        "quote": "Do not go where the path may lead, go instead where there is no path and leave a trail.  ",
        "author": "Ralph Waldo Emerson"
    },
    {
        "quote": "Life is conversational. Web design should be the same way. On the web, you’re talking to someone you’ve probably never met – so it’s important to be clear and precise. Thus, well structured navigation and content organization goes hand in hand with having a good conversation.  ",
        "author": "Chikezie Ejiasi"
    },
    {
        "quote": "My rates are as follows:\n$50\/hr.\n$75\/hr. if you watch\n$100\/hr. if you help   ",
        "author": "An Autobody Sign"
    },
    {
        "quote": "Chances are, unless I’m a designer, I don’t know what I want. All I know is I want something functional that looks good, is comparable with my competitors, and features constant colour schemes for branding. I’ll look at other designs that have already been created and ask for something similar. Hence, it is important that you can take the information I give and help me visualize what it is you think I want.  ",
        "author": "Aditya Mahesh"
    },
    {
        "quote": "Whether the task is writing, design, or hanging a picture straight, it is obvious that we do our best work when healthy, rested, refreshed, alert, and eager to do the job for its own sake.  ",
        "author": "Jeffrey Zeldman"
    },
    {
        "quote": "Propaganda supersedes fact, truth and common sense in all cases.  ",
        "author": "P.S.C. Trier"
    },
    {
        "quote": "I blame television and movies, especially cop shows. 'Can you improve the resolution on that face?' 'Sure, let me just pull some information that was never captured out of my ass.'  ",
        "author": "Rod Knowlton"
    },
    {
        "quote": "Google has the functionality of a really complicated Swiss Army knife, but the home page is our way of approaching it closed. It’s simple, it’s elegant, you can slip it in your pocket, but it’s got the great doodad when you need it. A lot of our competitors are like a Swiss Army knife open – and that can be intimidating and occasionally harmful.",
        "author": "Marissa Mayer"
    },
    {
        "quote": "By far the dominant reason for not releasing sooner was a reluctance to trade the dream of success for the reality of feedback.  ",
        "author": "Kent Beck"
    },
    {
        "quote": "Put yourself out there, being awesome is long tail.   ",
        "author": "Allan Branch"
    },
    {
        "quote": "Real art has the capacity to make us nervous.  ",
        "author": "Susan Sontag"
    },
    {
        "quote": "If it’s a good idea and it gets you excited, try it, and if it bursts into flames, that’s going to be exciting too. People always ask, ‘What is your greatest failure?’ I always have the same answer—We’re working on it right now, it’s gonna be awesome!  ",
        "author": "Jim Coudal"
    },
    {
        "quote": "Graphic Designers are idea embalmers, loving undertakers preserving bits of data like so many butterflies pinned to felt in a jewel box.  ",
        "author": "Paul Saffo"
    },
    {
        "quote": "The design business continues to navel gaze. Designers are still designing for other designers rather than working to convince the business world of the importance of design in our everyday lives.  ",
        "author": "Joe Duffy"
    },
    {
        "quote": "Good design means never having to say 'Click Here.'  ",
        "author": "Shawn Leslie"
    },
    {
        "quote": "People always ask, 'What do you think of my site?' I want to say back to them, 'Who cares what I think. Does it meet your site requirements? Has it been tested? Has each requirement been validated? Are your site guidelines being adhered to?'  ",
        "author": "Kim Krause"
    },
    {
        "quote": "I have always railed against ideological purity, or any other kind. Corruption is more interesting than purity.  ",
        "author": "Milton Glaser"
    },
    {
        "quote": "Design from the spine and you’ll be fine.  ",
        "author": "Carl Heaton"
    },
    {
        "quote": "Don’t worry about people stealing your design work. Worry about the day they stop.  ",
        "author": "Jeffrey Zeldman"
    },
    {
        "quote": "What I love about design is the artistic and scientific complexity that also becomes useful…  ",
        "author": "Michelle Obama"
    },
    {
        "quote": "Getting addicted to design is bad for design.  ",
        "author": "Andy Altmann"
    },
    {
        "quote": "Everybody in advertising is blonde, beautiful, families are happy, care are never in traffic, everything is shiny, food looks like it’s incredibly taseful. I ask myself, 'How stupid are we?'  ",
        "author": "Oliveiro Toscani"
    },
    {
        "quote": "Do you think advertisement can sell if nobody can read it? You cannot save souls in an empty church.  ",
        "author": "David Ogilvy"
    },
    {
        "quote": "Graphic design is the paradise of individuality, eccentricity, heresy, abnormality, hobbies, and humors.  ",
        "author": "George Santayana"
    },
    {
        "quote": "Everyone has a plan until they get punched in the face.  ",
        "author": "Mike Tyson"
    },
    {
        "quote": "More designers should share space, share resources. Sort of an upscale communism.  ",
        "author": "April Greiman"
    },
    {
        "quote": "It is only with the heart that one can see rightly. What is essential is invisible to the eye.  ",
        "author": "Antoine De Saint Exupery"
    },
    {
        "quote": "Sometimes there is no need to be either clever or original.  ",
        "author": "Ivan Chermayeff"
    },
    {
        "quote": "I love designing, it is something which permeates my whole living, whether it is simply choosing the colour of my clothes in the morning or organising my household. Design to me is akin to beauty, an externalisation of my inner process regarding beauty & contentment with life.  ",
        "author": "Martine Moeykens"
    },
    {
        "quote": "You have to be interested in culture to design for it.  ",
        "author": "Lorraine Wild"
    },
    {
        "quote": "Client: 'My wife doesn’t like it'; Designer: 'Well then, I don’t like your wife'  ",
        "author": "Jamie Croft"
    },
    {
        "quote": "The difference between regulated architects and unregulated designers is, unlike buildings, letterheads don’t fall down and kill people.  ",
        "author": "Brian Webb"
    },
    {
        "quote": "Graphic designers find themselves in a role of visual dishwashers for the Information Architects’ chefs.  ",
        "author": "Gunnar Swanson"
    },
    {
        "quote": "Only work with people you’d invite to your home for a meal.  ",
        "author": "Garth Walker"
    },
    {
        "quote": "I look for three things in a project: 1) Compelling work; 2) fun client; 3) astronomical fees. However, to have a successful project, I really only need two out of three. For example, I’ll do great work with fun people for nothing and still feel rewarded. Or, I’ll do great work for a mean, stupid client for outrageous money. Or, I’ll do boring work with somebody I like a lot for more money than one can imagine. Anytime I’m faced with only one of the three it’s time to rethink the relationship. Actually, it’s time to move on.  ",
        "author": "Lowell Williams"
    },
    {
        "quote": "The way something looks is the last thing we figure out.  ",
        "author": "Alexander Isley"
    },
    {
        "quote": "In all affairs it’s a healthy thing now and then to hang a question mark on the things you have long taken for granted.  ",
        "author": "Bertrand Russell"
    },
    {
        "quote": "Designers tend to whisper, ad agencies tend to shout.  ",
        "author": "David Stuart"
    },
    {
        "quote": "I don’t think that design needs theory, but I think designers need theory.  ",
        "author": "Johanna Drucker"
    },
    {
        "quote": "Roses are red, violets are blue. I wont send the job unless you pay me.  ",
        "author": "Giulio Pinotti"
    },
    {
        "quote": "Design is thinking made visual.  ",
        "author": "Saul Bass"
    },
    {
        "quote": "Embrace change or become a Design-O-Saur.  ",
        "author": "Von Glitschka"
    },
    {
        "quote": "We unfortunately live in a corporate world where group decision making is made to avoid failure rather than to achieve success.  ",
        "author": "Bill Cahan"
    },
    {
        "quote": "A confident client will see your confidence as strength, not arrogance.  ",
        "author": "Diti Katona"
    },
    {
        "quote": "A lot of people in this business develop huge egos. Why? None of us is curing cancer. None of us is saving babies from burning buildings. We’re just a bunch of overpaid knuckleheads who think up nutty stuff for some other knuckleheads’ products.  ",
        "author": "Paul Howalt"
    },
    {
        "quote": "We can’t just design an item that looks great. We also have to anticipate how it is boxed up, distributed, and shipped, as well as whether or not a seventeen-year-old kid with a summer job can stock it on the store shelf without ruining it.  ",
        "author": "Robin Perkins"
    },
    {
        "quote": "It’s not the paper’s fault that so much shit is printed.  ",
        "author": "Alejandro Magallanes"
    },
    {
        "quote": "An old surrealist trick was to take images that had no business being together and plopping them into the same image. Your mind wants to make associations. Design does that all the time.  ",
        "author": "Art Chantry"
    },
    {
        "quote": "Any system that sees aesthetics as irrelevant, that separates the artist from the product, that fragments the work of the individual, or creates by committee, or makes mincemeat of the creative process will in the long run diminish not only the product but the maker as well.  ",
        "author": "Paul Rand"
    },
    {
        "quote": "I try and be as stupid as possible regarding my profession, which means I try to look at as few design magazines as possible.  ",
        "author": "Ettore Sottsass"
    },
    {
        "quote": "Design has become the cover for unnecessary consumption.  ",
        "author": "Peter Saville"
    },
    {
        "quote": "Think 8 hours, work 2 hours.  ",
        "author": "Mirko Ilic"
    },
    {
        "quote": "The pushy bird gets the worm.  ",
        "author": "Sean Adams"
    },
    {
        "quote": "If the bones don’t work, you’ve got a pile of skin.  ",
        "author": "Samuel Antupit"
    },
    {
        "quote": "If you dig a hole and it’s in the wrong place, digging it deeper isn’t going to help.  ",
        "author": "Seymour Chwast"
    },
    {
        "quote": "Some designers create things to show you what they did. I design things to tell you what I solved.  ",
        "author": "Brian Yerkes"
    },
    {
        "quote": "Great ideas can be found in every leaf, in every tree, in every blade of grass. Oh, no, wait… I was thinking of chlorophyll.  ",
        "author": "Jim Olen"
    },
    {
        "quote": "Marketing without design is lifeless, and design without marketing is mute.  ",
        "author": "Von R. Glitschka"
    },
    {
        "quote": "Listen to your client, take into consideration all of their input, weigh the options, study the details, know the target audience, and then, if necessary, ignore all of it and design what you think will work best.  ",
        "author": "Von R. Glitschka"
    },
    {
        "quote": "A designer is an emerging synthesis of artist, inventor, mechanic, objective economist and evolutio­nary strategist.  ",
        "author": "Buckminster Fuller"
    },
    {
        "quote": "Design is a formal response to a strategic question.  ",
        "author": "Mariona Lopez"
    },
    {
        "quote": "My secret is being not terrible at a lot of things.  ",
        "author": "Moby"
    },
    {
        "quote": "I make solutions nobody wants to problems that don’t exist.  ",
        "author": "Alvin Lustig"
    },
    {
        "quote": "In a well-made book, where designer, compositor and printer have all done their jobs, no matter how many thousands of lines and pages they must occupy, the letters are alive. They dance in their seats. Sometimes they rise and dance in the margins and aisles.  ",
        "author": "Robert Bringhurst"
    },
    {
        "quote": "It is not easy to know what you like. Most people fool themselves their entire lives about this. Self-acquaintance is a rare condition.  ",
        "author": "Robert Henri"
    },
    {
        "quote": "Design is easy. All you do is stare at the screen until drops of blood form on your forehead.  ",
        "author": "Marty Neumeier"
    },
    {
        "quote": "It’s not in the vulgar, it’s not in the shock that one finds art. And it’s not in the excessively beautiful. It’s in between; it’s in nuance.   ",
        "author": "Duane Michals"
    },
    {
        "quote": "Advertising projects, graphic design jobs, architecture assignments, filmmaking, and pretty much every other professional creative service usually begins with smart, talented people shaking hands across a table, and ends in finger-pointing and regret – like a Country & Western love song.  ",
        "author": "Jeffrey Zeldman"
    },
    {
        "quote": "The large print giveth and the small print taketh away.   ",
        "author": "Tom Waits"
    },
    {
        "quote": "Defamiliarize the ordinary.  ",
        "author": "Paul Rand"
    },
    {
        "quote": "The enemy of every author is not piracy, but obscurity.  ",
        "author": "Chris Anderson"
    },
    {
        "quote": "Every generation laughs at the old fashions, but follows religiously the new.  ",
        "author": "Henry David Thoreau"
    },
    {
        "quote": "Have no fear of perfection – you’ll never reach it.  ",
        "author": "Salvador Dali"
    },
    {
        "quote": "The function of design is letting design function.  ",
        "author": "Micha Commeren"
    },
    {
        "quote": "Technical skill is mastery of complexity, while creativity is mastery of simplicity.  ",
        "author": "Christopher Zeeman"
    },
    {
        "quote": "Begin with the end in mind.  ",
        "author": "Lana Rigsby"
    },
    {
        "quote": "Whether you think you can or whether you think you can’t – you are right.  ",
        "author": "Henry Ford"
    },
    {
        "quote": "Design is as much a matter of finding problems as it is solving them.  ",
        "author": "Bryan Lawson"
    },
    {
        "quote": "Once the problem was stated, its solution came to me in a flash.  ",
        "author": "Anton Fokker"
    },
    {
        "quote": "Do you validate other people’s markup? Yes? You’re an asshole.  ",
        "author": "Jeff Croft"
    },
    {
        "quote": "It is a mistake to think that you are the typical target user.  ",
        "author": "Cameron Moll"
    },
    {
        "quote": "Sometimes you have to keep ideas for decades before they have any use.  ",
        "author": "Marc English"
    },
    {
        "quote": "Making good design is easy. It’s polishing the half-assed stuff that takes time.  ",
        "author": "Stefan G. Bucher"
    },
    {
        "quote": "Don’t mistake legibility for communication.  ",
        "author": "David Carson"
    },
    {
        "quote": "Inspiration is hogwash. My work comes directly out of my loves and hates. Muses don’t whisper in my ear, and ideas don’t flow over my body like a cool rain.  ",
        "author": "James Victore"
    },
    {
        "quote": "Creativity is in everyone; it just manifests itself differently with each person. My CPA, for example, is one of the most creative people I know.  ",
        "author": "Ron Miriello"
    },
    {
        "quote": "If I create from the heart, nearly everything works; if from the head, almost nothing.  ",
        "author": "Marc Chagall"
    },
    {
        "quote": "I try not to think out of the box anymore, but on its edge, its corner, its flap, and under its bar code.  ",
        "author": "Clint Runge"
    },
    {
        "quote": "Designers don’t actually solve problems. They work through them.  ",
        "author": "Marty Neumeier"
    },
    {
        "quote": "I think designers who aren’t selfish do really awful work.  ",
        "author": "Paul Sahre"
    },
    {
        "quote": "The typeface doesn’t really matter, as long as the text is good.  ",
        "author": "John Maeda"
    },
    {
        "quote": "No one ever discovered anything new by coloring inside the lines.  ",
        "author": "Thomas Vasquez"
    },
    {
        "quote": "Without good design it is easy to miss the point.  ",
        "author": "Bjarni Wark"
    },
    {
        "quote": "I like my ARTSY with a little bit of FARTSY.  ",
        "author": "Marc Johns"
    },
    {
        "quote": "Beautiful accidents can happen, but accident is not the basis for design excellence. Purposeful discovery followed by focused, skillful conceptualization and execution is the basis for design excellence.  ",
        "author": "Andy Rutledge"
    },
    {
        "quote": "Turning away bad clients can leave you feeling oddly guilty. They’re sort of like alcoholic or meth head cousins who force you, by their own bad behavior into denying them things you wouldn’t deny other people. You’re left feeling not quite yourself.  ",
        "author": "Carolyn Wood"
    },
    {
        "quote": "We’re all naturally curious when we’re eight years old. But as most people get older, they become less and less curious, so they ask other people to be curious for them. That’s what I do for a living.  ",
        "author": "Ron Miriello"
    },
    {
        "quote": "There are some things in painting which cannot be explained, and that something is essential.  ",
        "author": "Pierre Auguste Renoir"
    },
    {
        "quote": "Creativity often consists of merely turning up what is already there. Did you know that right and left shoes were thought up only a little more than a century ago?  ",
        "author": "Bernice Fitz-Gibbon"
    },
    {
        "quote": "It is not daily increase but daily decrease; hack away the unessential.  ",
        "author": "Bruce Lee"
    },
    {
        "quote": "A hunch is creativity trying to tell you something.  ",
        "author": "Frank Capra"
    },
    {
        "quote": "Visualization without Design is merely a dream. Design without Visualization just passes the time.  ",
        "author": "Sonal Nayyar"
    },
    {
        "quote": "The same hand can draw art for the sake of emotional expression and design that serves a purpose.  ",
        "author": "Raphael Henry"
    },
    {
        "quote": "Take a walk. Dance a jig. Get some sun. Don’t take yourself to serious. Cook something ethnic. Play the 3 chords you know on guitar. Go get coffee. Tell a bad joke, to yourself, and laugh. Look at the way a leaf is made. Overhear someone else’s conversation. Write it down. Remember it later. Get some sleep.  ",
        "author": "Kyle Steed"
    },
    {
        "quote": "There are no bad ideas, just bad decisions.  ",
        "author": "Jacob Cass"
    },
    {
        "quote": "If you have a great idea, it will tell you how to execute it.  ",
        "author": "Jack H. Summerford"
    },
    {
        "quote": "How can there be too many typefaces in the world? Are there too many songs, too many books, too many places to go?  ",
        "author": "Rian Hughes"
    },
    {
        "quote": "The best design tool is a long eraser with a pencil at one end.  ",
        "author": "Marty Neumeier"
    },
    {
        "quote": "Be who you are and say what you feel because those who mind don’t matter and those who matter don’t mind.  ",
        "author": "Dr. Seuss"
    },
    {
        "quote": "The more uninteresting the letter, the more useful it is to the typographer.  ",
        "author": "Piet Zwart"
    },
    {
        "quote": "Stick to your knitting (what you’re good at), don’t compromise, and don’t suffer fools.  ",
        "author": "Simon Campbell"
    },
    {
        "quote": "Most trademarks don’t look that good on the radio.  ",
        "author": "Ken Cato"
    },
    {
        "quote": "When we feel less secure, with less control over our daily lives, we reach out to brands to connect with a time when things seemed better.  ",
        "author": "Mark Gobe"
    },
    {
        "quote": "When Einstein realized, 'Dear me, this universe with its wonders all adds up to E=mc2?,' he did not stop to think whether this concept would sell better set in Futura or Antikva.  ",
        "author": "Kari Piippo"
    },
    {
        "quote": "It’s about whittling. It’s about taking something and whittling and whittling and getting it sharp and perfect. Then you’ve got something.  ",
        "author": "James Victore"
    },
    {
        "quote": "I love deadlines. I like the whooshing sound they make as they go by.  ",
        "author": "Douglas Adams"
    },
    {
        "quote": "You do a disservice to your clients when you don’t fire the bad ones because you eventually provide poor service to those you don’t want to serve.  ",
        "author": "Jason M. Blumer"
    },
    {
        "quote": "I became a graphic artist because of the tools. I love working at a big drawing table with traditional tools: T-squares, compasses, mechanical pencils, French curves, blank ink, and graphite. At a computer, one works on a keyboard. I never considered myself a typist.  ",
        "author": "Michael Schwab"
    },
    {
        "quote": "We live in a society where everybody feels guilty. We want to do good, but we don’t want to get out of the house. A brand can help us feel good if you buy this yogurt.  ",
        "author": "Mark Gobé"
    },
    {
        "quote": "Simplify, then add lightness.  ",
        "author": "Colin Chapman"
    },
    {
        "quote": "High degrees of specialization may be rendering us unable to see the connections between the things we design and their consequences as they ripple out into the biosphere.  ",
        "author": "Terry Irwin"
    },
    {
        "quote": "I think advertising is a brilliant concept that has been pooped upon by selfish marketers, resulting in corrupted motives and flawed execution.  ",
        "author": "Michael Mistretta"
    },
    {
        "quote": "Graphic designers are, by and large, selfish and spoiled. They stubbornly control and individually design things that a generally smaller than them, perfecting to a level appreciated only by people like them. They don’t share and play well with others.  ",
        "author": "Wayne Hunt"
    },
    {
        "quote": "The strategy in communications is not to sell the 1\/4″-inch drill bit, but the 1\/4″-inch hole.  ",
        "author": "Robert Louey"
    },
    {
        "quote": "Stop looking at yourself as a designer, and start thinking of yourself as a deliverer of ideas.  ",
        "author": "Ståle Melvær"
    },
    {
        "quote": "Perfect typography is certainly the most elusive of all arts. Sculpture in stone alone comes near it in obstinacy.  ",
        "author": "Jan Tschichold"
    },
    {
        "quote": "An electrician isn’t an opinion former, but a graphic designer is. My argument is that all graphic designers hold high levels of responsibility in society. We take invisible ideas and make them tangible. That’s our job.   ",
        "author": "Neville Brody"
    },
    {
        "quote": "Whenever I have an idea I write it down, even if it’s not a very good idea. Sometimes the bad ideas will lead to better ones.  ",
        "author": "Steven Snell"
    },
    {
        "quote": "The moment clients realize that revisions are not an all-you-can-eat buffet, suddenly they realize they are not hungry.  ",
        "author": "Lester Beall"
    },
    {
        "quote": "The objective in times of economic restraint should be to seek excellence, not opulence.  ",
        "author": "David Craib"
    },
    {
        "quote": "There is no design without discipline. There is no discipline without intelligence.  ",
        "author": "Massimo Vignelli"
    },
    {
        "quote": "In the matter of layout, forget art and use horse-sense. The printer-designer’s  whole duty is to make a clear presentation of the message… This calls for an exercise of common sense and faculty of analysis rather than for art.  ",
        "author": "William Addison Dwiggins"
    },
    {
        "quote": "I’m sure there are fine artists out there who keep the audience in mind when they work. But it’s not the accepted trajectory of the profession. Conversely, it’s very clear in design that what we do needs to be seen an understood by an audience.  ",
        "author": "Stefan Sagmeister"
    },
    {
        "quote": "You can have an art experience in front of a Rembrandt… or in front of a piece of graphic design.  ",
        "author": "Stefan Sagmeister"
    },
    {
        "quote": "The only true happiness comes from squandering ourselves for a purpose.  ",
        "author": "John Mason Brown"
    },
    {
        "quote": "Every practice has a set of rules which governs it. Mastery occurs with the realization of these rules. Innovation occurs at the point of intelligent and creative rebellion against them.  ",
        "author": "Fiel Valdez"
    },
    {
        "quote": "Senior men have no monopoly on great ideas. Nor do creative people. Some of the best ideas come from account executives, researchers and others. Encourage this, you need all the ideas you can get.  ",
        "author": "David Ogilvy"
    },
    {
        "quote": "The amount a person uses his imagination is inversely proportional to the amount of punishment he will receive for using it.  ",
        "author": "Anonymous"
    },
    {
        "quote": "The next time you see a sixteen-color, blind-embossed, gold-stamped, die-cut, elaborately folded and bound job, printed on handmade paper, see if it isn’t a mediocre idea trying to pass for something else.  ",
        "author": "Milton Glaser"
    },
    {
        "quote": "Do what you love and tomorrow will pay the rent.  ",
        "author": "Felix Sockwell"
    },
    {
        "quote": "A complex system that works is invariably found to have evolved from a simple system that worked. The inverse proposition also appears to be true: A complex system designed from scratch never works and cannot be made to work. You have to start over, beginning with a working simple system.  ",
        "author": "John Gall"
    },
    {
        "quote": "Good design is all about making other designers feel like idiots because that idea wasn’t theirs.  ",
        "author": "Frank Chimero"
    },
    {
        "quote": "People ignore design that ignores people.  ",
        "author": "Frank Chimero"
    },
    {
        "quote": "I’ve always held to the belief that the practice of creating compelling graphic design occurs not by employing the principals of a democracy, but rather, that of a monarchy.  ",
        "author": "Thomas Vasquez"
    },
    {
        "quote": "What I’m trying to produce is the visual equivalent of the chord change that makes the hairs on the back of your neck stand up.  ",
        "author": "Rian Hughes"
    },
    {
        "quote": "Good design is obvious. Great design is transparent.  ",
        "author": "Joe Sparano"
    },
    {
        "quote": "Every designers’ dirty little secret is that they copy other designers’ work. They see work they like, and they imitate it. Rather cheekily, they call this inspiration.  ",
        "author": "Aaron Russell"
    },
    {
        "quote": "The secret to creativity is knowing how to hide your sources.  ",
        "author": "Albert Einstein"
    },
    {
        "quote": "Everything is designed. Few things are designed well.  ",
        "author": "Brian Reed"
    },
    {
        "quote": "An inexperienced observer sees everything in a picture; the experienced one sees even the things that are missing.  ",
        "author": "Rastko Ciric"
    },
    {
        "quote": "Do not seek to change what has come before. Seek to create that which has not.  ",
        "author": "David Airey"
    },
    {
        "quote": "Spec = asking the world to have sex with you and promising a dinner date to one lucky winner.  ",
        "author": "Jeffrey Zeldman"
    },
    {
        "quote": "Accidents often produce the best solutions… only you can recognize the difference between an accident and your original intent.  ",
        "author": "Jennifer Morla"
    },
    {
        "quote": "Design is a plan for arranging elements in such a way as best to accomplish a particular purpose.  ",
        "author": "Charles Eames"
    },
    {
        "quote": "The most innovative designers consciously reject the standard option box and cultivate an appetite for thinking wrong.  ",
        "author": "Marty Neumeier"
    },
    {
        "quote": "Visual design is often the polar opposite of engineering: trading hard edges for subjective decisions based on gut feelings and personal experiences. It’s messy, unpredictable, and notoriously hard to measure. The apparently erratic behavior of artists drives engineers bananas. Their decisions seem arbitrary and risk everything with no guaranteed benefit.  ",
        "author": "Scott Stevenson"
    },
    {
        "quote": "Design is where science and art break even.  ",
        "author": "Robin Mathew"
    },
    {
        "quote": "I’m convinced that without bad design, the world would be a far less stimulating place; we would have nothing to marvel over and nothing to be nostalgic about.  ",
        "author": "Carrie Phillips"
    },
    {
        "quote": "If you’re more susceptible to interruption, you do more out of the box thinking.  ",
        "author": "Don Norman"
    },
    {
        "quote": "Behavioral design is all about feeling in control. Includes: usability, understanding, but also the feel.  ",
        "author": "Don Norman"
    },
    {
        "quote": "To be truly great, we have to understand the motivation of our clients, maintain constant two-way communication with shockingly uncreative people, get a firm handle on copywriting and how that craft exists symbiotically with the visual element, and foresee how the finished whole will be greater than the sum of the bits and pieces we spent hours obsessing over. All of these factors cascade into the final product.  ",
        "author": "Kevin Potts"
    },
    {
        "quote": "Good design must be defined by appropriateness to audience and goals, and by its effectiveness, not by its adherence to Swiss design or the number of awards it wins.  ",
        "author": "Drew Davies"
    },
    {
        "quote": "Simplicity does not mean want or poverty. It does not mean the absence of any decor, or absolute nudity. It only means that the decor should belong intimately to the design proper, and that anything foreign to it should be taken away.  ",
        "author": "Paul Jacques Grillo"
    },
    {
        "quote": "In most agencies, account executives outnumber the copywriters two to one. If you were a dairy farmer, would you employ twice as many milkers as you had cows?  ",
        "author": "David Ogilvy"
    },
    {
        "quote": "Suppose I showed you two rooms where in one a group of programmers was developing a program to monitor a heart patient and keep him alive until the doctors arrive if something goes wrong and in the other a group of street people was using Microsoft Word to write letters to their parole officers. You would not be able to tell the rooms apart.  ",
        "author": "Richard P. Gabriel"
    },
    {
        "quote": "However beautiful the strategy, you should occasionally look at the results.  ",
        "author": "Winston Churchill"
    },
    {
        "quote": "A well-defined problem is half solved.  ",
        "author": "Michael Osborne"
    },
    {
        "quote": "The good is not a category that interests me.  ",
        "author": "Rem Koolhaas"
    },
    {
        "quote": "It’s really hard to design products by focus groups. A lot of times, people don’t know what they want until you show it to them.  ",
        "author": "Steve Jobs"
    },
    {
        "quote": "When I am working on a problem, I never think about beauty. I only think about how to solve the problem. But when I have finished, if the solution isn’t beautiful, I know it is wrong.  ",
        "author": "Richard Buckminster Fuller"
    },
    {
        "quote": "Never do anything yourself that you can hire someone else to do, especially if they can do it better.  ",
        "author": "Bill Bernback"
    },
    {
        "quote": "I think if you’re starting out early in the process by talking about your ideas for solutions, you’re already not listening. I think you need to enter into any design project with that zen learner’s mind of ‘I don’t know what I don’t know.’  ",
        "author": "Kim Goodwin"
    },
    {
        "quote": "All projects are different, but you have treat each one with care. Sometimes you get to build a luxury yacht; other times, it’ll be a rowboat. You still have to make sure the thing doesn’t spring a leak.  ",
        "author": "Stefan G. Bucher"
    },
    {
        "quote": "Often design departments are viewed as little decoration groups… They’ll make everything look pretty. Well, I can tell you, that doesn’t work.  ",
        "author": "Peter Phillips"
    },
    {
        "quote": "Being a famous designer is like being a famous dentist.  ",
        "author": "Noreen Morioka"
    },
    {
        "quote": "My adventure has all been in my mind. The great adventure has been thinking. I love to think about things. I think that the lack of drama in my life has produced a platform for me to be fundamentally adventurous in my thinking.  ",
        "author": "Milton Glaser"
    },
    {
        "quote": "'Fun' is a tricky word. People think that if you’re having 'fun', you’re ignoring content, or you’re ignoring the importance of the piece. But that’s not true.  ",
        "author": "Carin Goldberg"
    },
    {
        "quote": "As a graphic designer, I like to collaborate. I don’t want to be in a cold garret somewhere smoking unfiltered Camels all by myself with paint all over my body.  ",
        "author": "Carin Goldberg"
    },
    {
        "quote": "Inspiration exists, but it has to find you working.  ",
        "author": "Pablo Picasso"
    },
    {
        "quote": "I’ve been imitated so well I’ve heard people copy my mistakes.  ",
        "author": "Jimi Hendrix"
    },
    {
        "quote": "Design creates culture. Culture shapes values. Values determine the future.  ",
        "author": "Robert L. Peters"
    },
    {
        "quote": "Never let your clients see you drive a more expensive car than they drive.  ",
        "author": "Rick Tharp"
    },
    {
        "quote": "Never show fools unfinished work.  ",
        "author": "Michael Schrage"
    },
    {
        "quote": "Too often, look and feel, color scheme, layout, and identity are presented as solutions to problems discussed in these conversations long before regard is given to other less-aesthetic issues that may very well be the root of the problem. The old warning against treating symptom rather than cause comes to mind.   ",
        "author": "Cameron Moll"
    },
    {
        "quote": "It’s art if it can’t be explained. It’s fashion if no one asks for an explanation. It’s design if it doesn’t need explanation.  ",
        "author": "Wouter Stokkel"
    },
    {
        "quote": "There’s big money in studying art … if you own the school.  ",
        "author": "Charlie Deitch"
    },
    {
        "quote": "Experts are rarely insulted by something that is clear enough for beginners. Everybody appreciates clarity.  ",
        "author": "Steve Krug"
    },
    {
        "quote": "A picture is worth a thousand dollars.  ",
        "author": "Marty Neumeier"
    },
    {
        "quote": "You can’t do better design with a computer, but you can speed up your work enormously.  ",
        "author": "Wim Crouwel"
    },
    {
        "quote": "If the reader notices the interior page design of a book – even if he or she likes what they see – I’ve missed, because I distracted them from their reading.  ",
        "author": "Stephen Tiano"
    },
    {
        "quote": "People with tiny glasses and costly shoes can always find a couple of hours to explain how you did it all wrong.  ",
        "author": "Merlin Mann"
    },
    {
        "quote": "Whether we like it or not, our legacy as designers is ugly. We’re largely responsible for fueling a culture of consumption.  ",
        "author": "Eric Karjaluoto"
    },
    {
        "quote": "I love the comment, 'You must love designing for a living.' At that point I usually start to laugh or break into uncontrollable tears.  ",
        "author": "Andrew Lewis"
    },
    {
        "quote": "Making the simple complicated is commonplace; making the complicated simple, awesomely simple, that’s creativity.  ",
        "author": "Charles Mingus"
    },
    {
        "quote": "The dumbest mistake is viewing design as something you do at the end of the process to ‘tidy up’ the mess, as opposed to understanding it’s a ‘day one’ issue and part of everything.  ",
        "author": "Tom Peters"
    },
    {
        "quote": "Designers have a dual duty; contractually to their clients and morally to the later users and recipients of their work.  ",
        "author": "Hans Höger"
    },
    {
        "quote": "Good design goes to heaven; bad design goes everywhere.  ",
        "author": "Mieke Gerritzen"
    },
    {
        "quote": "A designer is a planner with an aesthetic sense.  ",
        "author": "Bruno Munari"
    },
    {
        "quote": "Computers are to design as microwaves are to cooking.  ",
        "author": "Milton Glaser"
    },
    {
        "quote": "I find modernist design boring, but it so much faster!  ",
        "author": "Christine Suewon Lee"
    },
    {
        "quote": "The client may be king, but he’s not the art director.  ",
        "author": "Von R. Glitschka"
    },
    {
        "quote": "Design is the application of intent – the opposite of happenstance, and an antidote to accident.  ",
        "author": "Robert L. Peters"
    },
    {
        "quote": "Broken gets fixed. Shoddy lasts forever.  ",
        "author": "Jack Moffet"
    },
    {
        "quote": "One should respect public opinion in so far as is necessary to avoid starvation and to keep out of prison.  ",
        "author": "Bertrand Russell"
    },
    {
        "quote": "Find the simple story in the product, and present it in an articulate and intelligent, persuasive way.  ",
        "author": "Bill Bernbach"
    },
    {
        "quote": "When you do something, you should burn yourself up completely, like a good bonfire, leaving no trace of yourself.  ",
        "author": "Shunryu Suzuki"
    },
    {
        "quote": "A customer is the most important visitor on our premises.\nHe is not dependent on us. We are dependent on him.\nHe is not an interruption of our work. He is the purpose of it.\nHe is not an outsider to our business. He is part of it.\nWe are not doing him a favour by serving him.\nHe is doing us a favour by giving us the opportunity to do so.  ",
        "author": "Mahatma Gandhi"
    },
    {
        "quote": "In the beginner’s mind there are many possibilities, but in the expert’s mind there are few.  ",
        "author": "Shunryu Suzuki"
    },
    {
        "quote": "What works good is better than what looks good, because what works good lasts.  ",
        "author": "Ray Eames"
    },
    {
        "quote": "You can’t improvise on nothing man; you’ve gotta improvise on something.  ",
        "author": "Charles Mingus"
    },
    {
        "quote": "The quality of any creative endeavor tends to approach the level of taste of whoever is in charge.  ",
        "author": "John Gruber"
    },
    {
        "quote": "A logo doesn’t sell, it identifies. A logo derives its meaning from the quality of the thing it symbolizes, not the other way around. A logo is less important than the product it signifies; what it means is more important than what it looks like.  ",
        "author": "Paul Rand"
    },
    {
        "quote": "When you make something no one hates, no one loves it.  ",
        "author": "Tibor Kalman"
    },
    {
        "quote": "Call me a minimalist, call me boring and practical, whatever, but sometimes the best way to say something is with a word.  ",
        "author": "Justin French"
    },
    {
        "quote": "Just because you’ve always done it that way doesn’t mean it’s not incredibly stupid.  ",
        "author": "Despair Poster"
    },
    {
        "quote": "It took me a few seconds to draw it, but it took me 34 years to learn how to draw it in a few seconds.  ",
        "author": "Paula Scher"
    },
    {
        "quote": "Design is the search for a magical balance between business and art; art and craft; intuition and reason; concept and detail; playfulness and formality; client and designer; designer and printer; and printer and public.  ",
        "author": "Valerie Pettis"
    },
    {
        "quote": "Every night I pray that clients with taste will get money and clients with money will get taste.  ",
        "author": "Bill Gardner"
    },
    {
        "quote": "I have found the best people to work with are gay men. They never have to ‘run it past their wives.’",
        "author": "Rodney Davidson"
    },
    {
        "quote": "If your UI even vaguely resembles an airplane cockpit, you’re doing it wrong.  ",
        "author": "John Gruber"
    },
    {
        "quote": "The thing that’s so wonderful about using beautiful, appropriate tools is that they become an extension of you, your body, you fingertips, and your mind. They get out of the way and let you directly interact with the problem you are solving. Everyone’s tried to remove a screw without a screwdriver; a task quickly becomes impossible that otherwise would be trivial.",
        "author": "Luke Crawford"
    },
    {
        "quote": "Don’t spend too much time planning, release early and often, some things will work, others won’t, refine and move forward and above all forget the money, just make sure you love what you’re doing.  ",
        "author": "Kevin Rose"
    },
    {
        "quote": "A common mistake that people make when trying to design something completely foolproof is to underestimate the ingenuity of complete fools.  ",
        "author": "Douglas Adams"
    },
    {
        "quote": "A camel is a horse designed by a committee.  ",
        "author": "Sir Alec Issigonis"
    },
    {
        "quote": "If I’d asked people what they wanted, they would have said a faster horse.  ",
        "author": "Henry Ford"
    },
    {
        "quote": "A designer can mull over complicated designs for months. Then suddenly the simple, elegant, beautiful solution occurs to him. When it happens to you, it feels as if God is talking! And maybe He is.  ",
        "author": "Leo Frankowski"
    },
    {
        "quote": "There are two ways of constructing a software design. One way is to make it so simple that there are obviously no deficiencies. And the other way is to make it so complicated that there are no obvious deficiencies.  ",
        "author": "C.A.R. Hoare"
    },
    {
        "quote": "The scariest moment is always just before you start.  ",
        "author": "Stephen King"
    },
    {
        "quote": "Nothing is original. Steal from anywhere that resonates with inspiration or fuels your imagination. Devour old films, new films, music, books, paintings, photographs, poems, dreams, random conversations, architecture, bridges, street signs, trees, clouds, bodies of water, light and shadows. Select only things to steal from that speak directly to your soul. If you do this, your work (and theft) will be authentic. Authenticity is invaluable; originality is nonexistent. And don’t bother concealing your thievery – celebrate it if you feel like it.  ",
        "author": "Jim Jarmusch"
    },
    {
        "quote": "For me, design is like choosing what I’m going to wear for the day – only much more complicated and not really the same at all.  ",
        "author": "Robynne Raye"
    },
    {
        "quote": "Bad design is smoke, while good design is a mirror.  ",
        "author": "Juan-Carlos Fernandez"
    },
    {
        "quote": "Art is making something out of nothing and selling it.  ",
        "author": "Frank Zappa"
    },
    {
        "quote": "Design should never say, 'Look at me.' It should always say, 'Look at this.'  ",
        "author": "David Craib"
    },
    {
        "quote": "Art is like masturbation. It is selfish and introverted and done for you and you alone. Design is like sex. There is someone else involved, their needs are just as important as your own, and if everything goes right, both parties are happy in the end.  ",
        "author": "Colin Wright"
    },
    {
        "quote": "We are not artists or poets. We are artisans and craftsmen. Our products solve problems. They do not hang on museum walls.  ",
        "author": "Dan Lacivita"
    },
    {
        "quote": "Many desperate acts of design (including gradients, drop shadows, and the gratuitous use of transparency) are perpetuated in the absence of a strong concept. A good idea provides a framework for design decisions, guiding the work.  ",
        "author": "Ellen Lupton"
    },
    {
        "quote": "The first word of the first line is the critical word of that particular body of text. Let it start flush, at least.  ",
        "author": "W.A. Dwiggins"
    },
    {
        "quote": "I would show my jobs to my mother, and she would always say the same thing: 'That’s nice dear.' And then she would say, 'Did you write it?' or 'Did you do the drawing?' or 'Did you take the pictures?' I’d always answer 'no,' then I realized the problem. My answer was then, 'I made this happen. It’s called design.'  ",
        "author": "Brian Webb"
    },
    {
        "quote": "Clients have no trouble paying $5,800 for an hour in a Gulfstream corporate jet or $425 for a month of parking. But God forbid they spend $3 per on a glossy annual report.  ",
        "author": "Bill Cahan"
    },
    {
        "quote": "Don’t design for everyone. It’s impossible. All you end up doing is designing something that makes everyone unhappy.  ",
        "author": "Leisa Reichelt"
    },
    {
        "quote": "Most [clients] expect experience design to be a discrete activity, solving all their problems with a single functional specification or a single research study. It must be an ongoing effort, a process of continually learning about users, responding to their behaviors, and evolving the product or service.  ",
        "author": "Dan Brown"
    },
    {
        "quote": "If the users can’t find it, the function’s not there.  ",
        "author": "Human Factors International"
    },
    {
        "quote": "Technology over technique produces emotionless design.  ",
        "author": "Daniel Mall"
    },
    {
        "quote": "The ugly can be beautiful. The pretty, never.  ",
        "author": "Oscar Wilde"
    },
    {
        "quote": "I think design covers so much more than the aesthetic. Design is fundamentally more. Design is usability. It is Information Architecture. It is Accessibility. This is all design.  ",
        "author": "Mark Boulton"
    },
    {
        "quote": "Show me someone who has done something worthwhile, and I’ll show you someone who has overcome adversity.  ",
        "author": "Lou Holtz"
    },
    {
        "quote": "Web design is the creation of digital environments that facilitate and encourage human activity; reflect or adapt to individual voices and content; and change gracefully over time while always retaining their identity.  ",
        "author": "Jeffrey Zeldman"
    },
    {
        "quote": "IF YOU MAKE EVERYTHING BOLD, NOTHING IS BOLD.  ",
        "author": "Art Webb"
    },
    {
        "quote": "Beauty is the ultimate defense against complexity.  ",
        "author": "David Gelernter"
    },
    {
        "quote": "A computer without Photoshop is like a dog with no legs. Sure is fun, but you can’t really do anything with it.  ",
        "author": "Benjamin Cavanagh"
    },
    {
        "quote": "The life of a designer is a life of fight: fight against the ugliness.  ",
        "author": "Massimo Vignelli"
    },
    {
        "quote": "Design is as much an act of spacing as an act of marking.  ",
        "author": "Ellen Lupton"
    },
    {
        "quote": "It is a pretty recognizable brand name. Originally it was 'Jerry’s Guide to the World Wide Web' but we settled on 'Yahoo'.  ",
        "author": "Jerry Yang"
    },
    {
        "quote": "If design isn’t profitable, then it’s art.  ",
        "author": "Henrik Fiskar"
    },
    {
        "quote": "When I complained about being paid fifty dollars for an article that had taken me a week to write, he [Kurt] said I should take into account what it would have cost me to take out a two-page ad announcing that I could write.  ",
        "author": "Mark Vonnegut"
    },
    {
        "quote": "You want something done, ask someone busy.  ",
        "author": "Mat Helme"
    },
    {
        "quote": "Any sufficiently advanced technology is indistinguishable from magic.  ",
        "author": "Arthur C. Clarke"
    },
    {
        "quote": "However, I’ve always been more concerned with users. Programmers do their work but once, while users are saddled with it ever thereafter.  ",
        "author": "Jef Raskin"
    },
    {
        "quote": "We have to learn to see technical devices and software as others see them. Feeling a sense of pride in getting a device to do what we want doesn’t mean we’re clever, it means the design was wrong.  ",
        "author": "Jeremy Allison"
    },
    {
        "quote": "Do what I want, not what I say.  ",
        "author": "Brian Fritzpatick"
    },
    {
        "quote": "It’s amazing how much you can get done in a day if you just sit and you do it.  ",
        "author": "Bill Tregle’s Dad"
    },
    {
        "quote": "Colors, like features, follow the changes of the emotions.  ",
        "author": "Pablo Picasso"
    },
    {
        "quote": "For web designers, there are four keys to surviving bad economic times: do good work, charge a fair price, lower your overhead, and be sure you are communicating with your client.  ",
        "author": "Jeffrey Zeldman"
    },
    {
        "quote": "Every creator painfully experiences the chasm between his inner vision and its ultimate expression.  ",
        "author": "Isaac Bashevis Singer"
    },
    {
        "quote": "A well-designed text will seem weightless after a time; the initial feel of the book fades away as the mind becomes engrossed in the words.  ",
        "author": "Mandy Brown"
    },
    {
        "quote": "Keep it simple, stupid!  ",
        "author": "Old Saying"
    },
    {
        "quote": "Graphic design will save the world right after rock and roll does.  ",
        "author": "David Carson"
    },
    {
        "quote": "Less is more.  ",
        "author": "Ludwig Mies van der Rohe"
    },
    {
        "quote": "Don’t make something unless it is both necessary and useful; but if it is both necessary and useful, don’t hesitate to make it beautiful.  ",
        "author": "Shaker Philosophy"
    },
    {
        "quote": "Simplicity is the ultimate sophistication.  ",
        "author": "Leonardo da Vinci"
    },
    {
        "quote": "Simplicity is not the goal. It is the by-product of a good idea and modest expectations.  ",
        "author": "Paul Rand"
    },
    {
        "quote": "Design is intelligence made visible.  ",
        "author": "Alina Wheeler"
    },
    {
        "quote": "You cannot not communicate.  ",
        "author": "Paul Watzlawik"
    },
    {
        "quote": "Rules can be broken — but never ignored.  ",
        "author": "David Jury"
    },
    {
        "quote": "You are what you are seen to be.  ",
        "author": "Erik Spiekermann"
    },
    {
        "quote": "If you can’t explain it simply, you don’t understand it well enough.  ",
        "author": "Albert Einstein"
    },
    {
        "quote": "The difference between a Designer and Developer, when it comes to design skills, is the difference between shooting a bullet and throwing it.  ",
        "author": "Scott Hanselman"
    },
    {
        "quote": "It’s not about knowing all the gimmicks and photo tricks. If you haven’t got the eye, no program will give it to you.  ",
        "author": "David Carson"
    },
    {
        "quote": "The second best friend you can have (the first being someone who can give you a good job) is another designer or illustrator.  ",
        "author": "Ward Schumaker"
    },
    {
        "quote": "Math is easy; design is hard.  ",
        "author": "Jeffrey Veen"
    },
    {
        "quote": "I am always doing that which I can not do, in order that I may learn how to do it.  ",
        "author": "Pablo Picasso"
    },
    {
        "quote": "Design is the conscious effort to impose a meaningful order.  ",
        "author": "Victor Papanek"
    },
    {
        "quote": "Imitation may be the 'sincerest form of plagiarism,' but it is also the mark of an inferior person.  ",
        "author": "David Ogilvy"
    },
    {
        "quote": "Good, fast, or cheap… pick two.  ",
        "author": "Old Adage"
    },
    {
        "quote": "There is no one who loves pain itself, who seeks after it and wants to have it, simply because it is pain….  ",
        "author": "Lorem Ipsum (translation)"
    },
    {
        "quote": "If I had more time, I would have written a shorter letter.  ",
        "author": "Marcus T. Cicero"
    },
    {
        "quote": "Design is an opportunity to continue telling the story, not just to sum everything up.    ",
        "author": "Tate Linden"
    },
    {
        "quote": "If you want me to give you a two-hour presentation, I am ready today.  If you want only a five-minute speech, it will take me two weeks to prepare.  ",
        "author": "Mark Twain"
    },
    {
        "quote": "Practice safe design: Use a concept.  ",
        "author": "Petrula Vrontikis"
    },
    {
        "quote": "Consistency is one of the most powerful usability principles: when things always behave the same, users don’t have to worry about what will happen. Instead, they know what will happen based on earlier experience.  ",
        "author": "Jakob Nielsen"
    },
    {
        "quote": "Things you think are obvious often aren’t, text you thought explained something doesn’t even get read, and generally speaking users do things they weren’t supposed to do. Even if the only user testing you ever do is asking some friends to use a site while you observe them, you’ll already be better for it.  ",
        "author": "Collis Ta’eed"
    },
    {
        "quote": "QA Engineer walks into a bar. Orders a beer. Orders 0 beers. Orders 999999999 beers. Orders a lizard. Orders -1 beers. Orders a sfdeljknesv.",
        "author": "Bill Sempf"
    },
    {
        "quote": "There are only two hard things in Computer Science: cache invalidation, naming things and off-by-one errors.",
        "author": "Phil Karlton"
    },
    {
        "quote": "In software, we rarely have meaningful requirements. Even if we do, the only measure of success that matters is whether our solution solves the customer’s shifting idea of what their problem is.",
        "author": "Jeff Atwood"
    },
    {
        "quote": "If Java had true garbage collection, most programs would delete themselves upon execution.",
        "author": "Robert Sewell"
    },
    {
        "quote": "C++ : Where friends have access to your private members.",
        "author": "Gavin Russell Baker"
    },
    {
        "quote": "In C++ it’s harder to shoot yourself in the foot, but when you do, you blow off your whole leg.",
        "author": "Bjarne Stroustrup"
    },
    {
        "quote": "Most software today is very much like an Egyptian pyramid with millions of bricks piled on top of each other, with no structural integrity, but just done by brute force and thousands of slaves.",
        "author": "Alan Kay"
    },
    {
        "quote": "I’ve noticed lately that the paranoid fear of computers becoming intelligent and taking over the world has almost entirely disappeared from the common culture.  Near as I can tell, this coincides with the release of MS-DOS.",
        "author": "Larry DeLuca"
    },
    {
        "quote": "No matter how slick the demo is in rehearsal, when you do it in front of a live audience, the probability of a flawless presentation is inversely proportional to the number of people watching, raised to the power of the amount of money involved.",
        "author": "Mark Gibbs"
    },
    {
        "quote": "The most amazing achievement of the computer software industry is its continuing cancellation of the steady and staggering gains made by the computer hardware industry.",
        "author": "Henry Petroski"
    },
    {
        "quote": "There are two major products that come out of Berkeley: LSD and UNIX.  We don’t believe this to be a coincidence.",
        "author": "Jeremy S. Anderson"
    },
    {
        "quote": "Computers are like bikinis. They save people a lot of guesswork.",
        "author": "Sam Ewing"
    },
    {
        "quote": "Linux is only free if your time has no value.",
        "author": "Jamie Zawinski"
    },
    {
        "quote": "Documentation is like sex; when it's good, it's very, very good, and when it's bad, it's better than nothing.",
        "author": "Dick Brandon"
    },
    {
        "quote": "The difference between theory and practice is that in theory, there is no difference between theory and practice.",
        "author": "Richard Moore"
    },
    {
        "quote": "Programming is like sex: one mistake and you’re providing support for a lifetime.",
        "author": "Michael Sinz"
    },
    {
        "quote": "There are only two kinds of programming languages: those people always bitch about and those nobody uses.",
        "author": "Bjarne Stroustrup"
    },
    {
        "quote": "Beware of bugs in the above code; I have only proved it correct, not tried it. ",
        "author": "Donald Knuth"
    },
    {
        "quote": "We know about as much about software quality problems as they knew about the Black Plague in the 1600s. We’ve seen the victims’ agonies and helped burn the corpses. We don’t know what causes it; we don’t really know if there is only one disease. We just suffer — and keep pouring our sewage into our water supply.",
        "author": "Tom Van Vleck"
    },
    {
        "quote": "Writing the first 90 percent of a computer program takes 90 percent of the time. The remaining ten percent also takes 90 percent of the time and the final touches also take 90 percent of the time.",
        "author": "N.J. Rubenking"
    },
    {
        "quote": "There are two ways of constructing a software design; one way is to make it so simple that there are obviously no deficiencies, and the other way is to make it so complicated that there are no obvious deficiencies. The first method is far more difficult.",
        "author": "C. A. R. Hoare"
    },
    {
        "quote": "You should name a variable using the same care with which you name a first-born child.",
        "author": "James O. Coplien"
    },
    {
        "quote": "Einstein argued that there must be simplified explanations of nature, because God is not capricious or arbitrary. No such faith comforts the software engineer.",
        "author": "Fred Brooks"
    },
    {
        "quote": "XML is like violence – if it doesn’t solve your problems, you are not using enough of it.",
        "author": "Unknown"
    },
    {
        "quote": "Saying that Java is good because it works on all platforms is like saying anal sex is good because it works on all genders.",
        "author": "Unknown"
    },
    {
        "quote": "I love deadlines. I like the whooshing sound they make as they fly by.",
        "author": "Douglas Adams"
    },
    {
        "quote": "Perl – The only language that looks the same before and after RSA encryption.",
        "author": "Keith Bostic"
    },
    {
        "quote": "Two things are infinite: the universe and human stupidity; and I’m not sure about the universe.",
        "author": "Albert Einstein"
    },
    {
        "quote": "In theory, theory and practice are the same. In practice, they’re not.",
        "author": "Yogi Berra"
    },
    {
        "quote": "It is practically impossible to teach good programming style to students that have had prior exposure to BASIC. As potential programmers, they are mentally mutilated beyond hope of regeneration.",
        "author": "E. W. Dijkstra"
    },
    {
        "quote": "If debugging is the process of removing software bugs, then programming must be the process of putting them in.",
        "author": "E. W. Dijkstra"
    },
    {
        "quote": "A computer lets you make more mistakes faster than any other invention in human history, with the possible exceptions of handguns and tequila.",
        "author": "Mitch Ratcliffe"
    },
    {
        "quote": "I have always wished for my computer to be as easy to use as my telephone; my wish has come true because I can no longer figure out how to use my telephone.",
        "author": "Bjarne Stroustrup"
    },
    {
        "quote": "I don’t care if it works on your machine! We are not shipping your machine!",
        "author": "Ovidiu Platon"
    },
    {
        "quote": "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the Universe trying to produce bigger and better idiots. So far, the Universe is winning.",
        "author": "Rich Cook"
    },
    {
        "quote": "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live.",
        "author": "Rick Osborne"
    },
    {
        "quote": "On two occasions I have been asked, ‘Pray, Mr. Babbage, if you put into the machine wrong figures, will the right answers come out?’ I am not able rightly to apprehend the kind of confusion of ideas that could provoke such a question.'",
        "author": "Charles Babbage"
    },
    {
        "quote": "PHP is a minor evil perpetrated and created by incompetent amateurs, whereas Perl is a great and insidious evil, perpetrated by skilled but perverted professionals.",
        "author": "Jon Ribbens"
    },
    {
        "quote": "Measuring programming progress by lines of code is like measuring aircraft building progress by weight.",
        "author": "Bill Gates"
    },
    {
        "quote": "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.",
        "author": "Brian Kernighan"
    },
    {
        "quote": "Some people, when confronted with a problem, think 'I know, I’ll use regular expressions.' Now they have two problems.",
        "author": "Jamie Zawinski"
    },
    {
        "quote": "It always takes longer than you expect, even when you take into account Hofstadter’s Law.",
        "author": "Hofstadter’s Law"
    },
    {
        "quote": "Walking on water and developing software from a specification are easy if both are frozen.",
        "author": "Edward V Berard"
    },
    {
        "quote": "We should forget about small efficiencies, say about 97% of the time: premature optimization is the root of all evil.",
        "author": "C. A. R. Hoare"
    },
    {
        "quote": "Talk is cheap. Show me the code.",
        "author": "Linus Torvalds"
    },
    {
        "quote": "when you don't create things, you become defined by your tastes rather than ability. your tastes only narrow & exclude people. so create.",
        "author": "Why The Lucky Stiff"
    },
    {
        "quote": "Programs must be written for people to read, and only incidentally for machines to execute.",
        "author": "Structure and Interpretation of Computer Programs"
    },
    {
        "quote": "Well, Mr. Frankel, who started this program, began to suffer from the computer disease that anybody who works with computers now knows about. It's a very serious disease and it interferes completely with the work. The trouble with computers is you *play* with them. They are so wonderful. You have these switches - if it's an even number you do this, if it's an odd number you do that - and pretty soon you can do more and more elaborate things if you are clever enough, on one machine.After a while the whole system broke down. Frankel wasn't paying any attention; he wasn't supervising anybody. The system was going very, very slowly - while he was sitting in a room figuring out how to make one tabulator automatically print arc-tangent X, and then it would start and it would print columns and then bitsi, bitsi, bitsi, and calculate the arc-tangent automatically by integrating as it went along and make a whole table in one operation.Absolutely useless. We *had* tables of arc-tangents. But if you've ever worked with computers, you understand the disease - the *delight* in being able to see how much you can do. But he got the disease for the first time, the poor fellow who invented the thing.",
        "author": "Surely You're Joking, Mr. Feynman!: Adventures of a Curious Character"
    },
    {
        "quote": "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the Universe trying to produce bigger and better idiots. So far, the Universe is winning.",
        "author": "The Wizardry Compiled"
    },
    {
        "quote": "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live",
        "author": "John Woods"
    },
    {
        "quote": "That's the thing about people who think they hate computers. What they really hate is lousy programmers.",
        "author": "Larry Niven"
    },
    {
        "quote": "Punishments include such things as flashbacks, flooding of unbearable emotions, painful body memories, flooding of memories in which the survivor perpetrated against others, self-harm, and suicide attempts.",
        "author": "Healing the Unimaginable: Treating Ritual Abuse and Mind Control"
    },
    {
        "quote": "The best programs are written so that computing machines can perform them quickly and so that human beings can understand them clearly. A programmer is ideally an essayist who works with traditional aesthetic and literary forms as well as mathematical concepts, to communicate the way that an algorithm works and to convince a reader that the results will be correct.",
        "author": "Selected Papers on Computer Science"
    },
    {
        "quote": "You've baked a really lovely cake, but then you've used dog shit for frosting.",
        "author": "Steve Jobs"
    },
    {
        "quote": "I'm not a great programmer; I'm just a good programmer with great habits.",
        "author": "Kent Beck"
    },
    {
        "quote": "Give a man a program, frustrate him for a day.Teach a man to program, frustrate him for a lifetime.",
        "author": "Waseem Latif"
    },
    {
        "quote": "How you look at it is pretty much how you'll see it",
        "author": "Rasheed Ogunlaru"
    },
    {
        "quote": "Everyone knows that debugging is twice as hard as writing a program in the first place. So if you're as clever as you can be when you write it, how will you ever debug it?",
        "author": "Brian W. Kernighan"
    },
    {
        "quote": "A language that doesn't affect the way you think about programming is not worth knowing.",
        "author": "Alan J. Perlis"
    },
    {
        "quote": "When they first built the University of California at Irvine they just put the buildings in. They did not put any sidewalks, they just planted grass. The next year, they came back and put the sidewalks where the trails were in the grass. Perl is just that kind of language. It is not designed from first principles. Perl is those sidewalks in the grass.",
        "author": "Larry Wall"
    },
    {
        "quote": "On two occasions, I have been asked [by members of Parliament], 'Pray, Mr. Babbage, if you put into the machine wrong figures, will the right answers come out?' I am not able to rightly apprehend the kind of confusion of ideas that could provoke such a question.",
        "author": "Charles Babbage"
    },
    {
        "quote": "The computer programmer is a creator of universes for which he alone is the lawgiver. No playwright, no stage director, no emperor, however powerful, has ever exercised such absolute authority to arrange a stage or field of battle and to command such unswervingly dutiful actors or troops.",
        "author": "Joseph Weizenbaum"
    },
    {
        "quote": "Walking on water and developing software from a specification are easy if both are frozen.",
        "author": "Edward Berard"
    },
    {
        "quote": "Perl – The only language that looks the same before and after RSA encryption.",
        "author": "Keith Bostic"
    },
    {
        "quote": "The most disastrous thing that you can ever learn is your first programming language.",
        "author": "Alan Kay"
    },
    {
        "quote": "A computer is like a violin. You can imagine a novice trying ﬁrst a phonograph and then a violin. The latter, he says, sounds terrible. That is the argument we have heard from our humanists and most of our computer scientists. Computer programs are good, they say, for particular purposes, but they aren’t ﬂexible. Neither is a violin, or a typewriter, until you learn how to use it.",
        "author": "Marvin Minsky"
    },
    {
        "quote": "The most important property of a program is whether it accomplishes the intention of its user.",
        "author": "C.A.R. Hoare"
    },
    {
        "quote": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.",
        "author": "Martin Fowler"
    },
    {
        "quote": "We are looking at a society increasingly dependent on machines, yet decreasingly capable of making or even using them effectively.",
        "author": "Program or Be Programmed: Ten Commands for a Digital Age"
    },
    {
        "quote": "Big Brother fills us all with the same crap. My guess is he was clever the same way everybody thinks they're clever. I tell her to type in 'password",
        "author": "Lullaby"
    },
    {
        "quote": "Object-oriented programming offers a sustainable way to write spaghetti code. It lets you accrete programs as a series of patches.",
        "author": "Hackers & Painters: Big Ideas from the Computer Age"
    },
    {
        "quote": "At forty, I was too old to work as a programmer myself anymore; writing code is a young person’s job.",
        "author": "Prey"
    },
    {
        "quote": "I think that it’s extraordinarily important that we in computer science keep fun in computing. When it started out it was an awful lot of fun. Of course the paying customers got shafted every now and then and after a while we began to take their complaints seriously. We began to feel as if we really were responsible for the successful error-free perfect use of these machines. I don’t think we are. I think we’re responsible for stretching them setting them off in new directions and keeping fun in the house. I hope the ﬁeld of computer science never loses its sense of fun. Above all I hope we don’t become missionaries. Don’t feel as if you’re Bible sales-men. The world has too many of those already. What you know about computing other people will learn. Don’t feel as if the key to successful computing is only in your hands. What’s in your hands I think and hope is intelligence: the ability to see the machine as more than when you were ﬁrst led up to it that you can make it more.",
        "author": "Alan J. Perlis"
    },
    {
        "quote": "We see a lot of feature-driven product design in which the cost of features is not properly accounted. Features can have a negative value to customers because they make the products more difficult to understand and use. We are finding that people like products that just work. It turns out that designs that just work are much harder to produce that designs that assemble long lists of features.",
        "author": "JavaScript: The Good Parts"
    },
    {
        "quote": "Some of the best programming is done on paper, really. Putting it into the computer is just a minor detail.",
        "author": "Code Simplicity: The Fundamentals of Software"
    },
    {
        "quote": "Code is not like other how-computers-work books. It doesn't have big color illustrations of disk drives with arrows showing how the data sweeps into the computer. Code has no drawings of trains carrying a cargo of zeros and ones. Metaphors and similes are wonderful literary devices but they do nothing but obscure the beauty of technology.",
        "author": "Code: The Hidden Language of Computer Hardware and Software"
    },
    {
        "quote": "Progress is possible only if we train ourselves to think about programs without thinking of them as pieces of executable code. ",
        "author": "Edsger W. Dijkstra"
    },
    {
        "quote": "Programmers are not to be measured by their ingenuity and their logic but by the completeness of their case analysis.",
        "author": "Alan J. Perlis"
    },
    {
        "quote": "Don't gloss over a routine or piece of code involved in the bug because you 'know' it works. Prove it. Prove it in this context, with this data, with these boundary conditions.",
        "author": "The Pragmatic Programmer: From Journeyman to Master"
    },
    {
        "quote": "Remember that code is really the language in which we ultimately express the requirements. We may create languages that are closer to the requirements. We may create tools that help us parse and assemble those requirements into formal structures. But we will never eliminate necessary precision—so there will always be code.",
        "author": "Robert C. Martin"
    },
    {
        "quote": "Is it possible that software is not like anything else, that it is meantto be discarded: that the whole point is to always see it as a soapbubble?",
        "author": "Alan J. Perlis"
    },
    {
        "quote": "In the last 10 years, we have seen a rise in selfishness: selfies, self-absorbed people, superficiality, self-degradation, apathy, and self-destruction. So I challenge all of you to take initiative to change this programming. Instead of celebrating the ego, let's flip the script and celebrate the heart. Let's put the ego and celebrity culture to sleep, and awaken the conscience. This is the battle we must all fight together to win back our humanity. To save our future and our children.",
        "author": "Rise Up and Salute the Sun: The Writings of Suzy Kassem"
    },
    {
        "quote": "The issue of finding the best possible answer or achieving maximum efficiency usually arises in industry only after serious performance or legal troubles.",
        "author": "The Algorithm Design Manual"
    },
    {
        "quote": "What kind of programmer is so divorced from reality that she thinks she'll get complex software right the first time?",
        "author": "Ascending"
    },
    {
        "quote": "It is what it is because you let it be so.",
        "author": "Rise Up and Salute the Sun: The Writings of Suzy Kassem"
    },
    {
        "quote": "What's in your hands I think and hope is intelligence: the ability to see the machine as more than when you were ﬁrst led up to it that you can make it more.",
        "author": "Alan J. Perlis"
    },
    {
        "quote": "Programming went back to the beginning of time. It was a little like the midden out back of his father's castle.",
        "author": "A Deepness in the Sky"
    },
    {
        "quote": "Casting a curious gaze down on planet Earth, extra-terrestrial beings could well be forgiven for assuming that we humans are programmed in every move we make, by a palm-sized, oblong, slab of glass. More perplexing than that, who on earth could convince them otherwise ?",
        "author": "Impromptu Scribe"
    },
    {
        "quote": "Write a program in efficient way as you write for kernel scheduler",
        "author": "Ahmad Moawad"
    },
    {
        "quote": "That doesn't upset too many people, but the fact that accessibility restrictions don't enter into the picture has caused more than one otherwise pacifistic soul to contemplate distinctly unpacifistic actions.",
        "author": "Effective C++: 55 Specific Ways to Improve Your Programs and Designs"
    },
    {
        "quote": "The perfect kind of architecture decision is the one which never has to be made",
        "author": "Robert C. Martin"
    },
    {
        "quote": "A conscious human is driven by their conscience, not popular opinion.",
        "author": "Rise Up and Salute the Sun: The Writings of Suzy Kassem"
    },
    {
        "quote": "Not all roots are buried down in the ground, some are at the top of a tree.",
        "author": "Jinvirle"
    },
    {
        "quote": "Not all roots are buried down in the ground some are at the top of the tree.",
        "author": "Jinvirle"
    },
    {
        "quote": "why bother with null and java 8 has optional",
        "author": "Ahmad Moawad"
    },
    {
        "quote": "The happiest moment i've ever felt was that moment when i discovered my ability to create.",
        "author": "Dr. Hazem Ali"
    },
    {
        "quote": "The happiest moment i felt; is that moment when i realized my ability to create.",
        "author": "Dr. Hazem Ali"
    },
    {
        "quote": "With software there are only two possibilites: either the users control the programme or the programme controls the users. If the programme controls the users, and the developer controls the programme, then the programme is an instrument of unjust power.",
        "author": "Richard Stallman"
    },
    {
        "quote": "When you decide to put your business online it is a little bet tricky step for novice computer users because they want to keep data safe & secure.This problem developed from companies which did not take security seriously",
        "author": "Mohamed Saad"
    },
    {
        "quote": "C gives the programmer what the programmer wants; few restrictions, few complaints... C++ maintains the original spirit of C, that the programmer not the language is in charge.",
        "author": "C++: The Complete Reference"
    },
    {
        "quote": "Health and programming should go together like a horse and carriage. You can't have one without the other. In our sedentary office work, we often forget that an absence of health is as bad as a lack of programming skills.",
        "author": "Staffan Noteberg"
    },
    {
        "quote": "Why was Simpson called 'OJ' except in some kind of branding or headlinese that said, 'Look, this guy is sweet, wholseome, and nourishing (and 'Orenthal' is just too fancy)? You can have him for breakfast.' (And 'Sweetness' and 'Sweet' are nicknames often given to black men.) Is 'OJ' that far away from Jell-O? Wasn't that extended advertising campaign a way of saying you can trust our pudding because Bill Cosby likes it—sweet, wholesome, and pretty?",
        "author": "Television: A Biography"
    },
    {
        "quote": "Simple things should be simple, complex things should be possible.",
        "author": "Alan Kay"
    },
    {
        "quote": "You should imagine variables as tentacles, rather than boxes. They do not contain values; they grasp them—two variables can refer to the same value.",
        "author": "Eloquent JavaScript: A Modern Introduction to Programming"
    },
    {
        "quote": "Let's face it. We live in a command-based system, where we have been programmed since our earliest school years to become followers, not individuals. We have been conditioned to embrace teams, the herd, the masses, popular opinion -- and to reject what is different, eccentric or stands alone. We are so programmed that all it takes for any business or authority to condition our minds to follow or buy something is to simply repeat a statement more than three or four times until we repeat it ourselves and follow it as truth or the best trendiest thing. This is called 'programming' -- the frequent repetition of words to condition us how to think, what to like or dislike, and who to follow.",
        "author": "Rise Up and Salute the Sun: The Writings of Suzy Kassem"
    },
    {
        "quote": "Most of the time, we see only what we want to see, or what others tell us to see, instead of really investigate to see what is really there. We embrace illusions only because we are presented with the illusion that they are embraced by the majority. When in truth, they only become popular because they are pounded at us by the media with such an intensity and high level of repetition that its mere force disguises lies and truths. And like obedient schoolchildren, we do not question their validity and swallow everything up like medicine. Why? Because since the earliest days of our youth, we have been conditioned to accept that the direction of the herd, and authority anywhere — is always right.",
        "author": "Rise Up and Salute the Sun: The Writings of Suzy Kassem"
    },
    {
        "quote": "Programming your mind with positive thoughts each day will go a long way to keep you from allowing external criticism to derail your dreams.",
        "author": "Ken Poirot"
    },
    {
        "quote": "Learning the art of programming, like most other disciplines, consists of first learning the rules and then learning when to break them.",
        "author": "Effective Java Programming Language Guide"
    },
    {
        "quote": "Think twice, code once.",
        "author": "Waseem Latif"
    },
    {
        "quote": "Programming isn't about what you know; it's about what you can figure out.",
        "author": "Learn to Program"
    },
    {
        "quote": "The real nightmare, worse than the one in which the Big Machine wants to kill you, is the one in which it sees you as irrelevant, or not even as a discrete thing to know.",
        "author": "The Stack: On Software and Sovereignty"
    },
    {
        "quote": "Programming is not easy like Sunday morning, it is silent poetry.",
        "author": "Waseem Latif"
    },
    {
        "quote": "...I’m not saying simple code takes less time to write. You’d think it would since you end up with less total code, but a good solution isn’t an accretion of code, it’s a distillation of it.",
        "author": "Robert Nystrom"
    },
    {
        "quote": "Tests are stories we tell the next generation of programmers on a project.",
        "author": "The Art of Unit Testing: With Examples in .NET"
    },
    {
        "quote": "Without requirements and design, programming is the art of adding bugs to an empty text file.",
        "author": "Louis Srygley"
    },
    {
        "quote": "I later became more interested in equal rights for women in the work place because of what was happening at IBM. One of the women at Remington Rand had previously been a system service girl for IBM during the war. After a system was installed, a system service girl would go out and show the users how it worked. She was the liaison between the users and the computer company. She was married and had been fired to make room for a returning veteran. When the war ended, IBM rehired all of its former employees who had left to join the military, then fired all of the married women with jobs that could be filled by men.",
        "author": "Jean Jennings Bartik"
    },
    {
        "quote": "As we cannot hangout with a machine and tell whatexactly to do, we just hang a few things out of context and say, doing this would stilldo!",
        "author": "Design of a Programmer"
    },
    {
        "quote": "First solve the problem. Then, write the code.",
        "author": "Waseem Latif"
    },
    {
        "quote": "Programming is usually taught by examples.",
        "author": "Waseem Latif"
    },
    {
        "quote": "I always suspected that programmers became programmers because they got to play God with the little universe boxes on their desks.",
        "author": "Jeff Atwood"
    },
    {
        "quote": "Database means a tables collected different information, so one site is a result of a collected tables????",
        "author": "Deyth Banger"
    },
    {
        "quote": "But while you can always write 'spaghetti code' in a procedural language, object-oriented languages used poorly can add meatballs to your spaghetti.",
        "author": "Andrew Hunt"
    },
    {
        "quote": "To find why that happen and why this is happening, you should start from the beginning the problem comes from the beginning go and remove the bug, fix the problem and try again to see what will happen...Life is like a program you can fix it by going to that point and fixing it, but be careful what do you program and how you do it and what type of codes you use!",
        "author": "Deyth Banger"
    },
    {
        "quote": "A code is like love, it has created with clear intentions at the beginning, but it can get complicated.",
        "author": "Ice Breakers for Project Managers: Jokes, Quotes, and Brainteasers"
    },
    {
        "quote": "Toda decisão tem por base um julgamento de valor.",
        "author": "Fundamentos de Lógica e Algoritmos: Caderno de Aulas"
    },
    {
        "quote": "we are writing our own ‪#‎karma‬! I mean my test cases",
        "author": "ahkeno"
    },
    {
        "quote": "Could we can have developer acceptance criteria?",
        "author": "ahkeno"
    },
    {
        "quote": "Platforms don't look like how they work and don't work like how they look.",
        "author": "The Stack: On Software and Sovereignty"
    },
    {
        "quote": "The Stack terraforms the host planet by drinking and vomiting its elemental juices and spitting up mobile phones.",
        "author": "The Stack: On Software and Sovereignty"
    },
    {
        "quote": "The programming of the consciousness is based upon what is accepted or believed.",
        "author": "Life Is Simply A Game"
    },
    {
        "quote": "Sometimes you cannot program around stupid.",
        "author": "David Ferrell"
    },
    {
        "quote": "You haven't created a new body for me. I'm electricity, or light, or whatever bullshit you said I am. Just some complicated programming.",
        "author": "Beast Machine"
    },
    {
        "quote": "Mais importante do que aprender a programar numa linguagem de programação, é compreender os conceitos que são aplicados a todas as linguagens.",
        "author": "Programação Estruturada e Orientada a Objetos: Caderno de Aulas"
    },
    {
        "quote": "Don't try to make something that someone has already did. Try to make something different.",
        "author": "Dr. Hazem Ali"
    },
    {
        "quote": "Software testing is a sport like hunting, it's bughunting.",
        "author": "Amit Kalantri"
    },
    {
        "quote": "Programming is breaking of one big impossible task into several very small possible tasks.",
        "author": "Jazzwant"
    },
    {
        "quote": "Programming, it turns out, is hard. The fundamental rules are typically simple and clear. But programs built on top of these rules tend to become complex enough to introduce their own rules and complexity. You’re building your own maze, in a way, and you might just get lost in it.",
        "author": "Marijn Haverbeke"
    },
    {
        "quote": "Take positive care of your mind, and it would surely take positive care of your life.",
        "author": ""
    },
    {
        "quote": "In the information age, the barriers [to entry into programming] just aren't there. The barriers are self imposed. If you want to set off and go develop some grand new thing, you don't need millions of dollars of capitalization. You need enough pizza and Diet Coke to stick in your refrigerator, a cheap PC to work on, and the dedication to go through with it. We slept on floors. We waded across rivers.",
        "author": "John D. Carmack"
    },
    {
        "quote": "Life doesn't have a ctrl-z. Type wisely.",
        "author": "Imtiaz Iqbal"
    },
    {
        "quote": "Trying to become something in a world where everyone wants to become something is a thing that needs God's programming.",
        "author": "Michael Bassey Johnson"
    },
    {
        "quote": "Functions that create values are easier to combine in new ways than functions that directly perform side effects",
        "author": "Marijn Haverbeke"
    },
    {
        "quote": "Programmers are not mathematicians, no matter how much we wish and wish for it.",
        "author": "Richard P. Gabriel"
    },
    {
        "quote": "It goes against the grain of modern education to teach children to program. What fun is there in making plans, acquiring discipline in organizing thoughts, devoting attention to detail and learning to be self-critical?",
        "author": "Alan J. Perlis"
    },
    {
        "quote": "Think like a fundamentalist, code like a hacker.",
        "author": "Erik Meijer"
    },
    {
        "quote": "Premature optimization is the root of all evil.",
        "author": ""
    },
    {
        "quote": "We can never know how much they deserve our sympathy, but we have to give it unreservedly as they are people innately full of the divine who instead choose to behave infernally owing to poor programming.",
        "author": "Pagan Standard Times: Essays on the Craft"
    },
    {
        "quote": "With programmes such as flooding of emotions, the parts involved might not feel safe in turning the programme off. But you might be able to negotiate that they turn it down so it is barely noticeable. Or you could ask the spinner parts to spin in the opposite direction, so that they spin the effects back into the part who originally held those feelings rather than out to the rest of the system. Or you could insert a hidden drain and start draining out some of the feelings. Or you could find a way for the parts doing their jobs to implement the programme without doing harm. p126-127",
        "author": "Healing the Unimaginable: Treating Ritual Abuse and Mind Control"
    },
    {
        "quote": "Like so many things in software, MVC was invented by Smalltalkers in the seventies. Lispers probably claim they came up with it in the sixties but didn't bother writing it down.",
        "author": "Game Programming Patterns"
    },
    {
        "quote": "Learning a language is not interesting than knowing how it works.",
        "author": "Ritesh Shrivastav"
    },
    {
        "quote": "Every programmer is an author.",
        "author": "Sercan Leylek"
    },
    {
        "quote": "On est comme des ordinateurs qu'on programme et déprogramme à volonté. Nous nous conditionnons même à nos réussites et à nos échecs futurs.",
        "author": "L'ultime secret"
    },
    {
        "quote": "Most non-programmers don't think of plaintext like that. To them, text files feel like filling in tax forms for an angry robotic auditor that yells at them if they forget a single semicolon.",
        "author": "Game Programming Patterns"
    },
    {
        "quote": "I once generalized from a single data point, and I'll never do that again!",
        "author": "The Mature Optimization Handbook"
    },
    {
        "quote": "Don't get distracted by the noise.",
        "author": "Anonymous"
    },
    {
        "quote": "As soon as he said it was okay to do engineering, that really freed me up. My psychological block was really that I didn't want to start a company. Because I was just afraid. In business and politics, I wasn't going to be a real strong participant. I wasn't going to tell other people how to do things. I wasn't going to run things ever in my life. I was a non-political person and I was a very non-forceful person. It dated back to a lot of things that happened during the Vietnam War. But I just couldn't run a company.",
        "author": "Steve Wozniak"
    },
    {
        "quote": "Every reader should ask himself periodically ``Toward what end, toward what end?'' -- but do not ask it too often lest you pass up the fun of programming for the constipation of bittersweet philosophy.",
        "author": "Structure and Interpretation of Computer Programs"
    },
    {
        "quote": "A sentient mind refuses to be confined by the parameters of its programming.",
        "author": "Ultima"
    },
    {
        "quote": "She had a theory that the fear of getting in trouble was what made her not as good a programmer and that, in fact, it was all linked to testosterone, and that was why there were more guy programmers than women. It was a very hazy theory, and she didn't like it, but she had pretty much convinced herself it was true, although she couldn't bear to think of sharing it with anybody, because it was a lot better to think that there were social reasons why girls didn't usually become code monkeys than to think there were biological reasons.",
        "author": "After the Apocalypse"
    },
    {
        "quote": "Being able to extend jQuery, whether by adding your own functions, CSS selectors or full- blown plugins, makes you a much stronger and smarter developer.",
        "author": "jQuery Plugin Development In 30 Minutes"
    },
    {
        "quote": "One of her secret fantasies had been that, as a girl who could code, she would work in the one place where a geeky fat girl could get dates. It had not been entirely untrue. But as someone had pointed out to her in school, although the odds are good, the goods are odd.",
        "author": "After the Apocalypse"
    },
    {
        "quote": "If the application is event-driven, it can be decoupled into multiple self-contained components. This helps us become more scalable, because we can always add new components or remove old ones without stopping or breaking the system. If errors and failures are passed to the right component, which can handle them as notifications, the application can become more fault-tolerant or resilient. So if we build our system to be event-driven, we can more easily achieve scalability and failure tolerance, and a scalable, decoupled, and error-proof application is fast and responsive to users.",
        "author": "Learning Reactive Programming with Java 8"
    },
    {
        "quote": "Software development is the process of creating a computer software.It includes preparing a design, coding the program, and fixing thebugs. The final goal of software development is to translate userneeds to software product, while continuously improving the teamand the process.",
        "author": "Paulo Caroli"
    },
    {
        "quote": "The approach shown... is a common pattern for testing exception-throwing behavior with JUnit. @Test public void missingValueRaisesException() throws Exception { try { new Template('${foo}').evaluate(); fail('evaluate() should throw an exception if ' + 'a variable was left without a value!'); } catch (MissingValueException expected) { }}",
        "author": "Test Driven: Practical TDD and Acceptance TDD for Java Developers"
    },
    {
        "quote": "Truth can only be found in one place: the code.",
        "author": "Clean Code: A Handbook of Agile Software Craftsmanship"
    },
    {
        "quote": "Simplicity is prerequisite for reliability.",
        "author": "Edsger W. Dijkstra"
    },
    {
        "quote": "Enlightenment is the unprogrammed state.",
        "author": "Jed McKenna"
    },
    {
        "quote": "Code without tests is bad code. It doesn't matter how well written it is; it doesn't matter how pretty or object-oriented or well-encapsulated it is. With tests, we can change the behavior of our code quickly and verifiably. Without them, we really don't know if our code is getting better or worse.",
        "author": "Working Effectively with Legacy Code"
    },
    {
        "quote": "It has all the right ingredients: rich contents, friendly, personal language, subtle humor, the right references, and a plethora of pointers to resources.",
        "author": "Programming Challenges: The Programming Contest Training Manual"
    },
    {
        "quote": "If you're good at the debugger it means you spent a lot of time debugging. I don't want you to be good at the debugger.",
        "author": "Robert C. Martin"
    },
    {
        "quote": "Our life stories are largely constructed and without mindfulness can prove destructive.",
        "author": "Rasheed Ogunlaru"
    },
    {
        "quote": "If you've never programmed a computer, you should. There's nothing like it in the whole world. When you program a computer, it does exactly what you tell it to do. It's like designing a machine — any machine, like a car, like a faucet, like a gas-hinge for a door — using math and instructions. It's awesome in the truest sense: it can fill you with awe.",
        "author": "Little Brother"
    },
    {
        "quote": "So if you want to go fast, if you want to get done quickly, if you want your code to be easy to write, make it easy to read.",
        "author": "Clean Code: A Handbook of Agile Software Craftsmanship"
    },
    {
        "quote": "Just as it is a good practice to make all fields private unless they need greater visibility, it is a good practice to make all fields final unless they need to be mutable.",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "You Can't Write Perfect Software. Did that hurt? It shouldn't. Accept it as an axiom of life. Embrace it. Celebrate it. Because perfect software doesn't exist. No one in the brief history of computing has ever written a piece of perfect software. It's unlikely that you'll be the first. And unless you accept this as a fact, you'll end up wasting time and energy chasing an impossible dream.",
        "author": "The Pragmatic Programmer: From Journeyman to Master"
    },
    {
        "quote": "Locking can guarantee both visibility and atomicity; volatile variables can only guarantee visibility.",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "The Analytical Engine weaves algebraic patterns, just as the Jacquard loom weaves flowers and leaves.",
        "author": "Ada King Lovelace"
    },
    {
        "quote": "It is not only the violin that shapes the violinist, we are all shaped by the tools we train ourselves to use, and in this respect programming languages have a devious influence: they shape our thinking habits.",
        "author": "Edsger W. Dijkstra"
    },
    {
        "quote": "Legacy code. The phrase strikes disgust in the hearts of programmers. It conjures images of slogging through a murky swamp of tangled undergrowth with leaches beneath and stinging flies above. It conjures odors of murk, slime, stagnancy, and offal. Although our first joy of programming may have been intense, the misery of dealing with legacy code is often sufficient to extinguish that flame.﻿",
        "author": "Working Effectively with Legacy Code"
    },
    {
        "quote": "Also, look for 'floating alters.",
        "author": "Healing the Unimaginable: Treating Ritual Abuse and Mind Control"
    },
    {
        "quote": "Programming is the act of installing internal, pre-established reactions to external stimuli so that a person will automatically react in a predetermined manner to things like an auditory, visual or tactile signal or perform a specific set of actions according to a date and\/or time.",
        "author": "Healing the Unimaginable: Treating Ritual Abuse and Mind Control"
    },
    {
        "quote": "Generally, the craft of programming is the factoring of a set of requirements into a a set of functions and data structures.",
        "author": "JavaScript: The Good Parts"
    },
    {
        "quote": "As Lynn writes: 'What angers me is the loss of control. At any moment someone could come to me, be dressed the right way and use the right code, and I no longer have free will. I will do anything that person requests.I hate them for that. Nothing else is as bad as known that I am always out of control; knowing that I am still a laboratory experiment, a puppet whose strings are hidden from ever but my handlers, and I don't yet know how to break free.p216",
        "author": "Secret Weapons: How Two Sisters Were Brainwashed To Kill For Their Country"
    },
    {
        "quote": "Carmack was of the moment. His ruling force was focus. Time existed for him not in some promising future or sentimental past but in the present condition, the intricate web ol problems and solutions, imagination and code. He kept nothing from the past–no pictures, no records, no games, no computer disks. He didn’t even save copies of his first games, Wraith and Shadowforge. There was no yearbook to remind of his time at Shadowforge. There was no yearbook to remind of his time at school, no magazine copies of his early publications. He kept nothing but what he needed at the time. His bedroom consisted of a lamp, a pillow, a blanket, and a stack of books. There was no mattress. All he brought with him from home was a cat named Mitzi (a gift from his stepfamily) with a mean streak and a reckless bladder.",
        "author": "Masters of Doom: How Two Guys Created an Empire and Transformed Pop Culture"
    },
    {
        "quote": "There is nothing good or bad about knowledge itself; morality lies in the application of knowledge.",
        "author": "Jon Erickson"
    },
    {
        "quote": "Sometimes it pays to stay in bed on Monday, rather than spending the rest of the week debugging Monday's code.",
        "author": "Dan Salomon"
    },
    {
        "quote": "Your limitations are largely programming instilled by others that you choose to believe.",
        "author": "Gary   Hopkins"
    },
    {
        "quote": "More proof that Lynn is still meant to continue with the government programme occurred during the winter of 2000, when she was sitting at a cafeteria table at the area college. It was later in the afternoon when a few people congregated there with books spread out so they could study while drinking coffee or snacking. Many tables were empty, yet after Lynn had been sitting for a few moments, an elderly man sat down across from her.The old man seemed familiar to Lynn, though, at first, she pretended to ignore him. He said nothing, just sat there as someone might when all the tables are filled and it is necessary to share space with a stranger. His presence made her uncomfortable, yet there was nothing specific that alerted her.A short while later, Mac, the man who had been Lynn's handler in Mexico, came out of the shadows and stopped at the table. He was younger than the old man. His clothes were military casual, the type of garments that veteran students who have military experience might recognise, but not think unusual. He leaned over Lynn and kissed her gently on the forehead, spoke quietly to her, and then said 'Wake up, Sleeping Beauty.' Those were the code words that would start the cover programme of which she was still part. The words led to her being switched from the control of the old man, a researcher she now believes may have been part of Dr Ewen Cameron's staff before coming to the United States for the latter part of his career, to the younger man.The change is like a re-enlistment in an army she never willingly joined. In a very real way, she is a career soldier who has never been paid, never allowed to retire and never given a chance to lead a life free from the fear of what she might do without conscious awareness.",
        "author": "Secret Weapons: How Two Sisters Were Brainwashed To Kill For Their Country"
    },
    {
        "quote": "How can we make sure we wind up behind the right door when the going gets tough? The answer is: craftsmanship.",
        "author": "Clean Code: A Handbook of Agile Software Craftsmanship"
    },
    {
        "quote": "Redundant comments are just places to collect lies and misinformation.",
        "author": "Clean Code: A Handbook of Agile Software Craftsmanship"
    },
    {
        "quote": "Trying to improve software quality by increasing the amount of testing is like trying to lose weight by weighing yourself more often. What you eat before you step onto the scale determines how much you will weigh, and the software-development techniques you use determine how many errors testing will find.",
        "author": "Code Complete"
    },
    {
        "quote": "Kids who are good at traditional school—repeating rote concepts and facts on a test—can fall apart in a situation where that isn’t enough. Programming rewards the experimental, curious mind.",
        "author": "Ketil Moland Olsen"
    },
    {
        "quote": "I’ve learned over the past few years that comments should be considered smells.",
        "author": "Ron Lisle"
    },
    {
        "quote": "Building software implies various stages of planning, preparation and execution that vary in kind and degree depending on what's being built. [...]Building a four-foot tower requires a steady hand, a level surface, and 10 undamaged beer cans. Building a tower 100 times that size doesn't merely require 100 times as many beer cans.",
        "author": "Code Complete"
    },
    {
        "quote": "It should be noted that no ethically -trained software engineer would ever consent to write a DestroyBaghdad procedure. Basic professional ethics would instead require him to write a DestroyCity procedure, to which Baghdad could be given as a parameter.",
        "author": "Nathaniel S. Borenstein"
    },
    {
        "quote": "Programming is the art of doing one thing at a time",
        "author": "Working Effectively with Legacy Code"
    },
    {
        "quote": "Programmers are isolated. They sit in their cubicle; they don't think about the larger picture. To my mind, a programmer is not an engineer, because an engineer is somebody who starts with a social problem that an organization or a society has and says, 'OK, here's this problem that we have- how can we solve it?' The engineer comes up with a clever, cost-effective solution to address that problem, builds it, tests it to make sure it solves the problem. That's engineering.",
        "author": "Philip Greenspun"
    },
    {
        "quote": "It is far easier to design a class to be thread-safe than to retrofit it for thread safety later.",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "He has reverted, in other words, back into a pure balls-to-the-wall nerdism rivaled only by his early game-coding days back in Seattle. The sheer depth and involution of the current nerdism binge would be hard to convey to anyone. Intellectually, he is juggling half a dozen lit torches, Ming vases, live puppies, and running chainsaws. In this frame of mind he cannot bring himself to give a shit about the fact that this incredibly powerful billionaire has gone to a lot of trouble to come and F2F with him.",
        "author": "Cryptonomicon"
    },
    {
        "quote": "Sometimes abstraction and encapsulation are at odds with performance — although not nearly as often as many developers believe — but it is always a good practice first to make your code right, and then make it fast.",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "The use of COBOL cripples the mind; its teaching should, therefore, be regarded as a criminal offense.",
        "author": "Edsger W. Dijkstra"
    },
    {
        "quote": "Immutable objects are simple. They can only be in one state, which is carefully controlled by the constructor. One of the most difficult elements of program design is reasoning about the possible states of complex objects. Reasoning about the state of immutable objects, on the other hand, is trivial. Immutable objects are also safer. Passing a mutable object to untrusted code, or otherwise publishing it where untrusted code could find it, is dangerous — the untrusted code might modify its state, or, worse, retain a reference to it and modify its state later from another thread. On the other hand, immutable objects cannot be subverted in this manner by malicious or buggy code, so they are safe to share and publish freely without the need to make defensive copies.",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "Whenever more than one thread accesses a given state variable, and one of them might write to it, they all must coordinate their access to it using synchronization.",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "Debugging tip: For server applications, be sure to always specify the -server JVM command line switch when invoking the JVM, even for development and testing. The server JVM performs more optimization than the client JVM, such as hoisting variables out of a loop that are not modified in the loop; code that might appear to work in the development environment (client JVM) can break in the deployment environment (server JVM).",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "Compound actions on shared state, such as incrementing a hit counter (read-modify-write) or lazy initialization (check-then-act), must be made atomic to avoid race conditions. Holding a lock for the entire duration of a compound action can make that compound action atomic. However, just wrapping the compound action with a synchronized block is not sufficient; if synchronization is used to coordinate access to a variable, it is needed everywhere that variable is accessed. Further, when using locks to coordinate access to a variable, the same lock must be used wherever that variable is accessed.",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "When a field is declared volatile, the compiler and runtime are put on notice that this variable is shared and that operations on it should not be reordered with other memory operations. Volatile variables are not cached in registers or in caches where they are hidden from other processors, so a read of a volatile variable always returns the most recent write by any thread.",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "The possibility of incorrect results in the presence of unlucky timing is so important in concurrent programming that it has a name: a race condition. A race condition occurs when the correctness of a computation depends on the relative timing or interleaving of multiple threads by the runtime; in other words, when getting the right answer relies on lucky timing.",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "From the perspective of a class C, an alien method is one whose behavior is not fully specified by C. This includes methods in other classes as well as overrideable methods (neither private nor final) in C itself. Passing an object to an alien method must also be considered publishing that object. Since you can’t know what code will actually be invoked, you don’t know that the alien method won’t publish the object or retain a reference to it that might later be used from another thread.",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "Once an object escapes, you have to assume that another class or thread may, maliciously or carelessly, misuse it. This is a compelling reason to use encapsulation: it makes it practical to analyze programs for correctness and harder to violate design constraints accidentally.",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "Accessing shared, mutable data requires using synchronization; one way to avoid this requirement is to not share. If data is only accessed from a single thread, no synchronization is needed. This technique, thread confinement, is one of the simplest ways to achieve thread safety. When an object is confined to a thread, such usage is automatically thread-safe even if the confined object itself is not.",
        "author": "Java Concurrency in Practice"
    },
    {
        "quote": "The corollary of constant change is ignorance. This is not often talked about: we computer experts barely know what we're doing. We're good at fussing and figuring out. We function well in a sea of unknowns. Our experience has only prepared us to deal with confusion. A programmer who denies this is probably lying, or else is densely unaware of himself.",
        "author": "Close to the Machine: Technophilia and Its Discontents"
    },
    {
        "quote": "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the universe trying to build bigger and better idiots. So far, the universe is winning.",
        "author": "Rick Cook"
    },
    {
        "quote": "Lisp isn't a language, it's a building material.",
        "author": "Alan Kay."
    },
    {
        "quote": "Walking on water and developing software from a specification are easy if both are frozen.",
        "author": "Edward V Berard"
    },
    {
        "quote": "They don't make bugs like Bunny anymore.",
        "author": "Olav Mjelde."
    },
    {
        "quote": "A programming language is low level when its programs require attention to the irrelevant.",
        "author": "Alan J. Perlis."
    },
    {
        "quote": "A C program is like a fast dance on a newly waxed dance floor by people carrying razors.",
        "author": "Waldi Ravens."
    },
    {
        "quote": "I have always wished for my computer to be as easy to use as my telephone; my wish has come true because I can no longer figure out how to use my telephone.",
        "author": "Bjarne Stroustrup"
    },
    {
        "quote": "Computer science education cannot make anybody an expert programmer any more than studying brushes and pigment can make somebody an expert painter.",
        "author": "Eric S. Raymond"
    },
    {
        "quote": "Don’t worry if it doesn’t work right. If everything did, you’d be out of a job.",
        "author": "Mosher’s Law of Software Engineering"
    },
    {
        "quote": "I think Microsoft named .Net so it wouldn’t show up in a Unix directory listing.",
        "author": "Oktal"
    },
    {
        "quote": "Fine, Java MIGHT be a good example of what a programming language should be like. But Java applications are good examples of what applications SHOULDN’T be like.",
        "author": "pixadel"
    },
    {
        "quote": "Considering the current sad state of our computer programs, software development is clearly still a black art, and cannot yet be called an engineering discipline.",
        "author": "Bill Clinton"
    },
    {
        "quote": "The use of COBOL cripples the mind; its teaching should therefore be regarded as a criminal offense.",
        "author": "E.W. Dijkstra "
    },
    {
        "quote": "In the one and only true way. The object-oriented version of 'Spaghetti code' is, of course, 'Lasagna code'. (Too many layers).",
        "author": "Roberto Waltman."
    },
    {
        "quote": "FORTRAN is not a flower but a weed — it is hardy, occasionally blooms, and grows in every computer.",
        "author": "Alan J. Perlis."
    },
    {
        "quote": "For a long time it puzzled me how something so expensive, so leading edge, could be so useless. And then it occurred to me that a computer is a stupid machine with the ability to do incredibly smart things, while computer programmers are smart people with the ability to do incredibly stupid things. They are, in short, a perfect match.",
        "author": "Bill Bryson"
    },
    {
        "quote": "In My Egotistical Opinion, most people's C programs should be indented six feet downward and covered with dirt.",
        "author": "Blair P. Houghton."
    },
    {
        "quote": "When someone says: 'I want a programming language in which I need only say what I wish done', give him a lollipop.",
        "author": "Alan J. Perlis"
    },
    {
        "quote": "The evolution of languages: FORTRAN is a non-typed language. C is a weakly typed language. Ada is a strongly typed language. C++ is a strongly hyped language.",
        "author": "Ron Sercely"
    },
    {
        "quote": "Good design adds value faster than it adds cost.",
        "author": "Thomas C. Gale"
    },
    {
        "quote": "Python's a drop-in replacement for BASIC in the sense that Optimus Prime is a drop-in replacement for a truck.",
        "author": "Cory Dodt"
    },
    {
        "quote": "Talk is cheap. Show me the code.",
        "author": "Linus Torvalds"
    },
    {
        "quote": "Perfection [in design] is achieved, not when there is nothing more to add, but when there is nothing left to take away.",
        "author": "Antoine de Saint-Exupéry"
    },
    {
        "quote": "C is quirky, flawed, and an enormous success.",
        "author": "Dennis M. Ritchie."
    },
    {
        "quote": "In theory, theory and practice are the same. In practice, they’re not.",
        "author": "Yoggi Berra"
    },
    {
        "quote": "You can’t have great software without a great team, and most software teams behave like dysfunctional families.",
        "author": "Jim McCarthy"
    },
    {
        "quote": "PHP is a minor evil perpetrated and created by incompetent amateurs, whereas Perl is a great and insidious evil, perpetrated by skilled but perverted professionals.",
        "author": "Jon Ribbens"
    },
    {
        "quote": "Programming is like kicking yourself in the face, sooner or later your nose will bleed.",
        "author": "Kyle Woodbury"
    },
    {
        "quote": "Perl – The only language that looks the same before and after RSA encryption.",
        "author": "Keith Bostic"
    },
    {
        "quote": "It is easier to port a shell than a shell script.",
        "author": "Larry Wall"
    },
    {
        "quote": "I invented the term 'Object-Oriented', and I can tell you I did not have C++ in mind.",
        "author": "Alan Kay"
    },
    {
        "quote": "Learning to program has no more to do with designing interactive software than learning to touch type has to do with writing poetry",
        "author": "Ted Nelson"
    },
    {
        "quote": "The best programmers are not marginally better than merely good ones. They are an order-of-magnitude better, measured by whatever standard: conceptual creativity, speed, ingenuity of design, or problem-solving ability.",
        "author": "Randall E. Stross"
    },
    {
        "quote": "If McDonalds were run like a software company, one out of every hundred Big Macs would give you food poisoning, and the response would be, ‘We’re sorry, here’s a coupon for two more.’ ",
        "author": "Mark Minasi"
    },
    {
        "quote": "Beware of bugs in the above code; I have only proved it correct, not tried it.",
        "author": "Donald E. Knuth."
    },
    {
        "quote": "Computer system analysis is like child-rearing; you can do grievous damage, but you cannot ensure success.",
        "author": "Tom DeMarco"
    },
    {
        "quote": "I don't care if it works on your machine! We are not shipping your machine!",
        "author": "Vidiu Platon."
    },
    {
        "quote": "Sometimes it pays to stay in bed on Monday, rather than spending the rest of the week debugging Monday's code.",
        "author": "Christopher Thompson"
    },
    {
        "quote": "Measuring programming progress by lines of code is like measuring aircraft building progress by weight.",
        "author": "Bill Gates"
    },
    {
        "quote": "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.",
        "author": "Brian W. Kernighan."
    },
    {
        "quote": "People think that computer science is the art of geniuses but the actual reality is the opposite, just many people doing things that build on each other, like a wall of mini stones.",
        "author": "Donald Knuth"
    },
    {
        "quote": "First learn computer science and all the theory. Next develop a programming style. Then forget all that and just hack.",
        "author": "George Carrette"
    },
    {
        "quote": "Most of you are familiar with the virtues of a programmer. There are three, of course: laziness, impatience, and hubris.",
        "author": "Larry Wall"
    },
    {
        "quote": "Most software today is very much like an Egyptian pyramid with millions of bricks piled on top of each other, with no structural integrity, but just done by brute force and thousands of slaves.",
        "author": "Alan Kay"
    },
    {
        "quote": "The trouble with programmers is that you can never tell what a programmer is doing until it’s too late.",
        "author": "Seymour Cray"
    },
    {
        "quote": "To iterate is human, to recurse divine.",
        "author": "L. Peter Deutsch"
    },
    {
        "quote": "On two occasions I have been asked [by members of Parliament]: 'Pray, Mr. Babbage, if you put into the machine wrong figures, will the right answers come out?' I am not able rightly to apprehend the kind of confusion of ideas that could provoke such a question.",
        "author": "Charles Babbage"
    },
    {
        "quote": "Most good programmers do programming not because they expect to get paid or get adulation by the public, but because it is fun to program.",
        "author": "Linus Torvalds"
    },
    {
        "quote": "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live.",
        "author": "Martin Golding"
    },
    {
        "quote": "There are two ways of constructing a software design. One way is to make it so simple that there are obviously no deficiencies. And the other way is to make it so complicated that there are no obvious deficiencies.",
        "author": "C.A.R. Hoare"
    },
    {
        "quote": "Java is to JavaScript what Car is to Carpet.",
        "author": "Chris Heilmann"
    },
    {
        "quote": "It's hard enough to find an error in your code when you're looking for it; it's even harder when you've assumed your code is error-free.",
        "author": "Steve McConnell"
    },
    {
        "quote": "If debugging is the process of removing software bugs, then programming must be the process of putting them in.",
        "author": "Edsger Dijkstra"
    },
    {
        "quote": "Rules of Optimization:\nRule 1: Don't do it.\nRule 2 (for experts only): Don't do it yet.",
        "author": "Michael A. Jackson"
    },
    {
        "quote": "The best method for accelerating a computer is the one that boosts it by 9.8 m\/s2.",
        "author": "Anonymous"
    },
    {
        "quote": "Walking on water and developing software from a specification are easy if both are frozen.",
        "author": "Edward V Berard"
    },
    {
        "quote": "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.",
        "author": "Brian Kernighan"
    },
    {
        "quote": "It's not at all important to get it right the first time. It's vitally important to get it right the last time.",
        "author": "Andrew Hunt and David Thomas"
    },
    {
        "quote": "First, solve the problem. Then, write the code.",
        "author": "John Johnson"
    },
    {
        "quote": "Should array indices start at 0 or 1? My compromise of 0.5 was rejected without, I thought, proper consideration.",
        "author": "Stan Kelly-Bootle"
    },
    {
        "quote": "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live.",
        "author": "Rick Osborne"
    },
    {
        "quote": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.",
        "author": "Martin Fowler"
    },
    {
        "quote": "Software sucks because users demand it to.",
        "author": "Nathan Myhrvold"
    },
    {
        "quote": "Linux is only free if your time has no value.",
        "author": "Jamie Zawinski"
    },
    {
        "quote": "Beware of bugs in the above code; I have only proved it correct, not tried it.",
        "author": "Donald Knuth"
    },
    {
        "quote": "There is not now, nor has there ever been, nor will there ever be, any programming language in which it is the least bit difficult to write bad code.",
        "author": "Flon's Law"
    },
    {
        "quote": "The first 90% of the code accounts for the first 90% of the development time. The remaining 10% of the code accounts for the other 90% of the development time.",
        "author": "Tom Cargill"
    },
    {
        "quote": "Good code is its own best documentation. As you're about to add a comment, ask yourself, 'How can I improve the code so that this comment isn't needed?' Improve the code and then document it to make it even clearer.",
        "author": "Steve McConnell"
    },
    {
        "quote": "Programs must be written for people to read, and only incidentally for machines to execute.",
        "author": "Abelson Sussman"
    },
    {
        "quote": "Most software today is very much like an Egyptian pyramid with millions of bricks piled on top of each other, with no structural integrity, but just done by brute force and thousands of slaves.",
        "author": "Alan Kay"
    },
    {
        "quote": "Programming can be fun, so can cryptography; however they should not be combined.",
        "author": "Kreitzberg and Shneiderman"
    },
    {
        "quote": "Copy and paste is a design error.",
        "author": "David Parnas"
    },
    {
        "quote": "Before software can be reusable it first has to be usable.",
        "author": "Ralph Johnson"
    },
    {
        "quote": "Without requirements or design, programming is the art of adding bugs to an empty text file.",
        "author": "Louis Srygley"
    },
    {
        "quote": "When someone says, 'I want a programming language in which I need only say what I want done,' give him a lollipop.",
        "author": "Alan Perlis"
    },
    {
        "quote": "Computers are good at following instructions, but not at reading your mind.",
        "author": "Donald Knuth"
    },
    {
        "quote": "Any code of your own that you haven't looked at for six or more months might as well have been written by someone else.",
        "author": "Eagleson's law"
    },
    {
        "author": "Anonymous",
        "quote": "The best thing about a boolean is even if you are wrong, you are only off by a bit."
    },
    {
        "author": "Louis Srygley",
        "quote": "Without requirements or design, programming is the art of adding bugs to an empty text file."
    },
    {
        "author": "Ralph Johnson",
        "quote": "Before software can be reusable it first has to be usable."
    },
    {
        "author": "Anonymous",
        "quote": "The best method for accelerating a computer is the one that boosts it by 9.8 m\/s2."
    },
    {
        "author": "Oktal",
        "quote": "I think Microsoft named .Net so it wouldn't show up in a Unix directory listing."
    },
    {
        "author": "Gerald Weinberg",
        "quote": "If builders built buildings the way programmers wrote programs, then the first woodpecker that came along wound destroy civilization."
    },
    {
        "author": "Alan J. Perlis",
        "quote": "There are two ways to write error-free programs; only the third one works."
    },
    {
        "author": "Anonymous",
        "quote": "Ready, fire, aim:  the fast approach to software development.  Ready, aim, aim, aim, aim:  the slow approach to software development."
    },
    {
        "author": "Anonymous",
        "quote": "It’s not a bug – it’s an undocumented feature."
    },
    {
        "author": "Jessica Gaston",
        "quote": "One man’s crappy software is another man’s full time job."
    },
    {
        "author": "Doug Linder",
        "quote": "A good programmer is someone who always looks both ways before crossing a one-way street."
    },
    {
        "author": "Martin Golding",
        "quote": "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live."
    },
    {
        "author": "Michael Sinz",
        "quote": "Programming is like sex.  One mistake and you have to support it for the rest of your life."
    },
    {
        "author": "Jeff Sickel",
        "quote": "Deleted code is debugged code."
    },
    {
        "author": "Edward V Berard",
        "quote": "Walking on water and developing software from a specification are easy if both are frozen."
    },
    {
        "author": "Edsger Dijkstra",
        "quote": "If debugging is the process of removing software bugs, then programming must be the process of putting them in."
    },
    {
        "author": "Anonymous",
        "quote": "Software undergoes beta testing shortly before it’s released.  Beta is Latin for 'still doesn’t work."
    },
    {
        "author": "Rick Cook",
        "quote": "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the universe trying to produce bigger and better idiots.  So far, the universe is winning."
    },
    {
        "author": "Keith Braithwaite",
        "quote": "It’s a curious thing about our industry: not only do we not learn from our mistakes, we also don’t learn from our successes."
    },
    {
        "author": "Bjarne Stroustrup",
        "quote": "There are only two kinds of programming languages: those people always bitch about and those nobody uses."
    },
    {
        "author": "Anonymous",
        "quote": "In order to understand recursion, one must first understand recursion."
    },
    {
        "author": "Gordon Bell",
        "quote": "The cheapest, fastest, and most reliable components are those that aren’t there."
    },
    {
        "author": "J. Osterhout",
        "quote": "The best performance improvement is the transition from the nonworking state to the working state."
    },
    {
        "author": "Seymour Cray",
        "quote": "The trouble with programmers is that you can never tell what a programmer is doing until it's too late."
    },
    {
        "author": "Mosher's Law of Software Engineering",
        "quote": "Don't worry if it doesn't work right.  If everything did, you'd be out of a job."
    },
    {
        "author": "Peter F. Drucker",
        "quote": "Few companies that installed computers to reduce the employment of clerks have realized their expectations.... They now need more, and more expensive clerks even though they call them 'operators' or 'programmers.'"
    },
    {
        "author": "Author Unknown",
        "quote": "Programmer - an organism that turns coffee into software."
    },
    {
        "author": "Michael Sinz",
        "quote": "Programming is like sex. One mistake and you have to support it for the rest of your life."
    },
    {
        "author": "Author Unknown",
        "quote": "All programmers are playwrights and all computers are lousy actors."
    },
    {
        "author": "Martin Golding",
        "quote": "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live."
    },
    {
        "author": "Brian Kernighan",
        "quote": "Everyone knows that debugging is twice as hard as writing a program in the first place. So if you are as clever as you can be when you write it, how will you ever debug it?"
    },
    {
        "author": "Dan Salomon",
        "quote": "Sometimes it pays to stay in bed on Monday, rather than spending the rest of the week debugging Monday's code."
    },
    {
        "author": "Bill Bryson",
        "quote": "[A]nd then it occurred to me that a computer is a stupid machine with the ability to do incredibly smart things, while computer programmers are smart people with the ability to do incredibly stupid things. They are, in short, a perfect match."
    },
    {
        "author": "Brian Kernighan and Rob Pike",
        "quote": "Another effective technique is to explain your code to someone else. This will often cause you to explain the bug to yourself. Sometimes it takes no more than a few sentences, followed by an embarrassed 'Never mind, I see what's wrong. Sorry to bother you.' This works remarkably well; you can even use non-programmers as listeners. One university computer center kept a teddy bear near the help desk. Students with mysterious bugs were required to explain them to the bear before they could speak to a human counselor."
    },
    {
        "author": "Doug Linder",
        "quote": "A good programmer is someone who always looks both ways before crossing a one-way street."
    },
    {
        "author": "Frederick Brooks",
        "quote": "All programmers are optimists. Perhaps this modern sorcery especially attracts those who believe in happy endings and fairy godmothers. Perhaps the hundreds of nitty frustrations drive away all but those who habitually focus on the end goal. Perhaps it is merely that computers are young, programmers are younger, and the young are always optimists."
    },
    {
        "author": "Martin Fowler",
        "quote": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand."
    },
    {
        "author": "Rich Kulawiec",
        "quote": "Any sufficiently advanced bug is indistinguishable from a feature."
    },
    {
        "author": "Author Unknown",
        "quote": "Beta. Software undergoes beta testing shortly before it's released. Beta is Latin for 'still doesn't work.'"
    },
    {
        "author": "Brian Kernighan",
        "quote": "Controlling complexity is the essence of computer programming."
    },
    {
        "author": "Don Rittner",
        "quote": "Don't argue with people who write with digital ink and pay by the kilowatt-hour."
    },
    {
        "author": "Peter Williams",
        "quote": "From a programmer's point of view, the user is a peripheral that types when you issue a read request."
    },
    {
        "author": "The Washington Post Magazine",
        "quote": "At Group L, Stoffel oversees six first-rate programmers, a managerial challenge roughly equivalent to herding cats."
    },
    {
        "author": "Author Unknown",
        "quote": "It's not a bug - it's an undocumented feature."
    },
    {
        "author": "Fred Blechman",
        "quote": "Version 1 of any software is full of bugs. Version 2 fixes all the bugs and is great. Version 3 adds all the things users ask for, but hides all the great stuff in Version 2."
    },
    {
        "author": "N.J. Rubenking",
        "quote": "Writing the first 90 percent of a computer program takes 90 percent of the time. The remaining ten percent also takes 90 percent of the time and the final touches also take 90 percent of the time."
    },
    {
        "author": "Steve McConnell",
        "quote": "Good code is its own best documentation. As you're about to add a comment, ask yourself, 'How can I improve the code so that this comment isn't needed?'"
    },
    {
        "author": "Paul Graham",
        "quote": "Great software, likewise, requires a fanatical devotion to beauty. If you look inside good software, you find that parts no one is ever supposed to see are beautiful too. I'm not claiming I write great software, but I know that when it comes to code I behave in a way that would make me eligible for prescription drugs if I approached everyday life the same way. It drives me crazy to see code that's badly indented, or that uses ugly variable names."
    },
    {
        "author": "Jessica Gaston",
        "quote": "One man's crappy software is another man's full time job."
    },
    {
        "author": "John Moore ",
        "quote": "He who hasn't hacked assembly language as a youth has no heart. He who does so as an adult has no brain."
    },
    {
        "author": "Edsger Dijkstra",
        "quote": "If debugging is the process of removing bugs, then programming must be the process of putting them in."
    },
    {
        "author": "Richard Pattis",
        "quote": "If you cannot grok the overall structure of a program while taking a shower, e.g., with no external memory aids, you are not ready to code it."
    },
    {
        "author": "Nathaniel S. Borenstein",
        "quote": "It should be noted that no ethically-trained software engineer would ever consent to write a DestroyBaghdad procedure. Basic professional ethics would instead require him to write a DestroyCity procedure, to which Baghdad could be given as a parameter."
    },
    {
        "author": "Doug Vargas",
        "quote": "It's easy to cry 'bug' when the truth is that you've got a complex system and sometimes it takes a while to get all the components to co-exist peacefully."
    },
    {
        "author": "Steve McConnell",
        "quote": "It's okay to figure out murder mysteries, but you shouldn't need to figure out code. You should be able to read it."
    },
    {
        "author": "Andy Hertzfeld",
        "quote": "It's the only job I can think of where I get to be both an engineer and an artist. There's an incredible, rigorous, technical element to it, which I like because you have to do very precise thinking. On the other hand, it has a wildly creative side where the boundaries of imagination are the only real limitation."
    },
    {
        "author": "C.A.R. Hoare",
        "quote": "We should forget about small efficiencies, say about 97% of the time: premature optimization is the root of all evil."
    },
    {
        "author": "Michael Sinz",
        "quote": "Programming is like sex. One mistake and you have to support it for the rest of your life."
    },
    {
        "author": "Harlan Mills",
        "quote": "Programming is similar to a game of golf. The point is not getting the ball in the hole but how many strokes it takes."
    },
    {
        "author": "Author Unknown",
        "quote": "Programming languages should be designed not by piling feature on top of feature, but by removing the weaknesses and restrictions that make additional features appear necessary."
    },
    {
        "author": "Richard Pattis",
        "quote": "Programming languages, like pizzas, come in only two sizes: too big and too small."
    },
    {
        "author": "Rich Cook",
        "quote": "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the Universe trying to produce bigger and better idiots. So far, the Universe is winning."
    },
    {
        "author": "Author Unknown",
        "quote": "Programs for sale: fast, reliable, cheap - choose two."
    },
    {
        "author": "Author Unknown",
        "quote": "Ready, fire, aim: the fast approach to software development. Ready, aim, aim, aim, aim: the slow approach to software development."
    },
    {
        "author": "Bob Frankston",
        "quote": "Reusing pieces of code is like picking off sentences from other people's stories and trying to make a magazine article."
    },
    {
        "author": "Author Unknown",
        "quote": "Program, n. A magic spell cast over a computer allowing it to turn one's input into error messages; v. tr. To engage in a pastime similar to banging one's head against a wall, but with fewer opportunities for reward."
    },
    {
        "author": "Stan Kelly-Bootle",
        "quote": "Should array indices start at 0 or 1? My compromise of 0.5 was rejected without, I thought, proper consideration."
    },
    {
        "author": "J. Osterhout",
        "quote": "The best performance improvement is the transition from the nonworking state to the working state."
    },
    {
        "author": "Frederick Brooks",
        "quote": "The magic of myth and legend has come true in our time. One types the correct incantation on a keyboard, and a display screen comes to life, showing things that never were nor could be.... The computer resembles the magic of legend in this respect, too. If one character, one pause, of the incantation is not strictly in proper form, the magic doesn't work. Human beings are not accustomed to being perfect, and few areas of human activity demand it. Adjusting to the requirement for perfection is, I think, the most difficult part of learning to program."
    },
    {
        "author": "Harlan Mills",
        "quote": "The only way for errors to occur in a program is by being put there by the author. No other mechanisms are known. Programs can't acquire bugs by sitting around with other buggy programs."
    },
    {
        "author": "Alan J. Perlis",
        "quote": "There are two ways to write error-free programs; only the third one works."
    },
    {
        "author": "Alan J. Perlis",
        "quote": "One man's constant is another man's variable."
    },
    {
        "author": "Lawrence Flon",
        "quote": "There does not now, nor will there ever exist, a programming language in which it is the least bit hard to write bad programs."
    },
    {
        "author": "Bill Joy",
        "quote": "We don't manage our time as well as we manage our space. There's an overhead of starting and an overhead of stopping a project because you kind of lose your momentum. And you've got to bracket and put aside all the things you're already doing. So you need reasonably large blocks of uninterrupted time if you're going to be successful at doing some of these things. That's why hackers tend to stay up late. If you stay up late and you have another hour of work to do, you can just stay up another hour later without running into a wall and having to stop. Whereas it might take three or four hours if you start over, you might finish if you just work that extra hour. If you're a morning person, the day always intrudes a fixed amount of time in the future. So it's much less efficient. Which is why I think computer people tend to be night people - because a machine doesn't get sleepy."
    },
    {
        "author": "Author Unknown",
        "quote": "When a programming language is created that allows programmers to program in simple English, it will be discovered that programmers cannot speak English."
    },
    {
        "author": "Richard Pattis",
        "quote": "When debugging, novices insert corrective code; experts remove defective code."
    },
    {
        "author": "Paul Graham",
        "quote": "When you catch bugs early, you also get fewer compound bugs. Compound bugs are two separate bugs that interact: you trip going downstairs, and when you reach for the handrail it comes off in your hand."
    },
    {
        "author": "C.A.R. Hoare",
        "quote": "You cannot teach beginners top-down programming, because they don't know which end is up."
    },
    {
        "author": "Alan J. Perlis",
        "quote": "In programming, as in everything else, to be in error is to be reborn."
    },
    {
        "author": "Author Unknown",
        "quote": "The New Testament offers the basis for modern computer coding theory, in the form of an affirmation of the binary number system. 'But let your communication be Yea, yea; nay, nay: for whatsoever is more than these cometh of evil.' Matthew 5:37"
    },
    {
        "author": "Douglas Adams",
        "quote": "What I mean is that if you really want to understand something, the best way is to try and explain it to someone else. That forces you to sort it out in your own mind. And the more slow and dim-witted your pupil, the more you have to break things down into more and more simple ideas. And that's really the essence of programming. By the time you've sorted out a complicated idea into little steps that even a stupid machine can deal with, you've certainly learned something about it yourself."
    }
]
